[{"body": "1981 California’s Department of Health Services issued an “interim status document” for the lead recycling plant at 2700 S Indiana Avenue, Vernon, California, on December 18, 1981. Gould, Inc. owned it at the time. ", "photourl": "http://a.scpr.org/i/704fdc72ff5828c62d6ee90e5ccdee25/59342-eight.jpg", "readmoreurl": "", "title": "Lead recycling plant opens in Vernon", "caption": " Exide's Vernon plant takes apart and recycles 20-40,000 auto batteries a day. State regulators have shut it down as a threat to human health and the surrounding environment. ", "displaydate": "Dec. 18", "date": "December 18, 1981"}, {"body": "", "photourl": "", "readmoreurl": "", "title": "Gould changed its name to Gould-National Battery (GNB)", "caption": "", "displaydate": "1984", "date": "January 1, 1984"}, {"body": "Exide purchases GNB and its assets, including the plant in Vernon.", "photourl": "", "readmoreurl": "", "title": "GNB sells plant to Exide Technologies", "caption": "", "displaydate": "Oct. 2", "date": "October 2, 2000"}, {"body": "Between 1999-2000, DTSC found lead at levels of 40 percent in the sediment at the bottom of the storm water retention pond and required Exide to clean it up. DTSC “was clearly aware” that the storm water drain lines were bringing lead particulates to the pond and that the lines were reportedly “perforated” so that they could leak into the soil on purpose.", "photourl": "", "readmoreurl": "", "title": "California officials find high traces of lead near Exide", "caption": "", "displaydate": "1999", "date": "January 1, 1999"}, {"body": " In 2003, the DTSC fined Exide $40,000 for improper storage of used lead-acid batteries. Exide delayed payment because of the company's Chapter 11 bankruptcy filing.", "photourl": "", "readmoreurl": "http://www.scribd.com/doc/145386178/DTSC-s-2003-Consent-Order-for-Exide-Technologies-in-Vernon", "title": "Exide fined $40k", "caption": "", "displaydate": "Jan. 8", "date": "January 8, 2003"}, {"body": "The DTSC took emergency measures in 2004 and again in 2008 to force Exide to clean up a lead-contaminated drainage channel, and public areas like sidewalks, streets, and neighboring roofs.", "photourl": "", "readmoreurl": "", "title": "DTSC takes emergency measure to force Exide cleanup", "caption": "", "displaydate": "2004", "date": "January 1, 2004"}, {"body": "Exide paid $3,000 to settle two air quality violations with regulators.", "photourl": "", "readmoreurl": "", "title": "AQMD fines Exide", "caption": "", "displaydate": "March 26", "date": "March 26, 2004"}, {"body": "Exide paid $7,500 to settle an air quality violation with regulators.", "photourl": "", "readmoreurl": "", "title": "Air regulators fine Exide", "caption": "", "displaydate": "May 26", "date": "May 25, 2009"}, {"body": "The DTSC fines Exide $39,000 in 2006 for failing to minimize the possibility of hazardous releases.", "photourl": "", "readmoreurl": "http://www.scribd.com/doc/145386185/DTSC-s-2006-Consent-Order-for-Exide-Technologies-in-Vernon", "title": "Exide fined $25k", "caption": "", "displaydate": "August 16", "date": "August 16, 2006"}, {"body": "The closest Exide has ever come to having a permit to operate a hazardous waste facility came in 2006, when DTSC regulators circulated a draft permit for public comment. ", "photourl": "", "readmoreurl": "http://dtsc.ca.gov/HazardousWaste/Projects/upload/Exide_dPermit.pdf", "title": "DTSC circulates a draft permit for Exide facility", "caption": "", "displaydate": "June 1", "date": "June 1, 2006"}, {"body": "A study prepared by e2 Environmental for Exide at the request of the California Regional Water Quality Control Board and shared with DTSC officials in 2007 said modeling of the dispersion of heavy metals from the site “suggest that in the last three years, Exide has contributed through deposition approximately 424 lbs. of lead in both 2004 and 2005 and 712 lbs of lead in 2006 to the watershed.”", "photourl": "", "readmoreurl": "", "title": "Study finds Exide deposited 1500 pounds of lead into LA River watershed", "caption": "", "displaydate": "Sept. 24", "date": "September 24, 2007"}, {"body": "Exide paid $5,000 to settle an air quality violation with regulators.", "photourl": "", "readmoreurl": "", "title": "Air regulators fine Exide", "caption": "", "displaydate": "Feb. 28", "date": "February 29, 2008"}, {"body": "During an annual compliance evaluation inspection, DTSC officials find lead sludge in the stormwater retention basin. Exide tells regulators it cleans out the basin once a year. That discovery leads to an enforcement order in 2010.", "photourl": "", "readmoreurl": "http://www.scribd.com/doc/145386203/Annual-Compliance-Evaluation-Inspection-Report-for-Exide-2010", "title": "Lead sludge found in stormwater retention basin", "caption": "", "displaydate": "April 29", "date": "April 29, 2009"}, {"body": "Exide paid $150,000 to settle 14 air quality violations with regulators. In addition, Exide paid $250,000 to partially reimburse air regulatorsinvestigation and enforcement costs", "photourl": "", "readmoreurl": "", "title": "AQMD fines Exide $400K", "caption": "", "displaydate": "July 7", "date": "July 7, 2009"}, {"body": "DTSC fined Exide more than $100,000", "photourl": "", "readmoreurl": "http://www.scribd.com/doc/145386204/DTSC-s-2010-enforcement-order-for-Exide-s-Vernon-plant", "title": "DTSC fines Exide $100k", "caption": "", "displaydate": "August 12", "date": "August 12, 2010"}, {"body": "In November 2010, SCAQMD adopted Rule 1420.1 – Emissions Standards for Lead from Large Lead-Acid Battery Recycling Facilities. The rule imposed on Exide more stringent monitoring, operating and reporting requirements in order to meet the new lowered federal emissions standards for lead. Rule 1420.1 requires total facility enclosure, additional air monitoring and sampling, annual source testing and additional housekeeping measure", "photourl": "", "readmoreurl": "", "title": "More stringent monitoring goes into effect", "caption": "", "displaydate": "Nov. 5", "date": "November 5, 2010"}, {"body": "Exide tells air regulators that it exceeded ambient concentrations of lead that had been defined the previous November. By the beginning of 2012, the company lowered its air emissions of lead with additional measures, thereby complying with the law. \n", "photourl": "", "readmoreurl": "", "title": "Exide admits air pollution", "caption": "", "displaydate": "July 31", "date": "July 31, 2011"}, {"body": "Air regulators approved a settlement with Exide. The company paid $119,000 to settle 7 air quality violations.", "photourl": "", "readmoreurl": "", "title": "Air regulators fine Exide $119K", "caption": "", "displaydate": "June 19", "date": "June 19, 2012"}, {"body": "A Health Risk Aassessment submitted by Exide in January, 2013 indicates the Facility poses a maximum individual cancer risk (MICR) of 156 in one million for an offsite worker receptor about 300 meters northeast of the Facility (primarily arsenic). Air regulators also assert that the facility poses a maximum chronic hazard index (HI) of 63 for the respiratory system at the same offsite worker receptor identified in Section 16.1 (from arsenic). \n\n", "photourl": "http://a.scpr.org/i/09dde2f50a092357e8384a5baf7855cb/61855-wide.jpg", "readmoreurl": "", "title": "Health risk assesment finds cancer risk to those in vicinity of Exide", "caption": "State officials suspended operations at the Exide Technologies in Vernon, Calif. in April due to emissions of arsenic that could pose a health risk to 110,000 people in nearby communities. The plant is now reopened.", "displaydate": "March 1", "date": "March 1, 2013"}, {"body": "Underground pipelines used to convey the lead contaminated storm water to a hazardous waste treatment tank system are in poor conditions an accumulation of semi-solid sludge materials (also known in the industry as mud) generally throughout the piping system that contain elevated levels of hazardous waste, specifically metals (e.g., lead, arsenic and cadmium). The documents show several areas within the pipelines which depict failed structural integrity (breaches).", "photourl": "", "readmoreurl": "http://youtu.be/x_UnakLDCWM", "title": "Breaches in Exide underground pipelines detected", "caption": "An employee wearing a breathing mask works at Exide Technologies, a battery recycling plant has discharged harmful amounts of lead into surrounding communities.", "displaydate": "March 5", "date": "March 5, 2013"}, {"body": " AQMD orders Exide to submit a risk reduction plan for air emissions, and orders the company to hold public meetings, after a report completed in January shows cancer risks of 156 in a million mostly from arsenic in areas immediately surrounding the plant. ", "photourl": "http://a.scpr.org/i/983ca0a8aacb0a5d0f2ddaac1cf68394/61857-wide.jpg", "readmoreurl": "", "title": "AQMD orders risk assessment, public meetings", "caption": "", "displaydate": "March 24", "date": "March 24, 2013"}, {"body": "DTSC chief Debbie Raphael ordered Exide to be closed, finding that “an imminent and substantial danger to the public health, safety and the environment” exists. The finding was based on a “recent report” submitted by Exide showing that underground storm sewer pipelines are releasing toxic material to the environment, and on a report submitted by Exide to AQMD showing that toxic emissions pose a risk to the surrounding community. ", "photourl": "http://a.scpr.org/i/3cd10b4eb2ac337130bec7066d6d2f84/61856-eight.jpg", "readmoreurl": "http://www.scribd.com/doc/145386216/DTSC-s-Suspension-Order-for-Exide-Technologies", "title": "Exide shut down", "caption": "State officials shut down operations at Exide Technologies in Vernon, Calif. in April due to toxic air pollution that may pose health risks to members of the surrounding community. The plant is now open again.", "displaydate": "April 24", "date": "April 24, 2013"}, {"body": "Exide Technologies contests the shutdown and calls for a hearing before an administrative law judge. “The DTSC has known of the issues raised in the Order and Accusation for an extended period of time, and has consented to Exide’s continued operation,” wrote the Los Angeles firm of Sheppard, Mullin, Richter & Hampton, in the notice of defense Exide submitted. \n\n", "photourl": "http://a.scpr.org/i/09a4d9915749452889f009bc64b5ba35/61854-wide.jpg", "readmoreurl": "http://www.scribd.com/doc/145386220/Exide-Technologies-Notice-of-Defense", "title": "Exide rejects findings, calls for hearing", "caption": "Community members attend a meeting at the Huntington Park Community Center about air pollution from Exide Technologies in Vernon, Calif. on May 30th, 2013.", "displaydate": "May 7", "date": "May 7, 2013"}]