[{"body": "1981 California’s Department of Health Services issued an “interim status document” for the lead recycling plant at 2700 S Indiana Avenue, Vernon, California, on December 18, 1981. Gould, Inc. owned it at the time. ", "mediaurl": "http://a.scpr.org/i/704fdc72ff5828c62d6ee90e5ccdee25/59342-full.jpg", "readmoreurl": "", "title": "Lead recycling plant opens in Vernon", "mediatype": "image", "caption": " Exide's Vernon plant takes apart and recycles 20-40,000 auto batteries a day. State regulators have shut it down as a threat to human health and the surrounding environment. ", "displaydate": "Dec. 18", "date": "12/18/1981", "readmoresource": ""}, {"body": " ", "mediaurl": "", "readmoreurl": "", "title": "Gould changed its name to Gould-National Battery", "mediatype": "", "caption": "", "displaydate": "1984", "date": "1/2/1984", "readmoresource": ""}, {"body": "Between 1999-2000, DTSC found lead at levels of 40 percent in the sediment at the bottom of the storm water retention pond and required the Vernon plant's operators to clean it up. DTSC “was clearly aware” that the storm water drain lines were bringing lead particulates to the pond and that the lines were reportedly “perforated” so that they could leak into the soil on purpose.", "mediaurl": "", "readmoreurl": "", "title": "Toxics officials find high traces of lead near Vernon plant", "mediatype": "", "caption": "", "displaydate": "1999", "date": "1/2/1999", "readmoresource": ""}, {"body": "Exide purchases GNB and its assets, including the plant in Vernon.", "mediaurl": "", "readmoreurl": "", "title": "GNB sells plant to Exide Technologies", "mediatype": "", "caption": "", "displaydate": "Oct. 2", "date": "10/2/2000", "readmoresource": ""}, {"body": " In 2003, the DTSC fined Exide $40,000 for improper storage of used lead-acid batteries. Exide delayed payment because of the company's Chapter 11 bankruptcy filing.", "mediaurl": "", "readmoreurl": "http://www.scribd.com/doc/145386178/DTSC-s-2003-Consent-Order-for-Exide-Technologies-in-Vernon", "title": "DTSC fines Exide $40K", "mediatype": "", "caption": "", "displaydate": "Jan. 8", "date": "1/8/2003", "readmoresource": ""}, {"body": "The DTSC took emergency measures in 2004 and again in 2008 to force Exide to clean up a lead-contaminated drainage channel, and public areas like sidewalks, streets, and neighboring roofs.", "mediaurl": "", "readmoreurl": "", "title": "DTSC takes emergency measure to force Exide cleanup", "mediatype": "", "caption": "", "displaydate": "2004", "date": "1/31/2004", "readmoresource": ""}, {"body": "Exide paid $3,000 to settle two air quality violations with regulators.", "mediaurl": "", "readmoreurl": "", "title": "AQMD fines Exide", "mediatype": "", "caption": "", "displaydate": "March 26", "date": "3/26/2004", "readmoresource": ""}, {"body": "Until recently, the closest Exide came to having a permit to operate a hazardous waste facility came in 2006, when DTSC regulators circulated a draft permit for public comment. ", "mediaurl": "", "readmoreurl": "http://dtsc.ca.gov/HazardousWaste/Projects/upload/Exide_dPermit.pdf", "title": "DTSC circulates a draft permit for Exide facility", "mediatype": "", "caption": "", "displaydate": "June 1", "date": "6/1/2006", "readmoresource": ""}, {"body": "Not long after beginning consideration of a permit for the Vernon plant, DTSC fined Exide $39,000 in 2006 for failing to minimize the possibility of hazardous releases.", "mediaurl": "", "readmoreurl": "http://www.scribd.com/doc/145386185/DTSC-s-2006-Consent-Order-for-Exide-Technologies-in-Vernon", "title": "DTSC fines Exide $25K", "mediatype": "", "caption": "", "displaydate": "Aug. 16", "date": "8/16/2006", "readmoresource": ""}, {"body": "A study prepared by e2 Environmental for Exide at the request of the California Regional Water Quality Control Board (and shared with DTSC officials in 2007) suggests that \"Exide has contributed through deposition approximately 424 lbs. of lead in both 2004 and 2005 and 712 lbs of lead in 2006 to the watershed.”", "mediaurl": "", "readmoreurl": "", "title": "Study finds Exide deposited 1500 pounds of lead into LA River watershed", "mediatype": "", "caption": "", "displaydate": "Sept. 24", "date": "9/24/2007", "readmoresource": ""}, {"body": "Exide paid $5,000 to settle an air quality violation with regulators.", "mediaurl": "", "readmoreurl": "", "title": "Exide pays $5k fine to AQMD", "mediatype": "", "caption": "", "displaydate": "Feb. 28", "date": "2/29/2008", "readmoresource": ""}, {"body": "During an annual compliance evaluation inspection, DTSC officials find lead sludge in the stormwater retention basin. (Exide tells regulators it cleans out the basin once a year.) That discovery leads to an enforcement order in 2010.", "mediaurl": "", "readmoreurl": "http://www.scribd.com/doc/145386203/Annual-Compliance-Evaluation-Inspection-Report-for-Exide-2010", "title": "Lead sludge found in stormwater retention basin", "mediatype": "", "caption": "", "displaydate": "April 29", "date": "4/29/2009", "readmoresource": ""}, {"body": "Exide paid $7,500 to settle an air quality violation with regulators.", "mediaurl": "", "readmoreurl": "", "title": "Exide again settles violations with AQMD", "mediatype": "", "caption": "", "displaydate": "May 26", "date": "5/25/2009", "readmoresource": ""}, {"body": "Exide paid $150,000 to settle 14 air quality violations with regulators. In addition, Exide paid $250,000 to partially reimburse air regulatorsinvestigation and enforcement costs.", "mediaurl": "", "readmoreurl": "", "title": "Exide settles with AQMD over violations, pays $400K", "mediatype": "", "caption": "", "displaydate": "July 7", "date": "7/7/2009", "readmoresource": ""}, {"body": "DTSC fined Exide more than $100,000.", "mediaurl": "", "readmoreurl": "http://www.scribd.com/doc/145386204/DTSC-s-2010-enforcement-order-for-Exide-s-Vernon-plant", "title": "DTSC fines Exide $100k", "mediatype": "", "caption": "", "displaydate": "Aug. 12", "date": "8/12/2010", "readmoresource": ""}, {"body": "In November 2010, SCAQMD adopted Rule 1420.1, which set emission standards for Exide and another company, Quemetco, within the South Coast air basin. The rule imposes more stringent monitoring, operating and reporting requirements in order to meet the new lowered federal emissions standards for lead. Rule 1420.1 requires total facility enclosure, additional air monitoring and sampling, annual source testing and additional housekeeping measures.", "mediaurl": "", "readmoreurl": "", "title": "AQMD tightens emissions rule, requires more monitoring of lead battery facilities", "mediatype": "", "caption": "", "displaydate": "Nov. 5", "date": "11/5/2010", "readmoresource": ""}, {"body": "Exide tells air regulators that it exceeded ambient concentrations of lead that had been defined the previous November. By the beginning of 2012, the company lowered its air emissions of lead with additional measures, thereby complying with the law. \n", "mediaurl": "", "readmoreurl": "", "title": "Exide admits air pollution", "mediatype": "", "caption": "", "displaydate": "July 31", "date": "7/31/2011", "readmoresource": ""}, {"body": "Air regulators approved a settlement with Exide. The company paid $119,000 to settle 7 air quality violations.", "mediaurl": "", "readmoreurl": "", "title": "Air regulators fine Exide $119K", "mediatype": "", "caption": "", "displaydate": "June 19", "date": "6/19/2012", "readmoresource": ""}, {"body": "A Health Risk Aassessment submitted by Exide in January, 2013 indicates the Facility poses a maximum individual cancer risk (MICR) of 156 in one million for an offsite worker receptor about 300 meters northeast of the Facility (primarily arsenic). Air regulators also assert that the facility poses a maximum chronic hazard index (HI) of 63 for the respiratory system at the same offsite worker receptor identified in Section 16.1 (from arsenic). \n\n", "mediaurl": "http://a.scpr.org/i/09dde2f50a092357e8384a5baf7855cb/61855-full.jpg", "readmoreurl": "", "title": "Health assesment finds cancer risk for those in vicinity of Exide", "mediatype": "image", "caption": "State officials suspended operations at the Exide Technologies in Vernon, Calif. in April due to emissions of arsenic that could pose a health risk to 110,000 people in nearby communities. The plant is now reopened.", "displaydate": "March 1", "date": "3/1/2013", "readmoresource": ""}, {"body": "Underground pipelines used to convey the lead contaminated storm water to a hazardous waste treatment tank system are in poor conditions an accumulation of semi-solid sludge materials (also known in the industry as mud) generally throughout the piping system that contain elevated levels of hazardous waste, specifically metals (e.g., lead, arsenic and cadmium). The documents show several areas within the pipelines which depict failed structural integrity (breaches).", "mediaurl": "http://a.scpr.org/i/de592a3c480fd6d36e7266787f8a0092/62003-full.jpg", "readmoreurl": "http://youtu.be/x_UnakLDCWM", "title": "Breaches in Exide underground pipelines detected", "mediatype": "image", "caption": "An employee wearing a breathing mask works at Exide Technologies, a battery recycling plant has discharged harmful amounts of lead into surrounding communities.", "displaydate": "March 5", "date": "3/5/2013", "readmoresource": ""}, {"body": " AQMD orders Exide to submit a risk reduction plan for air emissions, and orders the company to hold public meetings, after a report completed in January shows cancer risks of 156 in a million mostly from arsenic in areas immediately surrounding the plant. ", "mediaurl": "", "readmoreurl": "", "title": "AQMD responds to cancer risk study, orders risk reduction plan", "mediatype": "", "caption": "", "displaydate": "March 24", "date": "3/24/2013", "readmoresource": ""}, {"body": "DTSC chief Debbie Raphael ordered Exide to be closed, finding that “an imminent and substantial danger to the public health, safety and the environment” exists. The finding was based on a “recent report” submitted by Exide showing that underground storm sewer pipelines are releasing toxic material to the environment, and on a report submitted by Exide to AQMD showing that toxic emissions pose a risk to the surrounding community. ", "mediaurl": "", "readmoreurl": "http://www.scribd.com/doc/145386216/DTSC-s-Suspension-Order-for-Exide-Technologies", "title": "Exide shut down, briefly", "mediatype": "", "caption": "", "displaydate": "April 24", "date": "4/24/2013", "readmoresource": ""}, {"body": "Exide Technologies contests the shutdown and calls for a hearing before an administrative law judge. “The DTSC has known of the issues raised in the Order and Accusation for an extended period of time, and has consented to Exide’s continued operation,” wrote the Los Angeles firm of Sheppard, Mullin, Richter & Hampton, in the notice of defense Exide submitted. \n\n", "mediaurl": "http://a.scpr.org/i/09a4d9915749452889f009bc64b5ba35/61854-full.jpg", "readmoreurl": "http://www.scribd.com/doc/145386220/Exide-Technologies-Notice-of-Defense", "title": "Exide rejects findings, calls for hearing", "mediatype": "image", "caption": "Community members attend a meeting at the Huntington Park Community Center about air pollution from Exide Technologies in Vernon, Calif. on May 30th, 2013.", "displaydate": "May 7", "date": "5/7/2013", "readmoresource": ""}, {"body": "Exide Technologies reported $1.9 billion in assets and $1.1 billion in liabilities as of the end of last quarter. By entering Chapter 11, the company is likely to avoid paying off maturing bonds and payments for debt interest, both due later this year.", "mediaurl": "http://a.scpr.org/i/91f3d1a92ae5b796fd611903c5a6e97d/101643-full.jpg", "readmoreurl": "http://www.scpr.org/blogs/environment/2013/06/10/13937/troubled-battery-recycling-plant-owner-exide-techn/", "title": "Exide Technologies files for Ch. 11 bankruptcy protection", "mediatype": "image", "caption": "", "displaydate": "June 10", "date": "6/10/2013", "readmoresource": "KPCC"}, {"body": "Judge Luis Lavin issues a restraining order against the DTSC, writing that Exide would be irreparably harmed by a slow administrative hearing, and that the public interest will not suffer by allowing the lead recycler to get the Vernon plant back to work.", "mediaurl": "", "readmoreurl": "", "title": "Judge prevents Exide shutdown", "mediatype": "", "caption": "", "displaydate": "July 2", "date": "7/2/2013", "readmoresource": ""}, {"body": "Baghouses reduce emissions from furnace feed rooms and other places within the Vernon plant. Exide reported \"excessive heat\" damage in one of those baghouses, then restarted operations. AQMD inspectors issued a notice of violation for that, since both baghouses must be working when the plant is working. The incident stopped Exide operations until July 15th.", "mediaurl": "", "readmoreurl": "http://www.aqmd.gov/prdas/AB2588/Exide/Exide.html", "title": "Apparent fire at Exide", "mediatype": "", "caption": "Apparent fire at Exide baghouse temporarily shuts down operations", "displaydate": "July 7", "date": "7/7/2013", "readmoresource": ""}, {"body": "The reverberatory furnace and the blast furnace are steps in the smelting process for lead. Creating heat to apply to recyclable material  produces carbon monoxide, a toxic gas that is colorless and colorless, and can create dizziness, fatigue, disorientation and nausea. Air regulators limit the amount of carbon monoxide a source can emit over a 30-day period; to stay within the limits, plant regulators turned off the furnaces. Air regulators report that Exide began reheating the furnaces for active use in early August. ", "mediaurl": "", "readmoreurl": "", "title": "Exide shuts down two furnaces", "mediatype": "", "caption": "Emissions limits drive the plant's operators to take two furnaces offline", "displaydate": "July 23", "date": "7/23/2013", "readmoresource": ""}, {"body": "The company faced a deadline to submit this report, imposed by regulators from the South Coast Air Quality Management DIstrict. Now regulators have 3 months to approve the plan, or send it back as inadequate. ", "mediaurl": "", "readmoreurl": "http://www.aqmd.gov/prdas/AB2588/Exide/ExideRiskReductionPlan.pdf", "title": "Exide submits risk reduction report", "mediatype": "", "caption": "Exide gives regulators a plan to reduce hazards posed by air emissions that include toxic chemicals", "displaydate": "Aug. 28", "date": "8/28/2013", "readmoresource": ""}, {"body": "Dust testing is the first step in an additional effort overseen by the Department of Toxic Substances Control and Exide. Soil testing will follow; results will come in November. ", "mediaurl": "http://a.scpr.org/i/960b1de44bad16b097d16021c8ada16d/67356-full.jpg", "readmoreurl": "http://www.scpr.org/blogs/environment/2013/08/30/14626/soil-dust-testing-underway-at-vernon-s-exide-techn/", "title": "Dust testing underway", "mediatype": "image", "caption": "Environ, an independent firm, tests dust within 1500 feet of Exide.", "displaydate": "Aug. 29", "date": "8/29/2013", "readmoresource": "KPCC"}, {"body": "On this day, the blast furnace is again shut down, for a water leak. A few days earlier, a piece of the Kiln baghouse blower motor broke, and required replacement. And a blower motor that directs emissions into a contained area was down in early August. In each of these incidents, Exide notified regional air quality inspectors about the setbacks, and inspectors came onsite. ", "mediaurl": "", "readmoreurl": "", "title": "Minor breakdowns continue through August in Vernon", "mediatype": "", "caption": "Air regulators investigate reports of ongoing problems", "displaydate": "Aug. 30", "date": "8/30/2013", "readmoresource": ""}, {"body": "State regulators say they're nearing a deal with Exide to ensure cleanup and safe operation. Boyle Heights, Bell, and Maywood neighbors are skeptical. ", "mediaurl": "http://a.scpr.org/i/bc9e6c7b6b5cee80d75013ff1c1210bc/67357-full.jpg", "readmoreurl": "http://www.scpr.org/news/2013/09/03/39006/state-nears-a-deal-to-keep-exide-open-neighbors-an/", "title": "State nears a deal to keep Exide open; cleanup assurances sought", "mediatype": "image", "caption": "Environmental testing near Exide Technologies' Vernon plant included sampling for toxic contamination in dust on August 29, 2013. ", "displaydate": "Sept. 3", "date": "9/3/2013", "readmoresource": "KPCC"}, {"body": "The idea is to calm concerns in neighborhoods around troubled battery recycler, but public health officials and regulators are offering fewer answers than questions. ", "mediaurl": "http://a.scpr.org/i/acfa27ccfd66996520f759eae8a37e6a/68101-full.jpg", "readmoreurl": "http://www.scpr.org/blogs/environment/2013/09/14/14744/public-health-officials-to-offer-lead-screening-te/", "title": "Public health officials to offer lead screening tests; battery recycler asked to pay", "mediatype": "image", "caption": "At Resurrection Church in Boyle Heights, September 9, 2013, people and politicians from east LA and surrounding cities talked about how to pressure Exide Technologies to operate more safely in Vernon. ", "displaydate": "Sept. 14", "date": "9/14/2013", "readmoresource": "KPCC"}, {"body": "Already afoul of air and toxic regulators, Exide must now monitor lead emissions on a daily, not monthly, basis. The company remains in Chapter 11 reorganization.", "mediaurl": "", "readmoreurl": "http://www.scpr.org/blogs/environment/2013/09/18/14781/troubled-battery-plant-in-vernon-cuts-production-a/", "title": "Exide cuts production after air monitor finds too much lead in emissions", "mediatype": "", "caption": "", "displaydate": "Sept. 18", "date": "9/18/2013", "readmoresource": "KPCC"}, {"body": "The Department of Toxic Substances Control will issue an order requiring Exide to clean up leaky stormwater pipes and control toxic substances in air emissions.", "mediaurl": "", "readmoreurl": "http://www.scpr.org/blogs/environment/2013/10/07/14913/battery-recycler-exide-to-stay-open-as-toxic-regul/", "title": "DTSC reverses itself, permits Exide to stay open", "mediatype": "", "caption": "State officials suspended operations at the Exide Technologies in Vernon, Calif. in April due to emissions of arsenic that could pose a health risk to 110,000 people in nearby communities. The plant is now reopened.", "displaydate": "Oct. 7", "date": "10/7/2013", "readmoresource": "KPCC"}, {"body": "People near a lead battery recycling plant in Vernon demanded answers from regulators and lawmakers about the facility's future during a tense four-hour meeting. DTSC chief Debbie Raphael insists, over catcalls from a packed hall in Resurrection Church, that regulators would remain tough on problems at the Vernon plant. \"If Exide cannot find a way to do that — if they cannot find a way to operate without polluting communities, then we will revoke their permit. You heard it from me.\" ", "mediaurl": "http://a.scpr.org/i/2b86ec6529a199b3ebf2ccbd1b393389/69744-full.jpg", "readmoreurl": "http://www.scpr.org/blogs/environment/2013/10/09/14934/town-hall-meeting-offers-little-satisfaction-for-p/", "title": "Town hall meeting offers little satisfaction for people living near Exide's Vernon plant", "mediatype": "image", "caption": "Yolanda Santoyo, a Boyle Heights community member, speaks out during a meeting on Tuesday between residents and state officials about the future of the Exide battery recycling plant.", "displaydate": "Oct. 8", "date": "10/9/2013", "readmoresource": "KPCC"}, {"body": "Lawyers for the South Coast AQMD appealed to the district's hearing board to shut Exide down for \"failing to adequately capture and control gaseous emissions from its blast and reverbatory furnaces, including...arsenic.\"", "mediaurl": "", "readmoreurl": "http://www.aqmd.gov/prdas/AB2588/Exide/Exide-OrderForAbatement.pdf", "title": "AQMD lawyers petition to shut Exide down", "mediatype": "", "caption": "", "displaydate": "Oct. 18", "date": "10/18/2013", "readmoresource": ""}, {"body": "More than a hundred people turned out for the South Coast Air Quality Management District's hearing about the Vernon-based Exide battery recycling plant.", "mediaurl": "", "readmoreurl": "http://www.scpr.org/blogs/environment/2013/12/14/15408/air-regulators-seek-public-comment-on-vernon-batte/", "title": "Air regulators seek public comment on Vernon battery recycler ", "mediatype": "", "caption": "", "displaydate": "Dec. 14", "date": "12/14/2013", "readmoresource": "KPCC"}, {"body": "Exide cuts back production after reporting its elevated lead readings from the previous week.", "mediaurl": "", "readmoreurl": "http://www.latimes.com/local/la-me-exide-20140110,0,6309451.story#axzz2q2SplpzZ", "title": "Exide cuts back production", "mediatype": "", "caption": "", "displaydate": "Jan. 9", "date": "1/9/2014", "readmoresource": "L.A. Times"}, {"body": "Regional air regulators tighten rules for arsenic and other toxic emissions at Exide and Quemetco, the region's two battery recycling plants.\n", "mediaurl": "http://a.scpr.org/i/1a62c974d23688808edf246cebd8e670/69795-full.jpg", "readmoreurl": "http://www.scpr.org/blogs/environment/2014/01/10/15578/regulators-tighten-emission-limits-for-arsenic-oth/", "title": "Regulators tighten emission limits for arsenic, other toxics from Exide", "mediatype": "image", "caption": "Exide opponent Barbara Martinez of La Educacion during a town hall meeting at the Resurrection School in October 2013. ", "displaydate": "Jan. 10", "date": "1/10/2014", "readmoresource": "KPCC"}, {"body": "The South Coast AQMD lowers the allowable limits for arsenic emissions and two types of organic emissions, benzene and 1,3-butadiene. Exide has 60 days to lower arsenic emissions to an interim level; it has a year to reach the final lower levels called for in the rule. ", "mediaurl": "", "readmoreurl": "http://www.scpr.org/blogs/environment/2014/01/10/15578/regulators-tighten-emission-limits-for-arsenic-oth/", "title": "AQMD tightens emissions rule", "mediatype": "", "caption": "", "displaydate": "Jan. 10", "date": "1/10/2014", "readmoresource": "KPCC"}, {"body": "The South Coast Air Quality Management District alleges Exide Technologies has committed numerous air pollution violations linked to lead and arsenic emissions.", "mediaurl": "", "readmoreurl": "http://www.scpr.org/blogs/environment/2014/01/16/15629/air-regulators-seek-40-million-in-penalties-in-pol/", "title": "Air regulators seek $40 million in penalties in pollution suit against Exide", "mediatype": "", "caption": "", "displaydate": "Jan. 16", "date": "1/16/2014", "readmoresource": "KPCC"}, {"body": "The state Senate is targeting a Southern California battery recycling facility that has operated for 32 years without a final permit.", "mediaurl": "", "readmoreurl": "http://www.scpr.org/news/2014/01/23/41768/bill-targets-permit-process-for-battery-recycler-e/", "title": "Bill targets permit process for battery recycler Exide", "mediatype": "", "caption": "", "displaydate": "Jan. 23", "date": "1/23/2014", "readmoresource": "KPCC"}, {"body": "Vernon-based Exide is petitioning in LA Superior Court and directly to air regulators to have a recently-passed air quality rule scrubbed.\n", "mediaurl": "", "readmoreurl": "http://www.scpr.org/blogs/environment/2014/02/11/15815/exide-sues-aqmd-regulators-not-to-block-rule-it-sa/", "title": "Exide sues AQMD regulators, not to block rule, it says, but to ask for more time", "mediatype": "", "caption": "", "displaydate": "Feb. 11", "date": "2/11/2014", "readmoresource": "KPCC"}, {"body": "Test results showed unexpected levels of lead at the Volunteers of America Salazar Park Head Start pre-school program.", "mediaurl": "http://a.scpr.org/i/bb4141c9cf48814e0ed351c9720ad573/69796-full.jpg", "readmoreurl": "http://www.scpr.org/news/2014/03/10/42725/exide-update-high-lead-test-near-los-angeles-area/", "title": "Lead found in soil around Exide in Vernon; DTSC regulators order more tests", "mediatype": "image", "caption": "Diana del Pozo-Mora, right, puts a gas mask on her seven-year-old daughter, Josephine Mora, during a town hall meeting at the Resurrection School on Tuesday, Oct. 8 about Exide Technologies, a lead-recycling plant in Vernon.", "displaydate": "March 10", "date": "3/10/2014", "readmoresource": "KPCC"}, {"body": "County health officials had planned to begin offering blood lead level screenings to neighbors of the battery recycling plant months ago. The tests have yet to begin.", "mediaurl": "", "readmoreurl": "http://www.scpr.org/news/2014/03/12/42772/after-5-months-still-no-blood-tests-for-neighbors/", "title": "After 5 months, still no blood tests for neighbors of Exide", "mediatype": "", "caption": "", "displaydate": "March 12", "date": "3/12/2014", "readmoresource": "KPCC"}, {"body": "The company submitted three versions of its risk reduction plan before air officials signed off, though AQMD is still trying to halt lead smelting operations.", "mediaurl": "http://a.scpr.org/i/09dde2f50a092357e8384a5baf7855cb/61855-full.jpg", "readmoreurl": "http://www.scpr.org/blogs/environment/2014/03/20/16146/exide-aqmd-make-plan-to-reduce-arsenic-risk-around/", "title": "Exide, AQMD make plan to reduce arsenic risk around Vernon battery plant", "mediatype": "image", "caption": "State officials suspended operations at the Exide Technologies in Vernon, Calif. in April due to emissions of arsenic that could pose a health risk to 110,000 people in nearby communities. The plant is now reopened.", "displaydate": "March 20", "date": "3/20/2014", "readmoresource": "KPCC"}, {"body": "Los Angeles County was supposed to offer free tests by last fall. A county official says planning took much longer than expected.", "mediaurl": "http://a.scpr.org/i/f35100aa710e41af194eb31320a0db25/80663-full.jpg", "readmoreurl": "http://www.scpr.org/news/2014/03/20/42916/regulators-tell-exide-neighbors-to-keep-kids-out-o/", "title": "Free blood tests for Exide neighbors are still more than 2 weeks off ", "mediatype": "image", "caption": "Teresa Marquez of East Los Angeles addresses state toxics regulators at a meeting about elevated lead levels found in homes near Vernon's Exide recycling plant.", "displaydate": "March 20", "date": "3/20/2014", "readmoresource": "KPCC"}, {"body": "Exides work plan offers no timeline for completing the testing around its Vernon plant, and toxics regulators must approve plans before more testing happens.", "mediaurl": "http://a.scpr.org/i/29243b8821fc7e7281f4ae7c31618953/69797-full.jpg", "readmoreurl": "http://www.scpr.org/blogs/environment/2014/03/21/16165/exide-proposes-testing-more-houses-deeper-soil-in/", "title": "Exide proposes testing more houses, deeper soil in second round of testing for lead", "mediatype": "image", "caption": "Deborah Raphael, director of the department of toxic substances control, speaks during a town hall meeting at the Resurrection School on Tuesday, Oct. 8 about Exide Technologies, a lead-recycling plant in Vernon.", "displaydate": "March 21", "date": "3/21/2014", "readmoresource": "KPCC"}, {"body": "County health officials say anyone living within two miles of the troubled battery recycler can have their blood tested for free. ", "mediaurl": "", "readmoreurl": "http://www.scpr.org/news/2014/04/07/43301/lead-blood-tests-for-exide-neighbors-begin-today/", "title": "Exide neighbors can now get blood tests for lead ", "mediatype": "", "caption": "", "displaydate": "April 7", "date": "4/7/2014", "readmoresource": "KPCC"}, {"body": "In January, AQMD adopted a regulation that would require Exide to achieve negative pressure at its facilities by April 10, with the intention of limiting emissions of arsenic and other toxins. ", "mediaurl": "", "readmoreurl": "http://www.scpr.org/news/2014/04/08/43387/exide-denied-more-time-to-reduce-arsenic-pollution/", "title": "Exide denied more time to reduce arsenic pollution", "mediatype": "", "caption": "An employee wearing a breathing mask works at Exide Technologies, a battery recycling plant that has discharged harmful amounts of lead into surrounding communities.", "displaydate": "April 8", "date": "4/8/2014", "readmoresource": "KPCC"}, {"body": "Pointing to almost two dozen recent violations of lead standards, the AQMD seeks to stop maintenance work at the already-closed Exide Technologies plant in Vernon. ", "mediaurl": "", "readmoreurl": "http://www.scpr.org/news/2014/04/11/43456/regional-air-regulators-step-up-efforts-to-shutter/", "title": "Regional air regulators step up efforts to shutter Exide's operations in Vernon", "mediatype": "", "caption": "The Exide Technologies plant in Vernon, California is closed for maintenance, but has still racked up nearly 2 dozen air pollution violations from local regulators. ", "displaydate": "April 11", "date": "4/11/2014", "readmoresource": "KPCC"}, {"body": "The layoff notices for salaried and unionized workers are temporary, but Exide isn't saying whether it will meet environmental deadlines or re-open. \n", "mediaurl": "http://a.scpr.org/i/e39c30d24e191d8eb333d7db75ff43ce/61858-full.jpg", "readmoreurl": "http://www.scpr.org/blogs/environment/2014/04/21/16427/exide-lays-off-more-than-120-employees-at-vernon-p/", "title": "Exide lays off more than 120 employees at Vernon plant", "mediatype": "image", "caption": "Community members including employees for Exide Technologies attend a meeting at the Huntington Park Community Center about air pollution from the Vernon, Calif. plant. (May 30th, 2013)", "displaydate": "April 21", "date": "4/21/2014", "readmoresource": "KPCC"}, {"body": "A troubled lead battery recycling facility in Vernon violated the Clean Air Act&#39;s emissions standards on more than 30 occasions, according to a notice of violation released Thursday by U.", "mediaurl": "", "readmoreurl": "http://www.scpr.org/news/2014/05/22/44330/epa-tells-exide-its-lead-emissions-violated-federa/", "title": "EPA tells Exide its lead emissions violated federal law", "mediatype": "", "caption": "State officials shut down operations at Exide Technologies in Vernon, Calif. in April due to toxic air pollution that may pose health risks to members of the surrounding community. ", "displaydate": "May 22", "date": "5/22/2014", "readmoresource": "KPCC"}, {"body": "Troubled lead battery recycler, Exide Technologies, will lose permission to handle hazardous waste in Vernon unless it fixes problems in its application to do so. ", "mediaurl": "http://a.scpr.org/i/983ca0a8aacb0a5d0f2ddaac1cf68394/61857-full.jpg", "readmoreurl": "http://www.scpr.org/news/2014/06/17/44788/state-toxics-regulators-give-exide-30-days-to-corr/", "title": "State toxics regulators give Exide 30 days to correct permit problems", "mediatype": "image", "caption": "Exide has been smelting and recycling lead from batteries in Vernon, but it has never received a permit to do so. Instead it has been operating under temporary authorization for decades. ", "displaydate": "June 17", "date": "6/17/2014", "readmoresource": "KPCC"}, {"body": "The county sent a notice about the tests to 30,000 homes, but so far only 150 people have had their blood tested, and only one has had an elevated lead level.", "mediaurl": "http://a.scpr.org/i/d3b18f905ec708f4459f866d80849243/87827-full.jpg", "readmoreurl": "http://www.scpr.org/news/2014/07/07/45179/county-blood-testing-for-exide-neighbors-suffering/", "title": "Few of Exide's neighbors have gotten blood tests for lead ", "mediatype": "image", "caption": "Adelene Vasquez, an East L.A. activist campaigning to close the Exide battery recycling plant, said it is no surprise that few people have gotten their blood tested for lead contamination, given the county's lackluster promotion of its free testing program. At the same time, community groups have not pushed the program, either.", "displaydate": "July 7", "date": "7/7/2014", "readmoresource": "KPCC"}, {"body": "The lead-battery recycling plant will have to stay closed until it installs more air pollution controls and takes steps to limit lead dust. ", "mediaurl": "", "readmoreurl": "http://www.scpr.org/news/2014/07/10/45248/orders-clear-the-air-in-exide-pollution-fight/", "title": "Orders clear the air in Exide pollution fight", "mediatype": "", "caption": "An employee wearing a breathing mask works at Exide Technologies, a battery recycling plant has discharged harmful amounts of lead into surrounding communities.", "displaydate": "July 10", "date": "7/10/2014", "readmoresource": "KPCC"}, {"body": "The company was ordered by toxics regulators to dig up polluted soil around two private residences after tests revealed lead exceedances at the properties. ", "mediaurl": "", "readmoreurl": "http://www.scpr.org/news/2014/08/11/45903/exide-to-remove-lead-polluted-soil-from-two-homes/", "title": "Exide to remove lead-polluted soil from 2 homes north of its Vernon plant", "mediatype": "", "caption": "Exide begins to remove lead-polluted soil on Monday morning at a house on the 1200 block of La Puerta Street in Boyle Heights.", "displaydate": "Aug. 11", "date": "8/11/2014", "readmoresource": "KPCC"}, {"body": "L.A. County supervisors have signed a letter imploring the governor to intervene in the cleanup of contamination around the Exide Technologies plant in Vernon.\n", "mediaurl": "http://a.scpr.org/i/4986539fb3ed263585f1c252b5b37d76/90098-full.jpg", "readmoreurl": "http://www.scpr.org/blogs/environment/2014/08/12/17139/la-county-supervisors-criticize-piecemeal-cleanup/", "title": "LA County supervisors criticize 'piecemeal' cleanup around Exide, seek money for lead testing", "mediatype": "image", "caption": "Exide begins to remove lead-polluted soil on Monday morning at a house on the 1200 block of La Puerta Street in Boyle Heights.", "displaydate": "Aug. 12", "date": "8/12/2014", "readmoresource": "KPCC"}, {"body": "Workers are taking out soil from a home in the Los Angeles neighborhood of Boyle Heights. The dirt is laced with potentially harmful lead dust, part of a cleanup ordered by state regulators. Southern California Public Radio's Molly Peterson says the lead battery recycler, Exide Technologies, is picking up the tab.", "mediaurl": "http://a.scpr.org/i/d98ce9df0f44c1a3540c858fc0c6fd4f/90103-full.jpg", "readmoreurl": "http://www.scpr.org/programs/take-two/2014/08/12/38834/battery-recycler-exide-paying-for-lead-dust-cleanu/", "title": "Battery recycler Exide paying for lead dust cleanup", "mediatype": "image", "caption": "Excavation crews measure a dump truck to see if it will fit in the driveway of a private property. After removing lead-polluted soil, crews will replace it with clean fill soil.", "displaydate": "Aug. 12", "date": "8/12/2014", "readmoresource": "KPCC"}, {"body": "Federal grand jury is investigating the company for criminal liability related to hazardous materials transportation and air emissions. The news comes out in Exide's quarterly SEC filing. ", "mediaurl": "", "readmoreurl": "", "title": "Exide receives a subpoena from a federal grand jury", "mediatype": "", "caption": "", "displaydate": "Aug. 8", "date": "8/16/2014", "readmoresource": ""}, {"body": "Nearly five months into the six-month program to test thousands of Exide neighbors for lead contamination, only 160 people have been tested.", "mediaurl": "http://a.scpr.org/i/4ba20501978ae1e51a73c2b660051583/69791-full.jpg", "readmoreurl": "http://www.scpr.org/news/2014/08/19/46097/participation-remains-low-in-blood-testing-program/", "title": "Participation still low in blood testing program for Exide neighbors", "mediatype": "image", "caption": "Community members at a town hall about the Exide plant in October 2013. Local anti-Exide activists have been ambivalent about the program to test people's blood for lead contamination, since there would be no way to connect Exide to any positive results.", "displaydate": "Aug. 19", "date": "8/19/2014", "readmoresource": "KPCC"}, {"body": "The plan of reorganization was submitted to a Delaware bankruptcy court, two years after Exide filed with the court seeking protection from creditors.", "mediaurl": "", "readmoreurl": "", "title": "Exide announces it has submitted a plan of reorganization", "mediatype": "", "caption": "", "displaydate": "Nov. 14", "date": "11/14/2014", "readmoresource": ""}, {"body": "In a monthly report to the South Coast AQMD, Exide describes work it's doing in Vernon towards re-opening the plant, including installing a new blast furnace enclosure. ", "mediaurl": "", "readmoreurl": "", "title": "Exide describes progress in report South Coast AQMD", "mediatype": "", "caption": "", "displaydate": "February 13", "date": "2/13/2015", "readmoresource": ""}, {"body": "Air regulators lower emissions standards further on Exide and the only other lead battery recycler west of the Mississippi, Quemetco. ", "mediaurl": "", "readmoreurl": "", "title": "Emissions standards lowered", "mediatype": "", "caption": "", "displaydate": "March 6", "date": "3/6/2015", "readmoresource": ""}, {"body": "Senate President Pro Tem Kevin de León writes to the state Department of Toxic Substances Control, urging regulators to close down Exide's Vernon facility permanently. ", "mediaurl": "", "readmoreurl": "", "title": "Legislator asks for permanent closure", "mediatype": "", "caption": "", "displaydate": "March 6", "date": "3/6/2015", "readmoresource": ""}, {"body": "Exide Technologies will shut down for good as the result of a negotiated settlement with the U.S. Attorney’s office. Under the deal, Exide Technologies will avoid federal criminal liability. Last August, a federal grand jury began investigating Exide over air emissions and the transportation of hazardous materials. The company revealed the investigation in a quarterly filing with the Securities and Exchange Commission. Exide sought protection from creditors in a Delaware bankruptcy court nearly 2 years ago. In its most recent public comments, the company announced it intended to emerge from Chapter 11 bankruptcy by the end of March.", "mediaurl": "http://a.scpr.org/i/3cd10b4eb2ac337130bec7066d6d2f84/61856-full.jpg", "readmoreurl": "http://www.scpr.org/news/2015/03/12/50323/vernon-based-exide-technologies-to-shut-down-perma/", "title": "Exide to shut down permanently under deal with US Attorney", "mediatype": "image", "caption": "", "displaydate": "March 11", "date": "3/11/2015", "readmoresource": "KPCC"}, {"body": "Data is presented to a committee overseeing the Exide clean-up suggests a much larger area potentially affected by pollution from the plant, encompassing thousands of additional homes.", "mediaurl": "", "readmoreurl": "http://www.scpr.org/news/2015/08/14/53799/lead-based-pollution-from-exide-smelter-may-have-r/", "title": "Data suggest larger area contaminated than previously thought", "mediatype": "", "caption": "", "displaydate": "August 13", "date": "8/13/2015", "readmoresource": "KPCC"}]
