{"objects": [{"agworkervisas": "", "othervisaissues": "", "bioguideid": "B000711", "firstname": "Barbara", "district": "California", "source": "", "lastname": "Boxer", "imageurl": "/legacy/assethost/i/7fa2ec4d317dc35efad1109dcf87bd5f/54550-wide.jpg", "dreamact": "", "misc": "", "bordersecurity": "", "caption": "U.S. Senator Barbara Boxer - (D-California)", "family-basedvisas": "", "e-verify": "", "stemvisas": "", "party": "D", "position": "Sen.", "fullname": "Barbara Boxer", "citizenship": "Committed to passing comprehensive immigration reform that includes a path to citizenship and strengthens the economy."}, {"agworkervisas": "Negotiated the agreement between the United Farmworkers Union and growers that became the language on ag jobs in this bill.", "othervisaissues": "", "bioguideid": "F000062", "firstname": "Dianne", "district": "Sen", "source": "", "lastname": "Feinstein", "imageurl": "/legacy/assethost/i/09c690ebd714f0ea64794e7e60903a01/54558-wide.jpg", "dreamact": "Yes - spoke on Senate floor: http://www.youtube.com/user/SenatorFeinstein?v=eCQXyryGnFc&lr=1", "misc": "", "bordersecurity": "", "caption": "U.S. Senator Dianne Feinstein - (D-California)", "family-basedvisas": "The family immigration backlog will be cleared over the course of eight years. After eight years, the current numeric caps on the family preference categories would remain the same as in current law. Spouses and children of lawful permanent residents will be classified as “immediate relatives” to promote the efficient reunification of families. To address the fact that some countries face unreasonably long backlogs, the per country family immigration limits will be amended from 7 to 10 percent of total admissions.The proposal will also address several remaining technical issues that prevent widows and orphans of U.S. citizens from obtaining immigration benefits. It will eliminate discrimination in the immigration laws by permitting permanent partners of United States citizens and lawful permanent residents to obtain lawful permanent resident status.", "e-verify": "", "stemvisas": "Yes.", "party": "D", "position": "Sen.", "fullname": "Dianne Feinstein", "citizenship": "Yes, a pathway to earned citizenship that requires undocumented immigrants pay taxes and fines, pass background checks and learn English."}, {"agworkervisas": "Yes, but workers should have access to pathway to citizenship", "othervisaissues": "", "bioguideid": "B001270", "firstname": "Karen", "district": "Los Angeles", "source": "", "lastname": "Bass", "imageurl": "/legacy/assethost/i/3ee347387ef2978f9365d85bc1d86d1e/54579-wide.jpg", "dreamact": "", "misc": "", "bordersecurity": "", "caption": "Congresswoman Karen Bass - (D-LA)", "family-basedvisas": "Should include gay and lesbian partners", "e-verify": "We should provide tools for employers to ensure the people they hire are eligible to work in the U.S. while making sure there are appropriate penalties for companies that knowingly hire undocumented workers once a system is in place.", "stemvisas": "Yes, but Federal immigration policy should facilitate, not restrict the movement of highly skilled workers into the U.S. We should provide a sufficient number of highly-skilled immigrant visas to respond to the economic needs of the country. However we should not do this at the expense of the Diversity Visas Program, which is credited with providing an opportunity for immigrants from countries deemed to have low rates of immigration to the U.S., like those in Sub-Saharan Africa.", "party": "D", "position": "Rep.", "fullname": "Karen Bass", "citizenship": "Yes -- it is not practical to deport 11 million undocumented immigrants living within our borders."}, {"agworkervisas": "", "othervisaissues": "", "bioguideid": "B000287", "firstname": "Xavier", "district": "Los Angeles", "source": "", "lastname": "Becerra", "imageurl": "/legacy/assethost/i/79c79633804a925228f00fd1aa7136e2/54596-wide.jpg", "dreamact": "", "misc": "", "bordersecurity": "", "caption": "Congressman member Xavier Becerra - (D-LA)", "family-basedvisas": "", "e-verify": "", "stemvisas": "", "party": "D", "position": "Rep.", "fullname": "Xavier Becerra", "citizenship": "One of eight House members negotiating immigration bill that includes pathway to citizenship"}, {"agworkervisas": "", "othervisaissues": "", "bioguideid": "B001287", "firstname": "Ami", "district": "Sacramento", "source": "Sacramento Bee voter guide", "lastname": "Bera", "imageurl": "/legacy/assethost/i/f036f51e514ea2d99bdad1e58e09eb27/54548-wide.jpg", "dreamact": "", "misc": "", "bordersecurity": "", "caption": "Congressman Ami Bera - (D-Sacramento)", "family-basedvisas": "", "e-verify": "", "stemvisas": "", "party": "D", "position": "Rep.", "fullname": "Ami Bera", "citizenship": "We need comprehensive immigration reform. Secure the borders and create sensible immigration policy with laws that we will enforce. Our immigration laws should protect American jobs and Americans’ safety, but also reflect the needs of our economy.\n"}, {"agworkervisas": "Support discussions between farm workers and agricultural industry that would provide protections for workers and pathway to citizenship.", "othervisaissues": "", "bioguideid": "B001285", "firstname": "Julia", "district": "Ventura", "source": "", "lastname": "Brownley", "imageurl": "/legacy/assethost/i/3f38355a9c7dcee8ff2ba837190fe908/54578-wide.jpg", "dreamact": "", "misc": "", "bordersecurity": "Yes.", "caption": "Congresswoman Julia Brownley - (D-Ventura)", "family-basedvisas": "Should include gay and lesbian partners.", "e-verify": "Yes, but it has to be reliable and not overly burden businesses, or get in the way of those eligible to work.", "stemvisas": "Supportive of increasing. Need to find the right number so that businesses have access to the skilled workers they need without taking away jobs from Americans.", "party": "D", "position": "Rep.", "fullname": "Julia Brownley", "citizenship": "Yes."}, {"agworkervisas": "", "othervisaissues": "", "bioguideid": "C000059", "firstname": "Ken", "district": "Riverside", "source": "", "lastname": "Calvert", "imageurl": "/legacy/assethost/i/5c00f39554b87f7bd39f3cdf187fbc97/54581-wide.jpg", "dreamact": "", "misc": "Yes", "bordersecurity": "Yes", "caption": "Congressman Ken Calvert - (R-Riverside)", "family-basedvisas": "", "e-verify": "Yes, mandatory.", "stemvisas": "", "party": "R", "position": "Rep.", "fullname": "Ken Calvert", "citizenship": "Some kind of legal status, though not citizenship, for undocumented immigrants already in the country if they meet a number of conditions. These conditions must include that the individual has lived in the U.S. for a certain period of time, a background check to ensure only law abiding individuals are permitted to remain, payment of all back taxes and an appropriate fine, and passing a basic English proficiency exam."}, {"agworkervisas": "Open to something like that if it works and is enforced without too much excessive cost -- then it becomes a subsidy to ag industry", "othervisaissues": "", "bioguideid": "C001064", "firstname": "John", "district": "Irvine", "source": "", "lastname": "Campbell", "imageurl": "/legacy/assethost/i/80b1d143c32e43513fd0e0a28738be04/54577-wide.jpg", "dreamact": "There's a lot of distinction being drawn now between people who came here illegally and the children of those people and I think that's a distinction which is credible.", "misc": "", "bordersecurity": "", "caption": "Congressman John Campbell - (R-Irvine)", "family-basedvisas": "", "e-verify": "You obviously need something like that.", "stemvisas": "", "party": "R", "position": "Rep.", "fullname": "John Campbell", "citizenship": "Yes, but some we don't want here, others will have a path to legalization, and others a path to citizenship."}, {"agworkervisas": "Yes - supports comprehensive immigration reform that ensures a stable agriculture workforce, protects the rights of agriculture workers; and provides an earned path to citizenship.", "othervisaissues": "", "bioguideid": "C001036", "firstname": "Lois", "district": "Santa Barbara", "source": "", "lastname": "Capps", "imageurl": "/legacy/assethost/i/a92aee5fd6f204ce2cbd8869b3df5a54/54583-wide.jpg", "dreamact": "", "misc": "Yes", "bordersecurity": "Yes", "caption": "Congresswoman Lois Capps - (D-Santa Barbara)", "family-basedvisas": "She has co-sponsored standalone legislation to change current policy regarding gay and lesbian partners because our current policy is discriminatory and ineffective.", "e-verify": "Does not support mandatory e-verify in the absence of comprehensive immigration reform.", "stemvisas": "Congresswoman Capps’ district is home to world class research institutions like UCSB and Cal Poly that contribute significantly to our local economy and have spawned numerous high tech small businesses. She supports reforms to the current STEM visa program that help foster economic growth and innovation.", "party": "D", "position": "Rep.", "fullname": "Lois Capps", "citizenship": "Yes, an earned path to citizenship."}, {"agworkervisas": "I support the compromise agricultural deal negotiated between the Agricultural Industry and the UFW.  I support an expedited path to citizenship for current and future farmworkers that will provide a stable labor force for the industry, increased labor protections, and a reformed agricultural worker program that gives workers the flexibility to on a contract or at-will basis.", "othervisaissues": "", "bioguideid": "", "firstname": "Tony", "district": "North Hollywood, Sun Valley", "source": "", "lastname": "Cardenas", "imageurl": "/legacy/assethost/i/ad4fc5e07d392a3ed73d09a18c30d383/54600-wide.jpg", "dreamact": "", "misc": "", "bordersecurity": "We need a comprehensive solution to fix our broken immigration system.  I support the border security provisions in the Senate bill and will closely monitor any final comprehensive immigration bill to ensure it strikes the right balance and is not an enforcement only approach. ", "caption": "Congressman Tony Cardenas - (D-North Hollywood, Sun Valley)", "family-basedvisas": "Our immigration system is largely based on the concept of family unification, and bi-national same-sex families should also have the opportunity to petition to remain together in the U.S.", "e-verify": "We need a worker verification system that is practical for small business owners, does not encourage discrimination, and ensures compliance with the law. While E-Verify is not perfect, it is a part of the many options for fixing our broken immigration system. E-Verify must be implemented in stages so that employers and employees are educated on its use and do not use it as a discriminatory tool.  It must also include adequate due process protections for workers.", "stemvisas": "I support STEM visas as one of many paths to achieving legal status in the U.S. STEM visas offer highly skilled and often entrepreneurial individuals the opportunity to contribute to our diverse immigrant population. Ultimately, we need to be making the necessary investments in STEM education here at home, so our workforce can remain competitive.   \n", "party": "D", "position": "Rep.", "fullname": "Tony Cardenas", "citizenship": "I will only support comprehensive immigration reform that includes a path to citizenship for the 11 million undocumented in our country."}, {"agworkervisas": "", "othervisaissues": "The pie should be larger. We have visas that go unused and we should at least have a provision  to use up the quota that already exists.", "bioguideid": "C001080", "firstname": "Judy", "district": "El Monte", "source": "", "lastname": "Chu", "imageurl": "/legacy/assethost/i/fd1c480643e245f27da27f42b394eb1e/54576-wide.jpg", "dreamact": "Yes", "misc": "", "bordersecurity": "", "caption": "Congresswoman Judy Chu - (D-El Monte)", "family-basedvisas": "Must be reformed: We have a broken system where people are waiting over 20 years to bring their loved ones from the homeland. Families are what makes people strong.", "e-verify": "We need to have a system that actually works. And there are a lot of problems with E-verify.", "stemvisas": "We benefit greatly if we are able to have STEM visas which would allow those who are educated in America to stay here and keep their innovations here.", "party": "D", "position": "Rep.", "fullname": "Judy Chu", "citizenship": "Must have a roadmap to citizenship for the 11 million residents that are in the shadows."}, {"agworkervisas": "", "othervisaissues": "", "bioguideid": "C001094", "firstname": "Paul", "district": "Barstow", "source": "campaign website", "lastname": "Cook", "imageurl": "/legacy/assethost/i/c8728234b0f74399f7d839223a7db51c/54590-wide.jpg", "dreamact": "", "misc": "_", "bordersecurity": "_", "caption": "Congressman Paul Cook - (R-Barstow)", "family-basedvisas": "", "e-verify": "", "stemvisas": "", "party": "R", "position": "Rep.", "fullname": "Paul Cook", "citizenship": "Ours is a nation of laws. I am opposed to illegal immigration. The federal government has failed in its duty to secure our borders. I'll do what's necessary to make our borders secure."}, {"agworkervisas": "The H2-A program has become too bureaucratic and inefficient to meet the needs of agriculture in California and nationwide. This issue must be addressed in comprehensive immigration reform.\nIt is encouraging to see that labor and business have come together to find some common ground on this issue and we will continue to follow their talks.. ", "othervisaissues": "", "bioguideid": "C001059", "firstname": "Jim", "district": "Fresno", "source": "", "lastname": "Costa", "imageurl": "/legacy/assethost/i/51022a0fbd89bb9fa725993d01646f6d/54573-wide.jpg", "dreamact": "Yes", "misc": "", "bordersecurity": "", "caption": "Congressman Jim Costa  - (D-Fresno)", "family-basedvisas": "", "e-verify": "So long as it remains voluntary.", "stemvisas": "He believes in the principles behind the STEM Act, but he does not believe Congress should be playing favorites to one industry over another in the immigration debate.", "party": "D", "position": "Rep.", "fullname": "Jim Costa ", "citizenship": "Yes - he believes reform should be tough but fair and deal with the realities of our broken immigration system."}, {"agworkervisas": "", "othervisaissues": "", "bioguideid": "D000598", "firstname": "Susan", "district": "San Diego", "source": "", "lastname": "Davis", "imageurl": "/legacy/assethost/i/1dbdab2378e28ab9926d1f8f32b64206/54594-wide.jpg", "dreamact": "Yes, the toll our current immigration policies have taken on families, especially the children who were brought here through no fault of their\nown, has been troubling.", "misc": "", "bordersecurity": "Yes", "caption": "Calif. Congressional member Susan Davis - (D-San Diego)", "family-basedvisas": "Acceptance of immigration status should not be based on whom you\nlove. I’ve heard from so many of my constituents who are distraught at losing someone they have been committed to for years because our immigration system views them differently than married heterosexual couples.", "e-verify": "", "stemvisas": "I am eager to support a plan that provides the companies in our San Diego innovation economy with the skilled workers they need to grow and thrive.", "party": "D", "position": "Rep", "fullname": "Susan Davis", "citizenship": "yes - Complete immigration reform should provide for\nborder security and a fair path for the vast majority who are already here\nand who have demonstrated their productivity and conducted themselves with\ntrouble free records.\""}, {"agworkervisas": "Yes", "othervisaissues": "", "bioguideid": "D000612", "firstname": "Jeff", "district": "Fresno", "source": "", "lastname": "Denham", "imageurl": "/legacy/assethost/i/51bf14333cc5d689a95fc348c1aa29f0/54571-wide.jpg", "dreamact": "", "misc": "", "bordersecurity": "Something that strenghtens and protects our borders.", "caption": "Congressman Jeff Denham - (R-Fresno)", "family-basedvisas": "", "e-verify": "Yes", "stemvisas": "", "party": "R", "position": "Rep.", "fullname": "Jeff Denham", "citizenship": "Yes, but we have to have a system that follows the rule of law...a way to show your oath to citizenship as well as being able to speak English.\"="}, {"agworkervisas": "Yes", "othervisaissues": "", "bioguideid": "E000215", "firstname": "Anna", "district": "Palo Alto", "source": "", "lastname": "Eshoo", "imageurl": "/legacy/assethost/i/705804ea1579455f3a999ddac15874cd/54549-wide.jpg", "dreamact": "", "misc": "Yes", "bordersecurity": "Yes", "caption": "Congresswoman Anna Eshoo - (D-Palo Alto)", "family-basedvisas": "Rep. Eshoo believes all people deserve equality in their personal and professional lives regardless of sexual orientation or gender identity/expression. ", "e-verify": "Need to crack down on employers who hire undocumented workers, but E-Verify needs improvement to increase accuracy and ease of use.", "stemvisas": "Yes - co-sponsor of the IDEA Act, new visa category for STEM grads of accredited American universities, and create new entrepreneur visa for foreign-born entrepreneurs who create jobs.", "party": "D", "position": "Rep.", "fullname": "Anna Eshoo", "citizenship": "Rep. Eshoo favors comprehensive reform legislation that will increase border security, reunite families, establish employment verification systems, and create a viable guest worker program. She also supports a pathway to citizenship that includes paying fees and back taxes, a clean criminal record, passing a background check, and a lengthy stay in the U.S.\n\n"}, {"agworkervisas": "Yes", "othervisaissues": "", "bioguideid": "F000030", "firstname": "Sam", "district": "Santa Cruz", "source": "", "lastname": "Farr", "imageurl": "/legacy/assethost/i/9ffdfd15b288cf4ce76a9ab266ae6683/54592-wide.jpg", "dreamact": "", "misc": "", "bordersecurity": "", "caption": "Congressman Sam Farr - (D-Santa Cruz)", "family-basedvisas": "Family reunification should include all families, regardless of sexual orientation.\n", "e-verify": "Moving forward, there should be appropriate fines/punishment for those who are here illegally and the employers who hire them. He supports the concept of E-verify but not the current implementation, so he would either be looking at an improved E-verify or a drastically new system.", "stemvisas": "", "party": "D", "position": "Rep.", "fullname": "Sam Farr", "citizenship": "Yes - pathway to citizenship as all immigrants before them have had, provided they go to the back of the line and pay any reasonable fines."}, {"agworkervisas": "Yes, provided that program includes adequate protections for workers.", "othervisaissues": "", "bioguideid": "G000559", "firstname": "John", "district": "Walnut Creek", "source": "", "lastname": "Garamendi", "imageurl": "/legacy/assethost/i/83d2b8caefccf37645d342eb924074a8/54574-wide.jpg", "dreamact": "", "misc": "Yes", "bordersecurity": "Yes", "caption": "Congressman John Garamendi - (D-Walnut Creek)", "family-basedvisas": "Believes gay and lesbian immigrants should be treated equally under the law.", "e-verify": "Doesn't like E-verify; we should expect employers to verify the legal working status of an immigrant, especially once all immigrants are registered and regularized as part of a comprehensive plan, but the current system is often too expensive for small businesses and needs to be made more efficient.", "stemvisas": "Yes", "party": "D", "position": "Rep.", "fullname": "John Garamendi", "citizenship": "Yes, for immigrants already in the country who work hard and play by the rules. He believes it’s appropriate to ask undocumented immigrants who have not done so to pay back taxes and a fine. The Congressman believes we should deport undocumented immigrants who are a threat to America."}, {"agworkervisas": "", "othervisaissues": "", "bioguideid": "H001063", "firstname": "Janice", "district": "San Pedro", "source": "campaign web site", "lastname": "Hahn", "imageurl": "/legacy/assethost/i/63daecf2103870bb4a3b65ab9c00d4e7/54601-lead.jpg", "dreamact": "Yes", "misc": "", "bordersecurity": "", "caption": "Congressman Janice Hahn - (D-San Pedro)", "family-basedvisas": "", "e-verify": "", "stemvisas": "", "party": "D", "position": "Rep.", "fullname": "Janice Hahn", "citizenship": "The millions of undocumented workers who live in our country, work hard and contribute to our communities deserve a chance to come out of the shadows. "}, {"agworkervisas": "", "othervisaissues": "", "bioguideid": "H001034", "firstname": "Mike", "district": "San Jose", "source": "", "lastname": "Honda", "imageurl": "/legacy/assethost/i/a0c48f716f843ebe6aecf5f34f0aa327/54587-wide.jpg", "dreamact": "", "misc": "Immigration Taskforce chairman of the Congressional Asian and Pacific American Caucus \n\n", "bordersecurity": "", "caption": "Congressman Mike Honda - (D-San Jose)", "family-basedvisas": "Introduced a bill that would grant same-sex couples the same opportunities as others to sponsor a foreign-born spouse for a visa.", "e-verify": "", "stemvisas": "The tech industry is on the verge of a debilitating workforce shortage. By prioritizing a visa category for persons with advanced degrees in science, technology, engineering, and mathematics (STEM), comprehensive immigration reform will strengthen our nation’s economy, and we will avoid serious peril to our global economic competitiveness. Immigration reform that allows high-skilled workers to join our workforce will advance our country’s technological innovation, entrepreneurship, and economic prosperity.\n\n", "party": "D", "position": "Rep.", "fullname": "Mike Honda", "citizenship": "Yes"}, {"agworkervisas": "I support increasing the number of H-2A visas available—Northern California farmers need more workers, leaving crops unpicked and farmland unworked. The Senate bill makes progress toward reducing labor shortages.\n", "othervisaissues": "There are currently over 4.55 million people in the family immigration backlog waiting unconscionable periods of time to reunite with their family members. Our families deserve a comprehensive fix to our broken immigration system that tackles bureaucratic delays, inefficiencies, and outdated policy that keep loved ones apart.\n\n", "bioguideid": "H001068", "firstname": "Jared", "district": "San Rafael", "source": "op/ed in The Hill http://thehill.com/blogs/congress-blog/homeland-security/279691-a-welcome-step-in-reforming-our-immigration-system", "lastname": "Huffman", "imageurl": "/legacy/assethost/i/cdd375f352c67bfb6c75c2574c577588/54569-wide.jpg", "dreamact": "", "misc": "", "bordersecurity": "We’ve already spent a huge amount on border security and spending even more is unnecessary and seems entirely calculated to appease right-wing constituencies, rather than reflecting the real border security enforcement situation.\n", "caption": "Congressman Jared Huffman - (D-San Rafael)", "family-basedvisas": "", "e-verify": "  I am open to E-Verify as part of a comprehensive package.\n", "stemvisas": "While we must ensure that companies hire qualified Americans before recruiting foreign workers, we should do a better job of attracting and keeping the world’s best and brightest. Increasing the number of STEM visas available is an important step. \n", "party": "D", "position": "Rep.", "fullname": "Jared Huffman", "citizenship": "While the bill isn’t perfect, I am glad to see bi-partisan progress towards fixing our broken immigration system. I support the general framework and new probationary legal status created by the Senate bill, but I believe the waiting period for citizenship is too long. \n"}, {"agworkervisas": "", "othervisaissues": "", "bioguideid": "H001048", "firstname": "Duncan", "district": "El Cajon", "source": "", "lastname": "Hunter", "imageurl": "/legacy/assethost/i/4f84a47b400c3cb0751132557b3d0a9c/54560-wide.jpg", "dreamact": "", "misc": "", "bordersecurity": "Border security will need to be first and foremost, with some metric verifying that the border is secure.", "caption": "Congressman Duncan Hunter - (R-El Cajon)", "family-basedvisas": "", "e-verify": "", "stemvisas": "", "party": "R", "position": "Rep.", "fullname": "Duncan Hunter", "citizenship": "No - amnesty is not an option. There is possibly room for a process that leans on the legal immigration system, but blanket amnesty--no way."}, {"agworkervisas": "", "othervisaissues": "", "bioguideid": "I000056", "firstname": "Darrell", "district": "Vista", "source": "", "lastname": "Issa", "imageurl": "/legacy/assethost/i/6b3c6712bbbb095febdf8c2daa21a3d9/54557-wide.jpg", "dreamact": "", "misc": "", "bordersecurity": "", "caption": "Congressman Darrell Issa - (R-Vista)", "family-basedvisas": "", "e-verify": "At least mandatory E-verify with strong penalties. Supports work site enforcement to prevent benefits like Medicare, Medicaid, Social Security, welfare, aid to families with dependent children", "stemvisas": "", "party": "R", "position": "Rep.", "fullname": "Darrell Issa", "citizenship": "Yes, but - the 11 million here fall into 3 categories: people who should be allowed to stay and if they choose to at some point become a citizen; people who should be ordered out as a criminal or undesirable; guestworkers given a permit to remain here, to work, in some cases with family, and in many cases without the ability to have additional non-working dependents. The question is how many in each."}, {"agworkervisas": "Yes", "othervisaissues": "Service industry needs workers.", "bioguideid": "L000578", "firstname": "Doug", "district": "Redding", "source": "", "lastname": "LaMalfa", "imageurl": "/legacy/assethost/i/3f97d3eb5edda9855920f9d41910fb28/54561-wide.jpg", "dreamact": "Hears from constituents whose own kids don't get similar benefits.", "misc": "", "bordersecurity": "We are a sovereign nation, we have that right. It's not a wall, it's a gate that we have the right to open and close as the country sees fit with the amount of people you want to come over. Need secure borders for credibility, have to establish control of our borders as the first step, or else it looks like 1986, where we had an amnesty and nobody trusted anybody out there on the issue.", "caption": "Congressman Doug LaMalfa - (R-Redding)", "family-basedvisas": "", "e-verify": "", "stemvisas": "", "party": "R", "position": "Rep.", "fullname": "Doug LaMalfa", "citizenship": "I think you need to talk to the public about that because they're the ones paying the bills. The first thing you have to establish is who are the people who shouldn't have any business here at all. You've got criminals here, you've got other undesirables that are cast off by their nation that we've become a dumping ground for perhaps."}, {"agworkervisas": "", "othervisaissues": "", "bioguideid": "L000551", "firstname": "Barbara", "district": "Oakland", "source": "", "lastname": "Lee", "imageurl": "/legacy/assethost/i/6ec1cc8b4e6bcbca5b4d075b595d1d3d/54551-wide.jpg", "dreamact": "", "misc": "", "bordersecurity": "As a country we spend more money on immigration enforcement than on the FBI, Secret Service, Drug Enforcement Administration, U.S. Marshal Service, Bureau of Alcohol, Tobacco, Firearms and Explosives combined. Enforcement is at an all-time high and increasing it would be a waste of taxpayer dollars.", "caption": "Congreswoman Barbara Lee - (D-Oakland)", "family-basedvisas": "Including gay and lesbian partners, absolutely.", "e-verify": "E-Verify is a flawed system that would essentially allow employers to act as immigration agents by requiring them to determine an individual's legal status. E-Verify allows employers to exploit workers by paying them under the table and getting around other workplace protections.", "stemvisas": "Yes", "party": "D", "position": "Rep.", "fullname": "Barbara Lee", "citizenship": "Yes"}, {"agworkervisas": "", "othervisaissues": "", "bioguideid": "L000397", "firstname": "Zoe", "district": "San Jose", "source": "", "lastname": "Lofgren", "imageurl": "/legacy/assethost/i/7f5dc9362f2f29325ce012439d36fef8/54597-wide.jpg", "dreamact": "", "misc": "", "bordersecurity": "", "caption": "Congresswoman Zoe Lofgren - (D-San Jose)", "family-basedvisas": "", "e-verify": "Expanding E-Verify—even as part of a broader immigration reform effort—without ensuring that proper safeguards are in place, is just one more way in which E-Verify would not benefit American workers.", "stemvisas": "", "party": "D", "position": "Rep.", "fullname": "Zoe Lofgren", "citizenship": "One of 8 House members negotiating immigration bill that includes a pathway to citizenship."}, {"agworkervisas": "", "othervisaissues": "", "bioguideid": "L000579", "firstname": "Alan", "district": "Long Beach", "source": "", "lastname": "Lowenthal", "imageurl": "/legacy/assethost/i/7acbfa2dd4d5410522d0aecfaef99f74/54547-wide.jpg", "dreamact": "", "misc": "", "bordersecurity": "", "caption": "Calif. Congressional member Alan Lowenthal - (D-Long Beach)", "family-basedvisas": "\n\"I have cosponsored two important immigration bills that provide important protections.\n\nThe first, known as the Reuniting Families Act, offers practical solutions for reducing family immigration visa backlogs and promoting humane and timely reunification of immigrant families.\n\n   The second, known as the Uniting American Families Act, would allow gay and lesbian Americans to sponsor their permanent partners for legal residency in the United States – a right currently enjoyed only by married heterosexuals under immigration law.\n\n   However, what we really need is a comprehensive and bipartisan plan for reform that transforms our immigration system into one that is good for America’s economy and even better for its social and political progress.” \n\n", "e-verify": "holding employers accountable to the worker verification process", "stemvisas": "yes", "party": "D", "position": "Rep", "fullname": "Alan Lowenthal", "citizenship": "“As the grandson of immigrants, I empathize with those who are stuck in a system that does not function properly – often denying hardworking people a clearly defined, legal path to citizenship while at times separating families for years at a time. Supports streamlining a clearly defined path to citizenship for those undocumented individuals who pass a background check, pay taxes, and work hard for a better life.\n \n\n   There is no denying that the estimated 11 million undocumented immigrants in the U.S. are for the most part woven deeply into the fabric of our nation. We cannot unravel that fabric simply because we don’t like the color of the threads.\n\nSupports streamlining a clearly defined path to citizenship for those undocumented individuals who pass a background check, pay taxes, and work hard for a better life.\n\n"}, {"agworkervisas": "", "othervisaissues": "", "bioguideid": "M001163", "firstname": "Doris", "district": "Sacramento", "source": "Sac Bee voter guide", "lastname": "Matsui", "imageurl": "/legacy/assethost/i/433d358ae89143098335236a5d51c989/54559-wide.jpg", "dreamact": "Yes", "misc": "", "bordersecurity": "", "caption": "Congresswoman Doris Matsui - (D-Sacramento)", "family-basedvisas": "", "e-verify": "", "stemvisas": "", "party": "D", "position": "Rep.", "fullname": "Doris Matsui", "citizenship": "Immigrants contribute to our nation’s culture, tradition, and economy, but it is clear that our current immigration system is broken. We need responsible and comprehensive reform that includes a pathway to citizenship."}, {"agworkervisas": "", "othervisaissues": "", "bioguideid": "M001165", "firstname": "Kevin", "district": "Bakersfield", "source": "", "lastname": "McCarthy", "imageurl": "/legacy/assethost/i/20e1ab60def160170f33b9de69deacc4/54580-wide.jpg", "dreamact": "", "misc": "On immigration, McCarthy has said he sees several areas where lawmakers can come to an agreement, including visas for high-skilled labor, how to deal with undocumented children who came to the country at a young age, and a pathway to a legal status.\n\n", "bordersecurity": "", "caption": "Congressman Kevin McCarthy - (R-Bakersfield)", "family-basedvisas": "", "e-verify": "", "stemvisas": "", "party": "R", "position": "Rep.", "fullname": "Kevin McCarthy", "citizenship": "No response."}, {"agworkervisas": "", "othervisaissues": "", "bioguideid": "M001177", "firstname": "Tom", "district": "Granite Bay", "source": "statement to the Diocese of Sacramento", "lastname": "McClintock", "imageurl": "/legacy/assethost/i/ad4fc5e07d392a3ed73d09a18c30d383/54595-wide.jpg", "dreamact": "", "misc": "", "bordersecurity": "Comprehensive immigration reform\" means the same as it meant in 1986, the last time Congress took up the issue. The agreement was that we were going to secure our borders, make it illegal to hire anyone who illegally enters the country, and in exchange, we would legalize the 3 million illegals who were in the country. But we never secured the borders, we never enforced the sanctions against employers, and we now have between 11 and 20 million illegal aliens in the country as a result. (Facebook post by McClintock.)", "caption": "Congressman Tom McClintock - (R-Granite Bay)", "family-basedvisas": "", "e-verify": "", "stemvisas": "", "party": "R", "position": "Rep.", "fullname": "Tom McClintock", "citizenship": "If we allow illegal immigration, then legal immigration becomes pointless and the process of assimilation that it promotes and assures breaks down. We should remember that millions of legal immigrants have taken that path to citizenship, have respected America’s sovereignty, have obeyed our laws, have done everything our country has asked of them, and have waited patiently in line to do so.  It is not fair to allow millions of illegal immigrants to cut in line in front of them. To those illegal immigrants seeking citizenship out of a sincere desire to become Americans, I welcome them and invite them to begin the process of legal immigration that has been followed by many millions of legal immigrants to America over the centuries. "}, {"agworkervisas": "Yes, would be open to other unskilled labor visas.", "othervisaissues": "", "bioguideid": "M000508", "firstname": "Buck", "district": "Santa Clarita", "source": "", "lastname": "McKeon", "imageurl": "/legacy/assethost/i/1b969c4595e7d92bc17d2917f5da5002/54553-wide.jpg", "dreamact": "", "misc": "", "bordersecurity": "", "caption": "Congressman Buck McKeon - (R-Santa Clarita)", "family-basedvisas": "", "e-verify": "", "stemvisas": "yes", "party": "R", "position": "Rep.", "fullname": "Buck McKeon", "citizenship": "Supports legalization, but no pathway to citizenship."}, {"agworkervisas": "", "othervisaissues": "", "bioguideid": "M001166", "firstname": "Jerry", "district": "Pleasanton", "source": "campaign website", "lastname": "McNerney", "imageurl": "/legacy/assethost/i/37c1571ef63af4f07e46f428183e793a/54572-wide.jpg", "dreamact": "Yes", "misc": "", "bordersecurity": "Every country has a responsibility to secure its borders and we need a common sense approach to immigration policy that begins at our borders.  I support increased funding for our border patrol and investment in surveillance and enforcement technology. ", "caption": "Congressman Jerry McNerney - (D-Pleasanton)", "family-basedvisas": "", "e-verify": "", "stemvisas": "", "party": "D", "position": "Rep.", "fullname": "Jerry McNerney", "citizenship": ""}, {"agworkervisas": "", "othervisaissues": "", "bioguideid": "M000725", "firstname": "Gary", "district": "San Bernardino", "source": "PE article and vote record", "lastname": "Miller", "imageurl": "/legacy/assethost/i/92c89ba851c76470e5b17a5ede957707/54565-wide.jpg", "dreamact": "Voted no in 2010.", "misc": "", "bordersecurity": "Yes", "caption": "Congressman Gary Miller - (R-San Bernardino)", "family-basedvisas": "", "e-verify": "", "stemvisas": "Yes", "party": "R", "position": "Rep.", "fullname": "Gary Miller", "citizenship": "Miller’sdistrict director says the Congessman is in the “information-gathering stage” on the various immigration-reform proposals. His press deputy says Miller \"has been actively meeting with his constituents, local law enforcement, and other stakeholders to get their input on how to fix our nation’s broken system, and implement a system that is effective, fair, enhances public safety, and supports economic growth.\""}, {"agworkervisas": "", "othervisaissues": "", "bioguideid": "M001139", "firstname": "George", "district": "Martinez", "source": "his website", "lastname": "Miller", "imageurl": "/legacy/assethost/i/48a9fa3715783119eb0093ea3d01005f/54564-wide.jpg", "dreamact": "", "misc": "", "bordersecurity": "While the vast majority of individuals seeking entry into the United States are hard-working men and women who want to make a better life for their families, there are some who would come here to engage in drug trafficking, gang activities, human smuggling, and other violent crimes that put our communities at risk. As such, Congressman Miller believes that immigration reform legislation must make securing our northern and southern borders and coastlines a top priority.", "caption": "Congressman George Miller - (D-Martinez)", "family-basedvisas": "", "e-verify": "Congressman Miller also continues to believe that American jobs should be filled by American workers whenever possible. In order to cut down on unscrupulous employers who are denying job opportunities to out-of-work Americans while exploiting individuals who are unauthorized to work in the U.S. with substandard wages, he believes that reform legislation must include a mandatory, effective, and workable employment verification system.", "stemvisas": "", "party": "D", "position": "Rep.", "fullname": "George Miller", "citizenship": "For a comprehensive proposal to be successful, it must strengthen our borders, crack down on companies that hire undocumented workers or abuse guest worker programs, provide a fair and honest path to citizenship for millions of immigrants, and streamline our legal immigration system to attract the best minds to America, rather than ceding their skills to other countries. "}, {"agworkervisas": "Yes", "othervisaissues": "", "bioguideid": "N000179", "firstname": "Grace", "district": "Santa Fe Springs", "source": "", "lastname": "Napolitano", "imageurl": "/legacy/assethost/i/e6bbc603a2be2d1222733a737c881cd1/54566-wide.jpg", "dreamact": "Yes", "misc": "", "bordersecurity": "Yes", "caption": "Congresswoman Grace Napolitano - (D-Santa Fe Springs)", "family-basedvisas": "", "e-verify": "Supports an E-Verify system that is mandatory and operational", "stemvisas": "Yes", "party": "D", "position": "Rep.", "fullname": "Grace Napolitano", "citizenship": "Supports an earned path to citizenship"}, {"agworkervisas": "In support, provided that workers weren't being taken advantage of.", "othervisaissues": "", "bioguideid": "N000187", "firstname": "Gloria", "district": "Ontario", "source": "", "lastname": "Negrete McLeod", "imageurl": "/legacy/assethost/i/f13f8929d3dc0d3748a10e7bd10f51f8/54570-wide.jpg", "dreamact": "Yes, I think those kids that came through no volition of their own, came here with their parents and they've gone through the schools here, they've pledged allegiance every day, this is the only country they know, this is their country, so I think giving them a path to some kind of citizenship is terrific.", "misc": "", "bordersecurity": "I want to make sure that we're not only safeguarding the southern borders, but that we're also safeguarding the northern borders. I know when most people think about immigration, they think of brown skinned people like me, not white skinned people.", "caption": "Congresswoman Gloria Negrete McLeod - (D-Ontario)", "family-basedvisas": "", "e-verify": "Issue is: how far do you want an employer to verify?", "stemvisas": "You probably need it in some professions.", "party": "D", "position": "Rep.", "fullname": "Gloria Negrete McLeod", "citizenship": "I don't know if I can support something short of citizenship. But I guess there's people here who have green cards who don't vote."}, {"agworkervisas": "Yes", "othervisaissues": "", "bioguideid": "N000181", "firstname": "Devin", "district": "Tulare", "source": "", "lastname": "Nunes", "imageurl": "/legacy/assethost/i/dd82511197830db3a2fc3b2a1f3f163d/54556-wide.jpg", "dreamact": "", "misc": "Yes", "bordersecurity": "Yes", "caption": "Congressman Devin Nunes - (R-Tulare)", "family-basedvisas": "", "e-verify": "Yes", "stemvisas": "Yes", "party": "R", "position": "Rep.", "fullname": "Devin Nunes", "citizenship": "I think most Americans will say, as long as the people that didn't commit a crime pass a background check, go through this process, and that the borders are secure--I don't think people in the United States will have a problem with dealing with it fairly."}, {"agworkervisas": "Agrees with Congressional Hispanic Caucus that these workers should have a path to citizenship.", "othervisaissues": "", "bioguideid": "P000197", "firstname": "Nancy", "district": "San Francisco", "source": "", "lastname": "Pelosi", "imageurl": "/legacy/assethost/i/09eab22bfc443734cea048d31e320534/54589-wide.jpg", "dreamact": "The DREAM Act is the right thing to do—both economically and morally for our country, and it is for young people who mostly know no other home.", "misc": "", "bordersecurity": "We just want to make sure that all of those who have joined with us are not setting a standard of securing the border that is almost impossible to achieve.", "caption": "Congresswoman Nancy Pelosi - (D-San Francisco)", "family-basedvisas": "Yes, including gay partners", "e-verify": "Supports a workable employment verification system that prevents unlawful employment and rewards employers and employees who play by the rules, while protecting Americans’ right to work and their privacy.", "stemvisas": "yes", "party": "D", "position": "Rep.", "fullname": "Nancy Pelosi", "citizenship": "Yes. I don't think we want America to be a place where we have two kinds of people in our country. We always make comments of other countries that have workers come in and they are in a different category, no matter how long they have lived in the country, no matter how much they contribute to the economic success of that country."}, {"agworkervisas": "", "othervisaissues": "", "bioguideid": "P000608", "firstname": "Scott", "district": "San Diego", "source": "", "lastname": "Peters", "imageurl": "/legacy/assethost/i/cc3e7912c8001697f14fe2971bb33d33/54593-wide.jpg", "dreamact": "", "misc": "", "bordersecurity": "", "caption": "Congressman Scott Peters - (D-San Diego)", "family-basedvisas": "", "e-verify": "If we get the laws right, I think worker verification makes sense. Right now, forcing employers to be cops doesn't make sense. I would be okay with something like E-verify once the laws are in place that make sense.", "stemvisas": "We are facing a deficit of those folks in our technology sector. We want to make sure that's taken care of.", "party": "D", "position": "Rep.", "fullname": "Scott Peters", "citizenship": "We want to make sure that we have a rational way to deal with the 11 million people who are undocumented here. I don't think now is the time to draw really hard lines. Now is the time to listen about how to make this better."}, {"agworkervisas": "Yes, if coupled with a study to see whether prisoners could do the job.", "othervisaissues": "Not for other low-wage jobs, like waiting tables.", "bioguideid": "R000409", "firstname": "Dana", "district": "Huntington Beach", "source": "", "lastname": "Rohrabacher", "imageurl": "/legacy/assethost/i/eeadd3e3c3820e30e91e3d1e1aac5721/54555-wide.jpg", "dreamact": "", "misc": "", "bordersecurity": "", "caption": "Congressman Dana Rohrabacher - (R-Huntington Beach)", "family-basedvisas": "", "e-verify": "Yes", "stemvisas": "Would look at this seriously.", "party": "R", "position": "Rep.", "fullname": "Dana Rohrabacher", "citizenship": "No. I cannot accept any legislation that includes normalizing the status, legalizing the status of people who are here illegally. That would do nothing but bring more millions of people here to the United States in order to have their status normalized and put their families into a position to get benefits and take jobs."}, {"agworkervisas": "Yes.", "othervisaissues": "", "bioguideid": "R000486", "firstname": "Lucille", "district": "Commerce", "source": "", "lastname": "Roybal-Allard", "imageurl": "/legacy/assethost/i/969609eead9f023e847cd75e1a2323b1/54584-wide.jpg", "dreamact": "Yes", "misc": "", "bordersecurity": "", "caption": "Congresswoman Lucille Roybal-Allard - (D-Commerce)", "family-basedvisas": "Should include gay and lesbian partners.", "e-verify": "Yes. She recognizes E-Verify expansion will inevitably be part of the compromise, strong worker protections are needed.", "stemvisas": "Yes", "party": "D", "position": "Rep.", "fullname": "Lucille Roybal-Allard", "citizenship": "Yes"}, {"agworkervisas": "", "othervisaissues": "", "bioguideid": "R000487", "firstname": "Ed", "district": "Fullerton", "source": "website", "lastname": "Royce", "imageurl": "/legacy/assethost/i/2f7299ab8d67e37805f0f0c498bf2a2b/54562-wide.jpg", "dreamact": "", "misc": "", "bordersecurity": "As Chairman of the Subcommittee on Terrorism, Nonproliferation and Trade, I believe that when it comes to immigration policy, national security should be our main priority. This is why I am focused on a sound border enforcement plan. I’ve introduced the Keeping the Pledge on Immigration Act, legislation that incorporates the immigration agenda included in House Republicans’ \"A Pledge to America.\" This legislation, a plan to secure our borders, consists of three components: 1) establish operational control of the border; 2) work with state and local officials to enforce our immigration laws; and 3) strengthen visa security.\n\n", "caption": "Congressman Ed Royce - (R-Fullerton)", "family-basedvisas": "", "e-verify": "yes", "stemvisas": "Yes", "party": "R", "position": "Rep.", "fullname": "Ed Royce", "citizenship": "Over the last several years, with the support of the American public, Congress has consistently defeated amnesty proposals for illegal aliens. "}, {"agworkervisas": "Need to a foster a labor pool vital to our Coachella Valley tourism and agricultural economy.", "othervisaissues": "", "bioguideid": "R000599", "firstname": "Raul", "district": "Palm Springs", "source": "interview with local TV station: http://www.kmir6.com/multimedia/videos/?bctid=2127807336001", "lastname": "Ruiz", "imageurl": "/legacy/assethost/i/8d5a715e2ed4307717ef65e1aad82681/54591-wide.jpg", "dreamact": "", "misc": "", "bordersecurity": "Over the past 4 years, we’ve made a tremendous improvement of border security, but can always do better, particularly in technology and supporting border patrol.", "caption": "Congressman member Raul Ruiz - (D-Palm Springs)", "family-basedvisas": "", "e-verify": "", "stemvisas": "", "party": "D", "position": "Rep.", "fullname": "Raul Ruiz", "citizenship": "Supports a pathway to citizenship."}, {"agworkervisas": "Only as part of a broader, comprehensive immigration reform package.", "othervisaissues": "", "bioguideid": "S000030", "firstname": "Linda", "district": "Lakewood", "source": "", "lastname": "Sanchez", "imageurl": "/legacy/assethost/i/324788c23fc4158a6d2b31b3ffc7a2c0/57741-wide.jpg", "dreamact": "", "misc": "", "bordersecurity": "Only as part of a broader, comprehensive immigration reform package.", "caption": "Congresswoman Linda Sanchez - (D-Lakewood)", "family-basedvisas": "Would support including gay and lesbian couples in family reunification.", "e-verify": "Would support improved E-verify only as part of a broader, comprehensive immigration reform package.", "stemvisas": "Only as part of a broader, comprehensive immigration reform package.", "party": "D", "position": "Rep.", "fullname": "Linda Sanchez", "citizenship": "Supports an earned path to citizenship."}, {"agworkervisas": "", "othervisaissues": "", "bioguideid": "S000030", "firstname": "Loretta", "district": "Anaheim", "source": "", "lastname": "Sanchez", "imageurl": "/legacy/assethost/i/8d703128994c52a11c6dfbedd84e8896/54582-wide.jpg", "dreamact": "", "misc": "", "bordersecurity": "I do have some concerns about the [Senate] Gang of 8’s proposal, in particular the border security trigger portion.  Many House Republicans are using the same old excuses, such as, ‘We need to secure our borders first,’ to prevent a comprehensive immigration overhaul bill from moving forward. We have made significant strides in securing our border and combating illegal immigration. We’ve done our part and now it’s time for House Republicans to come to the table and join us to truly address the immigration challenge.\n\n \n", "caption": "Congresswoman Loretta Sanchez - (D-Anaheim)", "family-basedvisas": "", "e-verify": "", "stemvisas": "", "party": "D", "position": "Rep.", "fullname": "Loretta Sanchez", "citizenship": "Yes, it’s high time to create a fair and viable path to legal status for the millions of undocumented immigrants in our country.\n\n"}, {"agworkervisas": "Still a strong need for them.", "othervisaissues": "Track tourist visas so people can't overstay their visas - it's at least 40% of our immigration problem.", "bioguideid": "S001150", "firstname": "Adam", "district": "Glendale", "source": "", "lastname": "Schiff", "imageurl": "/legacy/assethost/i/5fe587ea8a39086d95d134d5425a1aa4/54546-wide.jpg", "dreamact": "Yes", "misc": "", "bordersecurity": "Yes", "caption": "Congressman Adam Schiff - (D-Glendale)", "family-basedvisas": "Yes, and there should be provisions in it for same-sex couples so that they can also make sure their loved ones can emigrate.", "e-verify": "I do think we need to disincentivize people from coming here illegally for jobs. E-verify is a method for doing that. Undoubtedly there can be ways to improve E-verify or maybe come up with a better system. There needs to be some mechanism, though, where we can determine who's legally eligible for employment and who isn't. And we can do so in a way that doesn't require employers to try to stereotype people.", "stemvisas": "", "party": "D", "position": "Rep.", "fullname": "Adam Schiff", "citizenship": "There has to be some pathway to citizenship. I agree with the President that they should pay back taxes and learn civics and get in line behind those that are llegally trying to immigrate."}, {"agworkervisas": "", "othervisaissues": "", "bioguideid": "S000344", "firstname": "Brad", "district": "Sherman Oaks", "source": "", "lastname": "Sherman", "imageurl": "/legacy/assethost/i/d7eef28b6b29158970229989cc158bb7/54552-wide.jpg", "dreamact": "", "misc": "", "bordersecurity": "", "caption": "Congressman Brad Sherman - (D-Sherman Oaks)", "family-basedvisas": "", "e-verify": "", "stemvisas": "", "party": "D", "position": "Rep.", "fullname": "Brad Sherman", "citizenship": "We need a regular process by which the 11 million undocumented people can be fully part of our society, and they need documents. It’s important for the labor market of this country because as long as there are people without documents, they can’t stand up for their rights as workers. And that means there are people who can be used by unscrupulous employers to keep down wages and to prevent unions from organizing.\n\n"}, {"agworkervisas": "", "othervisaissues": "", "bioguideid": "S001175", "firstname": "Jackie", "district": "San Mateo", "source": "website", "lastname": "Speier", "imageurl": "/legacy/assethost/i/bc6447ff81435b8fc1244047823f3e1c/54568-wide.jpg", "dreamact": "", "misc": "", "bordersecurity": "The path forward must ensure that our northern and southern borders are safe and secure from foreign threats, especially drug trafficking and terrorism.  ", "caption": "Congressman Jackie Speier - (D-San Mateo)", "family-basedvisas": "Allow families to reunite by alleviating long backlogs and recognizing same sex partnerships.", "e-verify": "", "stemvisas": "Yes. This plan must establish legal opportunities for workers pivotal to our job market.", "party": "D", "position": "Rep.", "fullname": "Jackie Speier", "citizenship": "A comprehensive policy must create a tough but fair pathway to legal status for the millions of hardworking immigrants who are already here contributing to our communities, including foreign students who want to innovate here."}, {"agworkervisas": "", "othervisaissues": "", "bioguideid": "S001193", "firstname": "Eric", "district": "Livermore", "source": "", "lastname": "Swalwell", "imageurl": "/legacy/assethost/i/eca5205ab6efd8e7d1a475e7e33d8171/54563-wide.jpg", "dreamact": "", "misc": "", "bordersecurity": "Must include improvements to secure our borders and remove from this country undocumented immigrants who have committed serious crimes after they serve their sentences.", "caption": "Congressman Eric Swalwell - (D-Livermore)", "family-basedvisas": "Must include gay and lesbian partners.", "e-verify": "", "stemvisas": "Yes", "party": "D", "position": "Rep.", "fullname": "Eric Swalwell", "citizenship": "Believes we must have a meaningful mechanism for undocumented persons to become legal residents and citizens."}, {"agworkervisas": "Yes, but any immigration legislation should include provisions that prevent unscrupulous employers from taking advantage of them.", "othervisaissues": "", "bioguideid": "T000472", "firstname": "Mark", "district": "Riverside", "source": "", "lastname": "Takano", "imageurl": "/legacy/assethost/i/95af298588d8607ab47e8fc7a9448cae/54585-wide.jpg", "dreamact": "", "misc": "", "bordersecurity": "Illegal border crossings are the lowest they’ve been in many years. Congressman Takano believes our border should remain secure and properly enforced.", "caption": "Congressman member Mark Takano - (D-Riverside)", "family-basedvisas": "Should include provisions for gay and lesbian partners. ", "e-verify": "Yes", "stemvisas": "Yes", "party": "D", "position": "Rep.", "fullname": "Mark Takano", "citizenship": "Yes"}, {"agworkervisas": "Yes", "othervisaissues": "", "bioguideid": "T000460", "firstname": "Mike", "district": "St. Helena", "source": "", "lastname": "Thompson", "imageurl": "/legacy/assethost/i/cea28e53ea47e0f3c38708462660e7a8/54588-wide.jpg", "dreamact": "", "misc": "Yes", "bordersecurity": "Yes", "caption": "Congressman Mike Thompson - (D-St. Helena)", "family-basedvisas": "Must include gay and lesbian partners.", "e-verify": "Supports E-verify, but it must be part of a comprehensive solution that doesn’t threaten the stable workforce our farmers and ranchers depend on.\n", "stemvisas": "Yes", "party": "D", "position": "Rep.", "fullname": "Mike Thompson", "citizenship": "Supports an earned path to citizenship that includes paying a reasonable fine and back taxes, and passing a background check. \n"}, {"agworkervisas": "Yes", "othervisaissues": "I have people in my district that have been waiting 20 years to get some kind of status. About 50% of the people who are here undocumented today have tried to go through the system and have given up because of how long it takes.", "bioguideid": "V000129", "firstname": "David", "district": "Hanford", "source": "", "lastname": "Valadao", "imageurl": "/legacy/assethost/i/e50dc3fe30296d026916dd9819e00756/54554-wide.jpg", "dreamact": "", "misc": "", "bordersecurity": "", "caption": "Congressman David Valadao - (R-Hanford)", "family-basedvisas": "", "e-verify": "", "stemvisas": "Yes, we have businesses investing outside of the United States because of a lack of people who can do those jobs.", "party": "R", "position": "Rep.", "fullname": "David Valadao", "citizenship": "About 50% of the 11 million undocumented have tried to go through the system and given up; the other half -- the ones here causing problems -- find a way to get rid of them; the ones that are doing a good job, working and doing everything right, raising a family and doing good for their family, we've gotta find a way to make sure that we give them the opportunity to give them the American dream just like my parents did."}, {"agworkervisas": "My family came to this country through the Bracero Program. If you signed up, you took an immediate physical, and if you had no medical problems, they’d tell you where to show up. My father was told to go to Tijuana, his name would be on a list, and he’d be assigned a place to work. We need an orderly, legal way for immigrants to be able to come to the United States to take the jobs others among us won’t take.", "othervisaissues": "", "bioguideid": "", "firstname": "Juan", "district": "Chula Vista", "source": "speech on the House floor: http://vargas.house.gov/ and 2006 magazine article: http://www.sandiegomagazine.com/San-Diego-Magazine/May-2006/Juan-Vargas-with-Tom-Blair/", "lastname": "Vargas", "imageurl": "/legacy/assethost/i/b7c0bfe3b30f5c3899d6f4cdce932514/54575-wide.jpg", "dreamact": "", "misc": "", "bordersecurity": "", "caption": "Congressman Juan Vargas - (D-Chula Vista)", "family-basedvisas": "", "e-verify": "", "stemvisas": "", "party": "D", "position": "Rep.", "fullname": "Juan Vargas", "citizenship": " Make people jump through hoops before they’re able to stay here in any long-term sense. Make sure they’re not criminals, that they pay any taxes they may not have paid and that they get fined for coming here illegally. Once you do all that, then people can begin the process toward permanent residency."}, {"agworkervisas": "", "othervisaissues": "", "bioguideid": "W000187", "firstname": "Maxine", "district": "Los Angeles", "source": "", "lastname": "Waters", "imageurl": "/legacy/assethost/i/c52c55a13b0fcd918d440f64b75235b4/54586-wide.jpg", "dreamact": "", "misc": "We must also hold employers accountable by assessing increased penalties for those who exploit undocumented immigrant labor.", "bordersecurity": "", "caption": "Congresswoman Maxine Waters - (D-Los Angeles)", "family-basedvisas": "", "e-verify": "", "stemvisas": "", "party": "D", "position": "Rep.", "fullname": "Maxine Waters", "citizenship": "Reform must also include a fair path to citizenship and some penalty for those who have been in the U.S. illegally. Individuals who have lived in the U.S. for many years while raising their families, paying taxes, and paying into social security should have the opportunity to become legal citizens in a fair and efficient process. "}, {"agworkervisas": "Yes", "othervisaissues": "", "bioguideid": "W000215", "firstname": "Henry", "district": "Los Angeles", "source": "", "lastname": "Waxman", "imageurl": "/legacy/assethost/i/1600cfbf17bf5e3f0566dffbadffdb89/54567-wide.jpg", "dreamact": "Yes", "misc": "Yes", "bordersecurity": "Yes", "caption": "Congressman Henry Waxman - (D-Los Angeles)", "family-basedvisas": "", "e-verify": "Verification would be helpful so employers can act in a prudent way.", "stemvisas": "", "party": "D", "position": "Rep.", "fullname": "Henry Waxman", "citizenship": "Yes"}]}
