[{"body": "Tom Calderon succeeds his brother Charles to represent State Assembly District 58. ", "mediaurl": "http://www.water2save.com/images/tom.jpg", "readmoreurl": "http://articles.latimes.com/2006/jun/01/local/me-calderon1", "title": "Tom Calderon elected to Assembly", "mediatype": "image", "caption": "", "displaydate": "Nov.", "date": "11/1/1999", "readmoresource": "LA TImes"}, {"body": "Ron Calderon is elected to the 58th district assembly seat, which was vacated by his brother Tom Calderon in order to run for insurance commissioner. ", "mediaurl": "http://www.ourcampaigns.com/images/candidates/b5/C5492D0000-00-00.jpg", "readmoreurl": "http://www.ourcampaigns.com/RaceDetail.html?RaceID=288694", "title": "Ron Calderon elected to California Assembly", "mediatype": "image", "caption": "", "displaydate": "Nov.", "date": "11/5/2002", "readmoresource": ""}, {"body": "Tom Calderon, the brother of Senator Ron Calderon, receives a lucrative contract as a consultant for the Central Basin Water Board, where he's reportedly paid $10,000 per month to advise the district.", "mediaurl": "http://a.scpr.org/i/1699893e20b3a8a422e755007194d82e/62301-lead.jpg", "readmoreurl": "http://articles.latimes.com/2011/jun/03/local/la-me-central-basin-20110603", "title": "Tom Calderon is hired as a consultant for the Central Basin Water District", "mediatype": "image", "caption": "", "displaydate": "2004", "date": "1/1/2004", "readmoresource": "LA TImes"}, {"body": "Ron Calderon is elected to represent a large portion of eastern L.A. County, including the cities of Bell, Montebello, Commerce, Cudahy, Huntington Park, La Mirada, and a portion of Los Angeles", "mediaurl": "http://sd30.senate.ca.gov/sites/sd30.senate.ca.gov/files/images/senator_calderon_thumb.jpg", "readmoreurl": "", "title": "Ron Calderon elected to State Senate", "mediatype": "image", "caption": "Ronald S. Calderon is the state senator representing Bell, Bell Gardens, Commerce, Cudahy, Huntington Park, La Mirada, Los Angeles, Montebello, Norwalk, Pico Rivera, Santa Fe Springs, South El Monte, South Gate, Whittier, East La Mirada, East Los Angeles, Florence-Graham, Hacienda Heights, South Whittier and West Whittier.", "displaydate": "Nov.", "date": "11/1/2006", "readmoresource": ""}, {"body": "The bill would have increased the minimum reporting requirement from $5,000 to $7,000. Calderon withdraws it after the chairman of the Fair Political Practices Commission urges Gov. Schwarzenegger to veto it, noting that if a legislator donates money, it should be reported.", "mediaurl": "http://a.scpr.org/i/c5631ce954440bc3f3a69919b5a66092/62503-small.jpg", "readmoreurl": "http://www.whittierdailynews.com/search/ci_6966786", "title": "Ron Calderon backs bill to ease restrictions on legislator-directed donations to charities", "mediatype": "image", "caption": "State Sen. Ron Calderon, left, smiles as he walks through the Capitol with his brother, former assemblyman Charles Calderon, D-Whittier.", "displaydate": "Sept.", "date": "9/21/2007", "readmoresource": ""}, {"body": "The FBI begins an investigation into Ron, Tom and Charles Calderon after receiving information from the Fair Political Practices Commission. (Via FBI affidavit published by Al Jazeera America)", "mediaurl": "", "readmoreurl": "", "title": "FBI investigates Calderons", "mediatype": "", "caption": "", "displaydate": "Oct. 15", "date": "10/15/2007", "readmoresource": ""}, {"body": "The FBI in Los Angeles joins another undercover investigation in Sacramento. Two undercover FBI agents pose as venture capitalists and meet with Ron and Tom Calderon. No are bribes solicited or accepted. (Via FBI affidavit published by Al Jazeera America)", "mediaurl": "", "readmoreurl": "", "title": "FBI meets Ron, Tom Calderon", "mediatype": "", "caption": "", "displaydate": "February", "date": "2/1/2008", "readmoresource": ""}, {"body": "Ron Calderon makes the first of three donations, totaling $6,000, to candidates running for the Central Basin board. The money comes from his 2010 senate campaign fund. Two of the recipients, Art Chacon and Phillip Hawkins, remain on the board.", "mediaurl": "http://a.scpr.org/i/6a453c84d37e161ee3550ae8cf77b3d7/62501-small.jpg", "readmoreurl": "http://www.scpr.org/blogs/politics/2013/06/06/13915/calderon-brothers-have-ties-to-local-water-distric/", "title": "Calderon makes donations to water board candidates", "mediatype": "image", "caption": "Central Basin Water District board members Art Chacon (L) and Phillip D. Hawkins both received donations from Ron Calderon in 2008.", "displaydate": "May", "date": "5/2/2008", "readmoresource": "KPCC"}, {"body": "Calderon is tapped to head the influential Senate Banking Finance and Insurance Committee. The committee oversees legislation affecting financial and insurance institutions, commerce, international trade, retail credit interest rates and corporations.", "mediaurl": "http://a.scpr.org/i/e096654f82f0079d09dd0557d35e96a1/25352-lead.jpg", "readmoreurl": "http://sd30.senate.ca.gov/news/2008-12-02-senator-calderon-new-chair-banking-finance-and-insurance-committee", "title": "Ron Calderon becomes chair of Senate banking and insurance committee", "mediatype": "image", "caption": "", "displaydate": "Dec.", "date": "12/2/2008", "readmoresource": ""}, {"body": "U.S. Rep. Grace Napolitano calls for an investigation into a hike in water rates and an audit of the Central Basin Water District's spending. The district was never investigated despite, she says, Ron Calderon's assurances it would be. Napolitano told the LA Times she believes Calderon thwarted the attempt.", "mediaurl": "http://a.scpr.org/i/6f2ecac40e33d6de04f44d0a0da7b690/62499-lead.jpg", "readmoreurl": "http://www.latimes.com/news/local/political/la-me-pc-ron-calderon-fbi-central-basin-water-district-tom-calderon-water-20130605,0,2842227.story", "title": "Congresswoman's calls for investigation of water district allegedly thwarted", "mediatype": "image", "caption": "", "displaydate": "2009", "date": "1/1/2009", "readmoresource": "LA Times"}, {"body": "A Central Basin Municipal Water District committee recommends a $1 million grant for EcoGreen, a Southern California environmental firm. But the board instead decides to award the contract to The Steelworkers Oldtimers Foundation, a nonprofit founded by former Bell mayor George Cole. Tom Calderon is a former president of the organization. EcoGreen exec Michael Francheck alleges cronyism.", "mediaurl": "http://a.scpr.org/i/1699893e20b3a8a422e755007194d82e/62301-lead.jpg", "readmoreurl": "http://www.scpr.org/blogs/politics/2013/06/06/13915/calderon-brothers-have-ties-to-local-water-distric/", "title": "Allegations of cronyism: Central Basin Water District's contract with Oldtimers Foundation", "mediatype": "image", "caption": "", "displaydate": "Oct.", "date": "10/1/2009", "readmoresource": "KPCC"}, {"body": "The Central Basin Municipal Water District district is awarded a $1 million federal research grant to work with HydroEarth, a local water management firm. But the project takes a turn when the district amends the grant and reopens the contract for bidding. The contract is instead awarded to another water management firm, Water2Save. HydroEarth executives allege the move was made because Tom Calderon is a Water2Save board member.", "mediaurl": "http://a.scpr.org/i/1699893e20b3a8a422e755007194d82e/62301-lead.jpg", "readmoreurl": "http://articles.latimes.com/2012/jun/02/local/la-me-corruption-libel-20120602", "title": "Allegations of cronyism: Central Basin Water District's contract with Water2Save", "mediatype": "image", "caption": "", "displaydate": "2010", "date": "1/1/2010", "readmoresource": "LA Times"}, {"body": "Calderon is unanimously elected vice-chair of the 23-member Latino Legislative Caucus, replacing Tony Mendoza, who moved up to chair the organization.", "mediaurl": "http://sd30.senate.ca.gov/sites/sd30.senate.ca.gov/files/images/833ebce8-535f-45f9-a487-7a4303b15212.thumbnail.jpg", "readmoreurl": "http://sd30.senate.ca.gov/news/2010-12-07-senator-calderon-becomes-new-vice-chair-california-latino-legislative-caucus", "title": "Ron Calderon becomes Vice Chair of Latino Legislative Caucus", "mediatype": "image", "caption": "", "displaydate": "Dec.", "date": "12/7/2010", "readmoresource": ""}, {"body": "Calderon introduces SB701, a bill that would have extended the reach of the Central Basin water district's authority. The bill never received a hearing in the senate.", "mediaurl": "http://a.scpr.org/i/1699893e20b3a8a422e755007194d82e/62301-lead.jpg", "readmoreurl": "http://leginfo.legislature.ca.gov/faces/billTextClient.xhtml?bill_id=201120120SB701&search_keywords=central+basin", "title": "Ron Calderon introduces bill that would grant more authority to water district", "mediatype": "image", "caption": "", "displaydate": "February", "date": "2/18/2011", "readmoresource": ""}, {"body": "FBI initiates undercover investigation targeting two other politicians in LA. An undercover agent is introduced to Ron Calderon. (Via FBI affidavit published by Al Jazeera America)", "mediaurl": "", "readmoreurl": "", "title": "FBI investigates other LA politicians", "mediatype": "", "caption": "", "displaydate": "Oct. 18", "date": "10/18/2011", "readmoresource": ""}, {"body": "The FBI's undercover agent presents himself as a Hollywood executive from a film studio. (Via FBI affidavit published by Al Jazeera America)", "mediaurl": "", "readmoreurl": "", "title": "Agent poses as studio executive", "mediatype": "", "caption": "", "displaydate": "Oct. 19", "date": "10/19/2011", "readmoresource": ""}, {"body": "Ron Calderon and the undercover agent have lunch in Los Angeles. (Via FBI affidavit published by Al Jazeera America)", "mediaurl": "", "readmoreurl": "", "title": "Ron Calderon meets the FBI for lunch", "mediatype": "", "caption": "", "displaydate": "Feb.2 4", "date": "2/24/2012", "readmoresource": ""}, {"body": "Ron Calderon sents a text message to the undercover agent. “Great lunch! Thanks. Here is my cell! I am emailing u next.” (Via FBI affidavit published by Al Jazeera America)", "mediaurl": "", "readmoreurl": "", "title": "Ron Calderon texts with FBI agent", "mediatype": "", "caption": "", "displaydate": "Feb. 24", "date": "2/24/2012", "readmoresource": ""}, {"body": "FBI adds Ron Calderon as a subject of its investigation. (Via FBI affidavit published by Al Jazeera America)", "mediaurl": "", "readmoreurl": "", "title": "FBI adds Ron Calderon to investigation", "mediatype": "", "caption": "", "displaydate": "April 9", "date": "4/9/2012", "readmoresource": ""}, {"body": "The undercover agent and Ron Calderon have dinner in Pico Rivera. Ron asks the agent, who is posing as a film executive, to give his daughter a job. “I told you man, anything you can do any help you could do for my kids is, is – you know that’s, that’s diamonds for me. That’s diamonds.\" (Via FBI affidavit published by Al Jazeera America)", "mediaurl": "", "readmoreurl": "", "title": "Dinner with the FBI", "mediatype": "", "caption": "", "displaydate": "June 11", "date": "6/11/2012", "readmoresource": ""}, {"body": "Ron Calderon says he's willing to hire the agent's girlfriend, who is actually an undercover FBI agent, to work in his office. (Via FBI affidavit published by Al Jazeera America)", "mediaurl": "", "readmoreurl": "", "title": "A job with Ron Calderon ", "mediatype": "", "caption": "", "displaydate": "June 21", "date": "6/21/2012", "readmoresource": ""}, {"body": "The agent and Ron Calderon have breakfast in Montebello. Calderon says he can introduce an amendment on film tax credits to benefit the agent. Calderon also offers to write up contract so his daughter can work for the film studio. “Ronald Calderon told the (undercover agent)  it was ‘better to keep it legit.’” He then tells the agent to mail him his daughter’s first paycheck. (Via FBI affidavit published by Al Jazeera America)", "mediaurl": "", "readmoreurl": "", "title": "Ron Calderon asks for a job -- for his daughter", "mediatype": "", "caption": "", "displaydate": "June 29", "date": "6/29/2012", "readmoresource": ""}, {"body": "Ron Calderon emails agent, “Didn’t receive anything yesterday FYI.”  (Via FBI affidavit published by Al Jazeera America)", "mediaurl": "", "readmoreurl": "", "title": "Ron Calderon: where's the money?", "mediatype": "", "caption": "", "displaydate": "July 4", "date": "7/4/2012", "readmoresource": ""}, {"body": "The agent and Ron Calderon meet at the agent’s apartment in downtown to talk about Calderon’s daughter and the tax credit legislation. (Via FBI affidavit published by Al Jazeera America)", "mediaurl": "", "readmoreurl": "", "title": "A meeting in downtown", "mediatype": "", "caption": "", "displaydate": "July 17", "date": "7/17/2012", "readmoresource": ""}, {"body": "Ron Calderon and his son visit the agent at his film studio. (Via FBI affidavit published by Al Jazeera America)", "mediaurl": "", "readmoreurl": "", "title": "Calderon visits the studio", "mediatype": "", "caption": "", "displaydate": "July 19", "date": "7/19/2012", "readmoresource": ""}, {"body": "The undercover agent calls Ron Calderon to get his home address. (Via FBI affidavit published by Al Jazeera America)", "mediaurl": "", "readmoreurl": "", "title": "Feds ask Calderon for address", "mediatype": "", "caption": "", "displaydate": "Aug. 1", "date": "8/1/2012", "readmoresource": ""}, {"body": "Agent mails Jessica Calderon's first \"paycheck.\" \"Package received. Ty,\" Ron Calderon writes in an email. (Via FBI affidavit published by Al Jazeera America)", "mediaurl": "", "readmoreurl": "", "title": "First check sent for Jessica Calderon", "mediatype": "", "caption": "", "displaydate": "Aug. 2", "date": "8/2/2012", "readmoresource": ""}, {"body": "Ron Calderon and his wife, Ana, attend the Imagen Awards at the Beverly Hilton hotel with the agent and another undercover agent posing as his girlfriend. (Via FBI affidavit published by Al Jazeera America)", "mediaurl": "", "readmoreurl": "", "title": "Imagen Awards", "mediatype": "", "caption": "", "displaydate": "Aug. 10", "date": "8/10/2012", "readmoresource": ""}, {"body": "Ron Calderon votes against a bill sponsored by state Sen. Alan Lowenthal that gives the Water Replenishment District of Southern California authority over groundwater reserves in the region. The bill passed 30-4 in the Senate and was signed into law by Governor Brown.", "mediaurl": "http://a.scpr.org/i/c4f7820ee62161462694bbe8cc21346c/62498-small.jpg", "readmoreurl": "http://www.mercurynews.com/california/ci_20615981/bill-seeks-clarify-groundwater-oversight", "title": "Calderon opposes bill to give authority over groundwater management to neighboring district", "mediatype": "image", "caption": "Sen. Alan Lowenthal sponsored SB 1386, which Calderon opposed.", "displaydate": "August", "date": "8/13/2012", "readmoresource": ""}, {"body": "Ron Calderon emails the agent to say, \"We were just thrown a curveball.\" The Legislative Counsel determines Calderon's amend on film tax credits needs a two-thirds vote. (Via FBI affidavit published by Al Jazeera America)", "mediaurl": "", "readmoreurl": "", "title": "Problem with Calderon's tax amendment ", "mediatype": "", "caption": "", "displaydate": "Aug. 14", "date": "8/14/2012", "readmoresource": ""}, {"body": "The agent and Ron Calderon have a conversation about keeping the film tax credit issue alive. Of Senate President Pro Tem Darrell Steinberg, Calderon says, \"I helped him, he helped me ... It was important to me. I did something that I knew was important to him. It is all about relationships.\" (Via FBI affidavit published by Al Jazeera America)", "mediaurl": "", "readmoreurl": "", "title": "Calderon talks about Steinberg", "mediatype": "", "caption": "", "displaydate": "Aug. 17", "date": "8/17/2012", "readmoresource": ""}, {"body": "Ron Calderon emails the FBI agent, asking \"should Jessica expect a check this month.\" (Via FBI affidavit published by Al Jazeera America)", "mediaurl": "", "readmoreurl": "", "title": "Calderon: where's the money?", "mediatype": "", "caption": "", "displaydate": "Sept. 5", "date": "9/5/2012", "readmoresource": ""}, {"body": "The agent and Ron Calderon have dinner in Pico Rivera. Ron Calderon agrees to write a letter in support of the tax credit legislation. According to the affidavit, \"Ronald Calderon told the UC it would be fine for them to make up an association or commission, so long as they were the ones to whom the letter was addressed.\" (Via affidavit published by Al Jazeera America)", "mediaurl": "", "readmoreurl": "", "title": "Ron Calderon makes up a film commission ", "mediatype": "", "caption": "", "displaydate": "Sept. 10", "date": "9/10/2012", "readmoresource": ""}, {"body": "Ron Calderon makes up the United Pacific Indepndent Producers of California. (Via FBI affidavit published by Al Jazeera America)", "mediaurl": "", "readmoreurl": "", "title": "United Pacific Independent Producers of California", "mediatype": "", "caption": "", "displaydate": "Sept. 11", "date": "9/11/2012", "readmoresource": ""}, {"body": "The undercover agent mails a $3,000 cehck with Jessica Calderon's name on it to Ron Calderon's home in Montebello. (Via FBI affidavit published by Al Jazeera America)", "mediaurl": "", "readmoreurl": "", "title": "Jessica Calderon's check goes to her dad", "mediatype": "", "caption": "", "displaydate": "Sept. 28", "date": "9/28/2012", "readmoresource": ""}, {"body": "Judge Paul L. Abrams allows the government to search Calderon’s AOL email account. (Via FBI affidavit published by Al Jazeera America)", "mediaurl": "", "readmoreurl": "", "title": "Feds look into Calderon's emails", "mediatype": "", "caption": "", "displaydate": "Oct. 16", "date": "10/16/2012", "readmoresource": ""}, {"body": "The agent has dinner with Ron and Tom Calderon. Ron Calderon says state Sen. Kevin de Leon was suppose to join them. (Via FBI affidavit published by Al Jazeera America)", "mediaurl": "", "readmoreurl": "", "title": "Dinner with the Calderons", "mediatype": "", "caption": "", "displaydate": "Oct. 16", "date": "10/16/2012", "readmoresource": ""}, {"body": "Ron Calderon asks the agent to give Jessica Calderon something to do to legimitize the arrangement. (Via FBI affidavit published by Al Jazeera America)", "mediaurl": "", "readmoreurl": "", "title": "Ron Calderon asks for work for his daughter", "mediatype": "", "caption": "", "displaydate": "Oct. 24", "date": "10/24/2012", "readmoresource": ""}, {"body": "Ron Calderon tells the agent it's important to have a good relationship with de Leon. He says, \"Senator de Leon could be extremely helpful in getting Ronald Calderon several appointments, such as an appointment to the Unemployment Board of the Board of Equalization.\" (Via FBI affidavit published by Al Jazeera America)", "mediaurl": "", "readmoreurl": "", "title": "Ron Calderon talks about de Leon", "mediatype": "", "caption": "", "displaydate": "Oct. 24", "date": "10/24/2012", "readmoresource": ""}, {"body": "The FBI agent meets Ron Calderon and Kevin de Leon for dinner in downtown Los Angeles. They discuss film tax credits. (Via FBI affidavit published by Al Jazeera America)", "mediaurl": "", "readmoreurl": "", "title": "Dinner with de Leon", "mediatype": "", "caption": "", "displaydate": "Oct. 25", "date": "10/25/2012", "readmoresource": ""}, {"body": "Jessica Calderon emails the agent about helping him get a liquor license for his studio. This is not something the agent ever discussed with her. (Via FBI affidavit published by Al Jazeera America)", "mediaurl": "", "readmoreurl": "", "title": "Jessica Calderon emails FBI agent", "mediatype": "", "caption": "", "displaydate": "Oct. 26", "date": "10/26/2012", "readmoresource": ""}, {"body": "Ron Calderon emails the agent to ask if he's had any luck arranging a trip to Las Vegas for Halloween. The agent reponds that he's booked a VIP table at Bank. \"Nelly is hosting/performing and you've got a front row seat on the action!\" (Via FBI affidavit published by Al Jazeera America)", "mediaurl": "", "readmoreurl": "", "title": "Halloween in Las Vegas", "mediatype": "", "caption": "", "displaydate": "Oct. 29", "date": "10/29/2012", "readmoresource": ""}, {"body": "Ron Calderon emails the agent a picture of himself with rappers Nelly and T.I. (Via FBI affidavit published by Al Jazeera America)", "mediaurl": "", "readmoreurl": "", "title": "Calderon emails photos from Halloween", "mediatype": "", "caption": "", "displaydate": "Nov. 1", "date": "11/1/2012", "readmoresource": ""}, {"body": "The agent hands Ron Calderon a $3,000 check for his daughter. (Via FBI affidavit published by Al Jazeera America)", "mediaurl": "", "readmoreurl": "", "title": "Another check for Jessica Calderon", "mediatype": "", "caption": "", "displaydate": "Nov. 2", "date": "11/2/2012", "readmoresource": ""}, {"body": "Ron Calderon asks for a $5,000 check to cover his son's tuition at the Berklee College of Music. (Via FBI affidavit published by Al Jazeera America)", "mediaurl": "", "readmoreurl": "", "title": "Money for Zach Calderon's tuition", "mediatype": "", "caption": "", "displaydate": "Nov. 2", "date": "11/2/2012", "readmoresource": ""}, {"body": "At a dinner, Ron Calderon receives another $3,000 check for his daughter. (Via FBI affidavit published by Al Jazeera America)", "mediaurl": "", "readmoreurl": "", "title": "Another check to Ron Calderon", "mediatype": "", "caption": "", "displaydate": "Nov. 20", "date": "11/20/2012", "readmoresource": ""}, {"body": "Ron Calderon suggests the agent donate $10,000 to Kevin de Leon's fundraiser that will be held in connection with the Manny Paquiao fight in Las Vegas. (Via FBI affidavit published by Al Jazeera America)", "mediaurl": "", "readmoreurl": "", "title": "Fundraiser for de Leon", "mediatype": "", "caption": "", "displaydate": "Dec. 4", "date": "12/4/2012", "readmoresource": ""}, {"body": "Ron Calderon tells the agent that Kevin de Leon made him a deal not to run as chair of the Latino Caucus. According to Calderon, de Leon will give him a paid political appointment when he leaves office, give him his own fundraiser, and give him $25,000 to hire consultants. (Via FBI affidavit published by Al Jazeera America)", "mediaurl": "", "readmoreurl": "", "title": "Ron Calderon talks more about de Leon", "mediatype": "", "caption": "", "displaydate": "Dec. 5", "date": "12/5/2012", "readmoresource": ""}, {"body": "Ron Caldeorn gives the agent a box of cigars and a coffee maker as gifts for the holidays. (Via FBI affidavit published by Al Jazeera America)", "mediaurl": "", "readmoreurl": "", "title": "Christmas gifts for the FBI", "mediatype": "", "caption": "", "displaydate": "Dec. 8", "date": "12/18/2012", "readmoresource": ""}, {"body": "The FBI office in Sacramento ends its investigation. (Via FBI affidavit published by Al Jazeera America)", "mediaurl": "", "readmoreurl": "", "title": "FBI Sacramento closes investigation", "mediatype": "", "caption": "", "displaydate": "Dec. 19", "date": "12/19/2012", "readmoresource": ""}, {"body": "Ron Calderon invites the agent to a Lady Gaga concert fundraiser benefitting his 2014 campaign for controller and state Sen. Ricardo Lara's 2016 race. (Via FBI affidavit published by Al Jazeera America)", "mediaurl": "", "readmoreurl": "", "title": "Lady Gaga Concert Fundraiser", "mediatype": "", "caption": "", "displaydate": "Jan. 2", "date": "1/2/2013", "readmoresource": ""}, {"body": "The undercover agent is given an invoice for $25,000 for Californains for Diversity. (Via FBI affidavit published by Al Jazeera America)", "mediaurl": "", "readmoreurl": "", "title": "Money for Californians for Diversity", "mediatype": "", "caption": "", "displaydate": "Jan. 12", "date": "1/12/2013", "readmoresource": ""}, {"body": "Judge Audrey B. Collins allows the feds to intercept wire and electronic communications from Ron Calderon's cell phone. (Via FBI affidavit published by Al Jazeera America)", "mediaurl": "", "readmoreurl": "", "title": "FBI listens to Calderon's phone calls", "mediatype": "", "caption": "", "displaydate": "March 8", "date": "3/8/2013", "readmoresource": ""}, {"body": "Ron Calderon asks the agent to write a $3,200 check to his officeholder account so he can buy a plane ticket to Miami. A day later, the agent mails him the check. (Via FBI affidavit published by Al Jazeera America)", "mediaurl": "", "readmoreurl": "", "title": "Money for Miami", "mediatype": "", "caption": "", "displaydate": "March 9", "date": "3/9/2013", "readmoresource": ""}, {"body": "Judge Abrams authorizes a follow up search of the AOL email account and a search of Ron Calderon's i-cloud emails. (Via FBI affidavit published by Al Jazeera America)", "mediaurl": "", "readmoreurl": "", "title": "FBI looks at more emails", "mediatype": "", "caption": "", "displaydate": "March 11", "date": "3/11/2013", "readmoresource": ""}, {"body": "Ron and Tom Calderon fly to Miami to meet with a third undercover agent who is posing as an investor in the film studio. They talk to him about hiring Tom Calderon as a consultant. (Via FBI affidavit published by Al Jazeera America)", "mediaurl": "", "readmoreurl": "", "title": "A trip to Miami ", "mediatype": "", "caption": "", "displaydate": "March 21", "date": "3/21/2013", "readmoresource": ""}, {"body": "This third undercover agent and the Calderons agree to pay Tom Calderon's consulting fee through Californians for Diversity. When the agent drops off Ron Calderon at the airport, he hands him an envelope containing $3,000 in cash. (Via FBI affidavit published by Al Jazeera America)", "mediaurl": "", "readmoreurl": "", "title": "Californians for Diversity and an envelope of cash", "mediatype": "", "caption": "", "displaydate": "March 26", "date": "3/26/2013", "readmoresource": ""}, {"body": "Judge Jean P. Rosennbluth authoraizes search for information on Michael Drobot of Pacific Hospital in Long Beach. (Via FBI affidavit published by Al Jazeera America)", "mediaurl": "", "readmoreurl": "", "title": "Feds investigate Pacific Hospital", "mediatype": "", "caption": "", "displaydate": "April 3", "date": "4/3/2013", "readmoresource": ""}, {"body": "Judge Collins renews order to tap Calderon's cell.(Via affidavit published by Al Jazeera America)", "mediaurl": "", "readmoreurl": "", "title": "More taps on Calderon's phone", "mediatype": "", "caption": "", "displaydate": "April 9", "date": "4/9/2013", "readmoresource": ""}, {"body": "Affidavit to search Calderon's office is signed. (Via FBI affidavit published by Al Jazeera America)", "mediaurl": "", "readmoreurl": "", "title": "Feds get affidavit to search", "mediatype": "", "caption": "", "displaydate": "May 2", "date": "5/2/2013", "readmoresource": ""}, {"body": "L.A. State Sen. Ron Calderon's offices in the state capitol and at the Legislative Office Building in Sacramento are raided by FBI agents. Several agents left the Capitol more than six hours later carrying at least a half-dozen boxes, stuffed black bags and what appeared to be a computer hard drive. Calderon's denies any wrongdoing.", "mediaurl": "http://a.scpr.org/i/efd7b49515866a3442811b2b5a50645a/62223-lead.jpg", "readmoreurl": "http://www.scpr.org/news/2013/06/04/37578/fbi-raids-office-of-calif-state-lawmaker/", "title": "Ron Calderon's offices raided by FBI", "mediatype": "", "caption": "An FBI agent carries out a box as he leaves the Capitol office of State Sen. Ron Calderon, D-Montebello, in Sacramento, Calif., Tuesday, June 4, 2013.", "displaydate": "June", "date": "6/4/2013", "readmoresource": ""}]