[{"body": "John Adams had the unfortunate duty of taking over for our nation's beloved first president, George Washington. However, his inauguration marks an important moment in American history: a peaceful transition of power. Washington could likely have held onto power due to his immense popularity, but chose to hand the reins over in a free election to Adams. His inauguration was seen as being more of a farewell to Washington than a welcome of Adams, with tears shed by the crowd at Washington leaving.", "mediaurl": "https://a.scpr.org/i/07d20787402e4f4e7813780080f4d160/53760-full.jpg", "readmoreurl": "", "title": "John Adams", "mediatype": "image", "caption": "(National Archives/Newsmakers)", "displaydate": "1797", "date": "March 4, 1797", "readmoresource": ""}, {"body": "Andrew Jackson's inauguration ceremony didn't go so well — the 20,000 in attendance started getting restless, and the drunken mob started smashing objects inside the White House. In a scheme worthy of a Looney Tunes cartoon, organizers decided to lure everyone outside by planting free alcohol on the White House lawn. Feelings also weren't good between Andrew Jackson and his predecessor, John Quincy Adams. Adams didn't bother attending Jackson's inaugural ceremony. The 1828 campaign had been bitter, going so far as Jackson blaming verbal attacks from Adams and his political allies for the death of Jackson's wife. The bad feelings extended to Jackson's cabinet, where the wives of cabinet members shunned another wife in what became such a huge political scandal that it has its own name — the Petticoat Affair.", "mediaurl": "https://a.scpr.org/i/3628a3b4ba82a7972a9a20b63be597e9/53765-full.jpg", "readmoreurl": "", "title": "Andrew Jackson", "mediatype": "image", "caption": "(National Archives/Getty Images)", "displaydate": "1829", "date": "March 4, 1829", "readmoresource": ""}, {"body": "William Henry Harrison is infamous for having the shortest presidency on record. He gave the longest inauguration speech in history, taking more than two hours to deliver a whopping 8,445 words. Not only was it long, but the crowd also found it boring, going on at length about Rome. Yes, Rome. The 68-year-old decided to deliver it without a coat or a hat. He went out afterward and attended a parade and three inaugural balls, as well as imbibing some alcohol at said balls. Harrison went on to die of pneumonia and pleurisy a month later, which is believed to have been brought on thanks to prolonged exposure to inclement weather at his Inauguration. Maybe he should have tried bringing that speech in at under 5,000 words.", "mediaurl": "https://a.scpr.org/i/b7cff9c195a2ee4a42cdc1235cea1000/53753-full.jpg", "readmoreurl": "", "title": "William Henry Harrison", "mediatype": "image", "caption": "(National Archives/Newsmakers/Getty Images)", "displaydate": "1841", "date": "March 4, 1841", "readmoresource": ""}, {"body": "James Buchanan started by delivering an awful speech and followed it up with inauguration activities that killed 36 people, including three congressmen. The United States was headed toward the Civil War, but Buchanan tried to tell the populace that rising tensions were nothing to worry about, saying that the \"long agitation on this subject is approaching its end.\" Aside from a bad, clueless speech, guests at Washington's National Hotel came down with a mysterious illness, with some dying quickly and others dying at various points over the ensuing two years. Buchanan came down with the disease — twice — and was even rumored to be dead. As with Mark Twain, the rumors of his death were exaggerated, but it led to his spending the first weeks of his presidency in bed.", "mediaurl": "https://a.scpr.org/i/d068fb2ab2f8c828927a93d4173003fa/53757-full.jpg", "readmoreurl": "", "title": "James Buchanan", "mediatype": "image", "caption": "(National Archives/Newsmakers)", "displaydate": "1857", "date": "March 4, 1857", "readmoresource": ""}, {"body": "Abraham Lincoln is widely considered one of our nation's greatest orators of all time, but his second inaugural is one of the crown jewels of the Lincoln ouevre. Lincoln was already riding a wave of success (as you might have seen recently in the film \"Lincoln\"), with the South close to defeat in the Civil War. After a wet morning, the sun broke through the clouds as Lincoln rose to speak, leading the crowd to actually gasp. Lincoln, rather than bragging, offered humble thoughts seeking reconciliation between North and South, calling for \"malice toward none\" and \"charity for all.\"", "mediaurl": "https://a.scpr.org/i/047b471d2b903da0ac17f7be15416704/53759-full.jpg", "readmoreurl": "", "title": "Abraham Lincoln (Second term)", "mediatype": "image", "caption": "(National Archives/Newsmakers)", "displaydate": "1865", "date": "March 4, 1865", "readmoresource": ""}, {"body": "William Taft faced some of the worst weather conditions for an inauguration in history. Thanks to a March blizzard, the inauguration took place in the Senate chamber. Wind had toppled telephone poles and trees, trains were stalled and city streets were impassable. Washington city workers worked through half the night shoveling snow and sand, and it took a total of 6,000 men and 500 wagons to clear 58,000 tons of snow from the parade route.", "mediaurl": "https://a.scpr.org/i/4ebcf947681b050df92238f37f6f7700/53761-full.jpg", "readmoreurl": "", "title": "William H. Taft", "mediatype": "image", "caption": "The Inaugural Ballroom in the Pension Office Building decorated for William H. Taft's Inauguration. (National Archives/Getty Images)", "displaydate": "1909", "date": "March 9, 1909", "readmoresource": ""}, {"body": "Franklin Roosevelt's first inaugural speech delivered words that would go down in history as perhaps the most memorable line in inaugural speech history: \"The only thing we have to fear ... is fear itself.\"", "mediaurl": "https://a.scpr.org/i/d6c071d8ffbae7c6ad6bbf46b3e28c9c/53764-full.jpg", "readmoreurl": "", "title": "Franklin D. Roosevelt (First term)", "mediatype": "image", "caption": "Franklin D. Roosevelt takes the Oath of Office. (National Archives/Getty Images)", "displaydate": "1933", "date": "March 4, 1933", "readmoresource": ""}, {"body": "John F. Kennedy delivered one of the most famous lines heard in an inaugural speech, helping to inspire a nation. \"My fellow Americans: Ask not what your country can do for you — ask what you can do for your country.\"", "mediaurl": "https://a.scpr.org/i/ba644515adc255e2fe56ec94bfc7c837/53756-full.jpg", "readmoreurl": "", "title": "John F. Kennedy", "mediatype": "image", "caption": "John F. Kennedy at the Mayflower Hotel in Washington, D.C. during his inauguration ball. (AFP/Getty Images)", "displaydate": "1961", "date": "January 20, 1961", "readmoresource": ""}, {"body": "There were no grand ceremonies for Gerald Ford. Ford was sworn in at the White House after Richard Nixon resigned. Ford also holds the dubious honor of being the first unelected vice president to take office, as former vice president Spiro Agnew had earlier resigned, leaving Ford to be appointed as Agnew's replacement.", "mediaurl": "https://a.scpr.org/i/619940990658a1881313fd5bd37e8b88/53762-full.jpg", "readmoreurl": "", "title": "Gerald Ford", "mediatype": "image", "caption": "Supreme Court Chief Justice Warren Burger (R) swears in Gerald Ford. (Robert L. Knudsen/Gerald R. Ford Library via Getty Images)", "displaydate": "1974", "date": "August 9, 1974", "readmoresource": ""}, {"body": "Ronald Reagan's first inaugural was the closest that an inauguration's ever gotten to T-shirt weather. It's the warmest on record, with the temperature at noon being 55 degrees. He also delivered a speech that most historians consider one of the best of all time.", "mediaurl": "https://a.scpr.org/i/9ac75184bfe4b2506e8e1a80fe6a179e/53758-wide.jpg", "readmoreurl": "", "title": "Ronald Reagan (First term)", "mediatype": "image", "caption": "Ronald Reagan (C) salutes after being sworn in as 40th president of the United States at the Capitol. (AFP/Getty Images)", "displaydate": "1981", "date": "January 20, 1981", "readmoresource": ""}, {"body": "Ronald Reagan's was swept to a second term with overwhelming support, but that support apparently didn't include Mother Nature. His was the coldest Inauguration Day on record, with high noon bringing a whopping 7 degree temperature with it. And yes, that's Fahrenheit.", "mediaurl": "https://a.scpr.org/i/fbc342091c8ca0fe15947349f0fcd83d/53763-full.jpg", "readmoreurl": "", "title": "Ronald Reagan (Second term)", "mediatype": "image", "caption": "Ronald Reagan is sworn in inside the Capitol Rotunda. (AFP/Getty Images)", "displaydate": "1985", "date": "January 21, 1985", "readmoresource": ""}, {"body": "Former President George W. Bush faced protesters throughout his presidency, including at his second inaugural, but they started at the first. Four protesters were arrested, with more detained, mostly due to disorderly conduct. The presidential limousine itself was hit by a tennis ball and an egg. Bush also faced a more personal, less political defeat. He had hoped to use the Masonic Bible used by George Washington in 1789 and by his own father, George H.W. Bush, in 1989. It was even transported under guard from New York to Washington for the ceremonies. However, thanks to bad weather, it was decided that it wouldn't be safe for the historic Bible to be used in the ceremonies, and a family Bible had to be substituted instead. A not-quite-as-good day for George W. Bush.", "mediaurl": "https://a.scpr.org/i/e8d91d05ea468dc592158836ad325c3f/53755-full.jpg", "readmoreurl": "", "title": "George W. Bush (First term)", "mediatype": "image", "caption": "Protesters shout, wave banners and fly the U.S. flag upside down as newly sworn in President George W. Bush passes by in his limousine on Pennsylvania Avenue. (Shawn Thew/AFP/Getty Images)", "displaydate": "2001", "date": "January 20, 2001", "readmoresource": ""}, {"body": "President Barack Obama's first inaugural had not just the largest attendance of any inauguration in history, but also the largest attendance of any event in Washington's history. Two million people attended the event. It also marked a historic moment: The nation electing an African-American for the first time.", "mediaurl": "https://a.scpr.org/i/8aa71bdc657ce6ff482e8032c62c31ef/53754-full.jpg", "readmoreurl": "", "title": "Barack Obama", "mediatype": "image", "caption": "Barack Obama is sworn in by Chief Justice John Roberts as the 44th president of the United States on the West Front of the Capitol. (Mark Wilson/Getty Images)", "displaydate": "2009", "date": "January 20, 2009", "readmoresource": ""}]
