{"storymap":{"map_as_image":false,"slides":[{"date":"","text":{"headline":"Man charged in series of shootings, named suspect in four others","text":"<div>Authorities in Los Angeles say the 34-year-old Sylmar man they have in custody is responsible for a series of shootings dating back to Aug. 20 that left four people dead.</div><div><br></div><div>Alexander Hernandez has been charged in connection with three of seven shootings, but LAPD said he is a suspect in the other four, which include three on Sunday morning near Sylmar that left three people dead and two others injured.</div><div><br></div><div>Hernandez on Tuesday was charged with one count of capital murder, one count of murder with special circumstances, two counts of attempted murder, one count of shooting at an occupied vehicle and three counts of animal cruelty. He also is charged with two counts of discharge of a firearm with gross negligence, one count of possession of a firearm by a felon and possession of ammunition.</div><div><br></div><div>This map shows the locations of the shootings and details the incidents based on information made available Tuesday at a news conference announcing the charges.</div>"},"media":{"url":"","credit":"","caption":""},"location":{"line":true,"icon":"http://maps.gstatic.com/intl/en_us/mapfiles/ms/micons/blue-pushpin.png"},"type":"overview"},{"date":"","text":{"headline":"6 a.m., Aug. 20","text":"A 42-year-old woman exits the northbound 5 Freeway at Colorado Boulevard when a lone male in a SUV begins to shoot at her, causing life-threatening injuries, LAPD Deputy Chief Kirk Albanese said during a Tuesday news conference.&nbsp;Alexander Hernandez is a suspect in this incident,&nbsp;Albanese said.&nbsp;<br>"},"media":{"url":"","credit":"","caption":""},"location":{"line":true,"icon":"http://maps.gstatic.com/intl/en_us/mapfiles/ms/micons/blue-pushpin.png","lat":34.140928,"lon":-118.2773363,"zoom":13}},{"date":"","text":{"headline":"5:00 a.m., Aug. 21","text":"Forty-eight-year-old Gildardo Morales stops at a traffic light at the intersection of Glenoaks Boulevard and Vaughn Street in the Pacoima area when a lone male in a SUV begins shooting at him. Officers found Morales slumped over the steering wheel of his vehicle with the engine still running. Alexander Hernandez is charged with one count of capital murder and one count of murder with special circumstances in connection with this incident, according to an Aug. 26 Los Angeles County District Attorney's Office news release.<br>"},"media":{"url":"","credit":"","caption":""},"location":{"line":true,"icon":"http://maps.gstatic.com/intl/en_us/mapfiles/ms/micons/blue-pushpin.png","lat":34.282601,"lon":-118.42117000000002,"zoom":13}},{"date":"","text":{"headline":"11 p.m, Aug. 22","text":"Two West Hollywood residents are in a pickup truck at a stop sign at the intersection of Gardner Street and Sunset Boulevard in West Hollywood&nbsp;when a lone male in a SUV began shooting at them. The victims fled without injury. Hernandez is charged with two counts of attempted murder and one count of shooting at an occupied vehicle in connection with this incident, according to an Aug. 26 Los Angeles County District Attorney's Office news release.<br>"},"media":{"url":"","credit":"","caption":""},"location":{"line":true,"icon":"http://maps.gstatic.com/intl/en_us/mapfiles/ms/micons/blue-pushpin.png","lat":34.0906669,"lon":-118.35329360000003,"zoom":13}},{"date":"","text":{"headline":"11:20 a.m., Aug. 23","text":"Officers investigate an animal cruelty case in 13600 block of Eldridge Avenue in&nbsp;Sylmar&nbsp;in which a lone male in a SUV shot three dogs, killing two of them, before driving away. Hernandez is charged with three counts of animal cruelty in connection with this incident, according to an Aug. 26 Los Angeles County District Attorney's Office news release.<br>"},"media":{"url":"","credit":"","caption":""},"location":{"line":true,"icon":"http://maps.gstatic.com/intl/en_us/mapfiles/ms/micons/blue-pushpin.png","lat":34.3188002,"lon":-118.4256954,"zoom":13}},{"date":"","text":{"headline":"5:50 a.m., Aug. 24","text":"A family of five in the 1400 block of Celis Street in&nbsp;San Fernando is&nbsp;on their way an early-morning Mass at Santa Rosa de Lima, a Roman Catholic church a few blocks away, when a lone male in a SUV pulls alongside them and begins to shoot. A 23-year-old woman is killed. Her mother and father each suffer life-threatening injuries.&nbsp;<span>Alexander Hernandez is a suspect in this incident, police said.</span><br>"},"media":{"url":"","credit":"","caption":""},"location":{"line":true,"icon":"http://maps.gstatic.com/intl/en_us/mapfiles/ms/micons/blue-pushpin.png","lat":34.2859745,"lon":-118.44604470000002,"zoom":13}},{"date":"","text":{"headline":"6:35 a.m., Aug. 24","text":"<span>A 29-year-old man is walking near the Sylmar Recreational Center when a lone man in a SUV begins to shoot at him. The 29-year-old is killed. Alexander Hernandez is a suspect in this incident, police said.</span><br>"},"media":{"url":"","credit":"","caption":""},"location":{"line":true,"icon":"http://maps.gstatic.com/intl/en_us/mapfiles/ms/micons/blue-pushpin.png","lat":34.3082993,"lon":-118.4441165,"zoom":13}},{"date":"","text":{"headline":"6:50 a.m. , Aug. 24","text":"A 59-year-old woman stops her vehicle in&nbsp;<span>12900 block of Filmore Street in&nbsp;Pacoima&nbsp;</span>when a lone male in a SUV pulls alongside and begins shooting. She was killed as a result of her injuries.&nbsp;Alexander Hernandez is a suspect in this incident, police said.<br>"},"media":{"url":"","credit":"","caption":""},"location":{"line":true,"icon":"http://maps.gstatic.com/intl/en_us/mapfiles/ms/micons/blue-pushpin.png","lat":34.27687,"lon":-118.41392400000001,"zoom":13}}],"map_type":"stamen:toner","map_subdomains":""}}