{"objects": [{"topic": "action", "text": "As the great jurist, Oliver Wendell Holmes, once said when describing what stirs people to action:", "url": ""}, {"topic": "action", "text": "You were alarmed, you stirred yourselves to action and victory was the outcome.", "url": ""}, {"topic": "action", "text": "Montaigne, the great French writer of the 16th Century, in his Essay on Experience, wisely wrote: “There is little relation between our actions, which are in perpetual mutation, and fixed and immutable laws. The most desirable laws are those that are the rarest, simplest, and most general; and I even think that it would be better to have none at all than to have them in such numbers as we have.”", "url": ""}, {"topic": "affordable", "text": "California was the first in the nation to pass laws to implement President Obama’s historic Affordable Care Act.", "url": "http://www.scpr.org/news/2012/06/28/33020/us-supreme-court-ruling-moves-california-forward-p/"}, {"topic": "affordable", "text": "The ultimate costs of expanding our health care system under the Affordable Care Act are unknown.", "url": "http://www.scpr.org/news/2013/01/10/35587/governor-brown-commits-full-medical-expansion-unde/"}, {"topic": "affordable", "text": "Today I am calling for a special session to deal with those issues that must be decided quickly if California is to get the Affordable Care Act started by next January.", "url": "http://www.scpr.org/programs/take-two/2013/01/10/30030/how-will-the-ca-health-insurance-exchange-work/"}, {"topic": "authority", "text": "Subsidiarity is the idea that a central authority should only perform those tasks which cannot be performed at a more immediate or local level.", "url": ""}, {"topic": "authority", "text": "I signed the original high speed rail Authority in 1982—over 30 years ago. In 2013, we will finally break ground and start construction.", "url": "http://www.scpr.org/news/2012/01/24/30920/governor-hopes-convince-lawmakers-fund-high-speed-/"}, {"topic": "authority", "text": "My 2013 Budget Summary lays out the case for cutting categorical programs and putting maximum authority and discretion back at the local level—with school boards.", "url": "http://www.scpr.org/programs/airtalk/2013/01/10/30037/governor-brown-releases-the-state-budget/"}, {"topic": "budget", "text": "We have wrought in just two years a solid and enduring budget.", "url": ""}, {"topic": "budget", "text": "You cast difficult votes to cut billions from the state budget.", "url": ""}, {"topic": "budget", "text": "The budget is balanced but great risks and uncertainties lie ahead.", "url": ""}, {"topic": "budget", "text": "The federal government, the courts or changes in the economy all could cost us billions and drive a hole in the budget.", "url": ""}, {"topic": "budget", "text": "California is back, its budget is balanced, and we are on the move.", "url": ""}, {"topic": "budget", "text": "My 2013 Budget Summary lays out the case for cutting categorical programs and putting maximum authority and discretion back at the local level—with school boards.", "url": "http://www.scpr.org/programs/airtalk/2013/01/10/30037/governor-brown-releases-the-state-budget/"}, {"topic": "carbon", "text": "According to the latest report from the World Bank, carbon dioxide emissions are the highest in 15 million years.", "url": ""}, {"topic": "carbon", "text": "When we think about California’s future, no long term liability presents as great a danger to our wellbeing as the buildup of carbon dioxide and other greenhouse gases in the atmosphere.", "url": "http://www.scpr.org/blogs/environment/2011/05/23/2996/ab-32-cap-and-trade-pause-brown-weigh/"}, {"topic": "carbon", "text": "We are reducing emissions as required by AB 32 and we will meet our goal of getting carbon emissions to 1990 levels by 2020.", "url": "http://www.scpr.org/blogs/environment/2012/11/19/11162/californias-carbon-market-opens-air-resources-boar/"}, {"topic": "change", "text": "The federal government, the courts or changes in the economy all could cost us billions and drive a hole in the budget.", "url": ""}, {"topic": "change", "text": "The key here is thoughtful change, working with the faculty and the college presidents.", "url": ""}, {"topic": "change", "text": "Climate Change: When we think about California’s future, no long term liability presents as great a danger to our wellbeing as the buildup of carbon dioxide and other greenhouse gases in the atmosphere.", "url": ""}, {"topic": "change", "text": "This year, we should change both the Enterprise Zone Program and the Jobs Hiring Credit.", "url": "http://www.scpr.org/blogs/business-update-mark-lacter/2010/06/29/1451/what-heck-are-enterprise-zones/"}, {"topic": "child", "text": "Distant authorities crack the whip, demanding quantitative measures and a stark, single number to encapsulate the precise achievement level of every child.", "url": ""}, {"topic": "child", "text": "This formula recognizes the fact that a child in a family making $20,000 a year or speaking a language different from English or living in a foster home requires more help.", "url": "http://www.scpr.org/news/2012/01/07/30705/how-does-jerry-browns-proposed-california-budget-a/"}, {"topic": "child", "text": "Then there is the Congress which passes laws like “No Child Left Behind,” and finally the Federal Department of Education, whose rules, audits and fines reach into every classroom in America, where sixty million children study, not six million.", "url": "http://www.scpr.org/blogs/education/2013/01/04/11847/federal-officials-reject-californias-no-child-left/"}, {"topic": "children", "text": "Add to this the fact that three million California school age children speak a language at home other than English and more than two million children live in poverty.", "url": "https://projects.scpr.org/bilinguallearning/"}, {"topic": "children", "text": "Nothing is more determinative of our future than how we teach our children. If we fail at this, we will sow growing social chaos and inequality that no law can rectify.", "url": ""}, {"topic": "children", "text": "Add to this the fact that three million California school age children speak a language at home other than English and more than two million children live in poverty.", "url": "http://www.scpr.org/news/2012/01/07/30705/how-does-jerry-browns-proposed-california-budget-a/"}, {"topic": "children", "text": "We seem to think that education is a thing—like a vaccine—that can be designed from afar and simply injected into our children.", "url": ""}, {"topic": "children", "text": "Equal treatment for children in unequal situations is not justice.", "url": ""}, {"topic": "children", "text": "Then there is the Congress which passes laws like “No Child Left Behind,” and finally the Federal Department of Education, whose rules, audits and fines reach into every classroom in America, where sixty million children study, not six million.", "url": "http://www.scpr.org/programs/take-two/2013/01/08/29996/no-child-left-behind-turns-11/"}, {"topic": "china", "text": "Our ties with The People’s Republic of China in particular are deep—from the Chinese immigrants crossing the Pacific in 1848 to hosting China’s next President in Los Angeles last February.", "url": ""}, {"topic": "china", "text": "Electrified trains are part of the future. China already has 5000 miles of high speed rail and intends to double that. Spain has 1600 miles and is building more.", "url": ""}, {"topic": "china", "text": "In April, I will lead a trade and investment mission to China with help from the Bay Area Council and officially open California’s new trade and investment office in Shanghai.", "url": "http://www.scpr.org/blogs/economy/2012/03/26/5236/future-business-worlds-big-cities/"}, {"topic": "china", "text": "Our ties with The People’s Republic of China in particular are deep—from the Chinese immigrants crossing the Pacific in 1848 to hosting China’s next President in Los Angeles last February.", "url": "http://www.scpr.org/programs/take-two/2013/01/11/30047/its-not-just-chinatown-baby-chinese-visitors-top-l/"}, {"topic": "classroom", "text": "In addition to the teacher in the classroom, we have a principal in every school, a superintendent and governing board for each school district.", "url": ""}, {"topic": "classroom", "text": "Then there is the Congress which passes laws like “No Child Left Behind,” and finally the Federal Department of Education, whose rules, audits and fines reach into every classroom in America, where sixty million children study, not six million.", "url": ""}, {"topic": "classroom", "text": "I would prefer to trust our teachers who are in the classroom each day, doing the real work – lighting fires in young minds.", "url": ""}, {"topic": "colleges", "text": "Then during the Civil War under President Lincoln came the Transcontinental Railroad and Land Grant Colleges, followed by the founding of the University of California.", "url": ""}, {"topic": "colleges", "text": "The University of California, the Cal State system and the community colleges are all working on this.", "url": ""}, {"topic": "colleges", "text": "A half million fewer students this year enrolled in the community colleges than in 2008.", "url": "http://www.scpr.org/programs/brand-martinez/2012/08/29/28151/new-survey-shows-big-problems-for-states-community/"}, {"topic": "colleges", "text": "But tuition increases are not the answer. I will not let the students become the default financiers of our colleges and universities.", "url": "http://www.scpr.org/programs/patt-morrison/2011/07/11/19830/tentative-national-budget"}, {"topic": "community", "text": "I salute the teachers and the students, the parents and the college presidents, the whole school community.", "url": ""}, {"topic": "community", "text": "A half million fewer students this year enrolled in the community colleges than in 2008.", "url": ""}, {"topic": "community", "text": "The University of California, the Cal State system and the community colleges are all working on this.", "url": ""}, {"topic": "cost", "text": "The federal government, the courts or changes in the economy all could cost us billions and drive a hole in the budget.", "url": ""}, {"topic": "cost", "text": "The ultimate costs of expanding our health care system under the Affordable Care Act are unknown.", "url": ""}, {"topic": "cost", "text": "With respect to higher education, cost pressures are relentless and many students cannot get the classes they need.", "url": ""}, {"topic": "cost", "text": "Given the costs involved, great prudence should guide every step of the way.", "url": ""}, {"topic": "cost", "text": "If because of an earthquake, a hundred year storm or sea level rise, the Delta fails, the disaster would be comparable to Hurricane Katrina or Superstorm Sandy: losses of at least $100 billion and 40,000 jobs. I am going to do whatever I can to make sure that does not happen. My proposed plan is two tunnels 30 miles long and 40 feet wide, designed to improve the ecology of the Delta, with almost 100 square miles of habitat restoration. Yes, that is big but so is the problem. The London Olympics lasted a short while and cost $14 billion, about the same cost as this project. But this project will serve California for hundreds of years.", "url": "http://www.scpr.org/programs/airtalk/2012/07/25/27570/sacramento-river-pipeline-jerry-brown/"}, {"topic": "cows", "text": "Recall the story of Genesis and Pharaoh’s dream of seven cows, fatfleshed and well favored, which came out of the river, followed by seven other cows leanfleshed and ill favored. Then the lean cows ate up the fat cows. The Pharaoh could not interpret his dream until Joseph explained to him that the seven fat cows were seven years of great plenty and the seven lean cows were seven years of famine that would immediately follow. The Pharaoh took the advice of Joseph and stored up great quantities of grain during the years of plenty. When famine came, Egypt was ready.", "url": ""}, {"topic": "decade", "text": "That is how we plunged into a decade of deficits.", "url": ""}, {"topic": "decade", "text": "What we have done together and what we must do in the coming years is big, but it pales in comparison to the indomitable courage of those who discovered and each decade thereafter built a more abundant California.", "url": ""}, {"topic": "decade", "text": "It requires acting now even though the worst consequences are perhaps decades in the future.", "url": ""}, {"topic": "decade", "text": "Over the last three decades, these pioneering efforts have saved Californians $65 billion dollars.", "url": ""}, {"topic": "decade", "text": "Over the rest of this decade, California will steadily reduce the number of the uninsured.", "url": "http://www.scpr.org/blogs/news/2012/09/27/10192/uninsured-flock-la-stadium-free-health-care/"}, {"topic": "delta", "text": "Silicon Valley, the Livermore Valley, farmers on the East side of the San Joaquin Valley between Fresno and Kern County and farmers on the West side between Tracy and Los Banos, urban Southern California and Northern Contra Costa, all are critically dependent on the Delta for Water.", "url": "http://www.scpr.org/blogs/environment/2013/01/08/11894/sacramento-san-joaquin-delta-fish-dwindling/"}, {"topic": "delta", "text": "Central to the life of our state is water and one sixth of that water flows through the San Joaquin Delta.", "url": "http://www.scpr.org/programs/airtalk/2013/01/24/30222/water-tunnels-for-california/"}, {"topic": "delta", "text": "If because of an earthquake, a hundred year storm or sea level rise, the Delta fails, the disaster would be comparable to Hurricane Katrina or Superstorm Sandy: losses of at least $100 billion and 40,000 jobs.", "url": "http://www.scpr.org/programs/airtalk/2013/01/24/30222/water-tunnels-for-california/"}, {"topic": "delta", "text": "My proposed plan is two tunnels 30 miles long and 40 feet wide, designed to improve the ecology of the Delta, with almost 100 square miles of habitat restoration.", "url": "http://www.scpr.org/programs/airtalk/2013/01/24/30222/water-tunnels-for-california/"}, {"topic": "destiny", "text": "In the midst of the Great Depression, Franklin Roosevelt said: “There is a mysterious cycle in human events. To some generations much is given. Of other generations much is expected. This generation has a rendezvous with destiny.”", "url": ""}, {"topic": "destiny", "text": "We --right here in California-- have such a rendezvous with destiny.", "url": ""}, {"topic": "destiny", "text": "This special destiny never ends.", "url": ""}, {"topic": "economy", "text": "The federal government, the courts or changes in the economy all could cost us billions and drive a hole in the budget.", "url": ""}, {"topic": "economy", "text": "California’s exports are booming and our place in the world economy has never been stronger.", "url": "http://www.scpr.org/news/2012/02/16/31269/wine-exports-china-skyrocket/"}, {"topic": "education", "text": "Lay the Ten Commandments next to the California Education code and you will see how far we have diverged in approach and in content from that which forms the basis of our legal system.", "url": ""}, {"topic": "education", "text": "In the right order of things, education—the early fashioning of character and the formation of conscience—comes before legislation.", "url": ""}, {"topic": "education", "text": "Then we have the State Superintendent and the State Board of Education, which makes rules and approves endless waivers—often of laws which you just passed.", "url": ""}, {"topic": "education", "text": "Then there is the Congress which passes laws like “No Child Left Behind,” and finally the Federal Department of Education, whose rules, audits and fines reach into every classroom in America, where sixty million children study, not six million.", "url": ""}, {"topic": "education", "text": "We seem to think that education is a thing—like a vaccine—that can be designed from afar and simply injected into our children.", "url": ""}, {"topic": "education", "text": "But as the Irish poet, William Butler Yeats said, “Education is not the filling of a pail but the lighting of a fire.”", "url": ""}, {"topic": "education", "text": "This year, as you consider new education laws, I ask you to consider the principle of Subsidiarity.", "url": ""}, {"topic": "education", "text": "With respect to higher education, cost pressures are relentless and many students cannot get the classes they need.", "url": ""}, {"topic": "emissions", "text": "According to the latest report from the World Bank, carbon dioxide emissions are the highest in 15 million years.", "url": ""}, {"topic": "emissions", "text": "At today’s emissions rate, the planet could warm by more than 7 degrees Fahrenheit by the end of the century, an event unknown in human experience.", "url": ""}, {"topic": "emissions", "text": "We are reducing emissions as required by AB 32 and we will meet our goal of getting carbon emissions to 1990 levels by 2020.", "url": ""}, {"topic": "feeling", "text": "As the great jurist, Oliver Wendell Holmes, once said when describing what stirs people to action: “Feeling begets feeling and great feeling begets great feeling.” You were alarmed, you stirred yourselves to action and victory was the outcome.", "url": ""}, {"topic": "funding", "text": "It is cruel to lead people on by expanding good programs, only to cut them back when the funding disappears.", "url": ""}, {"topic": "funding", "text": "And we have a funding system that is overly complex, bureaucratically driven and deeply inequitable.", "url": ""}, {"topic": "funding", "text": "I have directed our Transportation Agency to review thoroughly our current priorities and explore long-term funding options.", "url": ""}, {"topic": "funding", "text": "I am asking you to approve a brand new Local Control Funding Formula which would distribute supplemental funds — over an extended period of time — to school districts based on the real world problems they face.", "url": "http://www.scpr.org/news/2013/01/10/35573/governor-boost-funds-public-schools-universities-s/"}, {"topic": "future", "text": "All around us we see doubt and skepticism about our future and that of America’s.", "url": ""}, {"topic": "future", "text": "But what we need to do for our future will require more than producing hundreds of new laws each year.", "url": ""}, {"topic": "future", "text": " Nothing is more determinative of our future than how we teach our children.", "url": ""}, {"topic": "future", "text": "When we think about California’s future, no long term liability presents as great a danger to our wellbeing as the buildup of carbon dioxide and other greenhouse gases in the atmosphere.", "url": ""}, {"topic": "future", "text": " It requires acting now even though the worst consequences are perhaps decades in the future.", "url": ""}, {"topic": "future", "text": "Electrified trains are part of the future.", "url": ""}, {"topic": "government", "text": "You did great things: Your 1/3 renewable energy mandate; the reform of workers compensation; the reorganization of state government; protecting our forests and strengthening our timber industry; reforming our welfare system; and launching the nation’s first high speed rail system.", "url": ""}, {"topic": "government", "text": "The federal government, the courts or changes in the economy all could cost us billions and drive a hole in the budget.", "url": ""}, {"topic": "government", "text": "Constantly expanding the coercive power of government by adding each year so many minute prescriptions to our already detailed and turgid legal system overshadows other aspects of public service.", "url": ""}, {"topic": "government", "text": "In other words, higher or more remote levels of government, like the state, should render assistance to local school districts, but always respect their primary jurisdiction and the dignity and freedom of teachers and students.", "url": ""}, {"topic": "highway", "text": "In the years following World War II, California embarked on a vast program to build highway, bridges and roads.", "url": ""}, {"topic": "highway", "text": "He retraced his steps northward, along what was to become El Camino Real, the Kings Highway.", "url": ""}, {"topic": "highway", "text": "Today, California’s highways are asked to accommodate more vehicle traffic than any other state in the nation.", "url": "http://traffic-counts.dot.ca.gov/2011all/index.html"}, {"topic": "jobs", "text": "The new facility in San Jose will place at least 2,500 people in high skill, high wage jobs.", "url": ""}, {"topic": "jobs", "text": "This year, we should change both the Enterprise Zone Program and the Jobs Hiring Credit.", "url": ""}, {"topic": "jobs", "text": "California lost 1.3 million jobs in the great Recession but we are coming back at a faster pace than the national average.", "url": "http://www.scpr.org/blogs/economy/2012/10/02/10282/why-have-americans-stopped-working/"}, {"topic": "jobs", "text": "We also leveled the field on internet sales taxes, paving the way for over 1,000 new jobs at new Amazon distribution centers in Patterson and San Bernardino and now Tracy.", "url": "http://www.scpr.org/news/2012/10/18/34670/amazon-open-business-san-bernardino/"}, {"topic": "jobs", "text": "If because of an earthquake, a hundred year storm or sea level rise, the Delta fails, the disaster would be comparable to Hurricane Katrina or Superstorm Sandy: losses of at least $100 billion and 40,000 jobs.", "url": "http://www.scpr.org/programs/airtalk/2013/01/24/30222/water-tunnels-for-california/"}, {"topic": "laws", "text": "As Legislators, It is your duty and privilege to pass laws.", "url": ""}, {"topic": "laws", "text": "But what we need to do for our future will require more than producing hundreds of new laws each year.", "url": ""}, {"topic": "laws", "text": "Montaigne, the great French writer of the 16th Century, in his Essay on Experience, wisely wrote: “There is little relation between our actions, which are in perpetual mutation, and fixed and immutable laws. The most desirable laws are those that are the rarest, simplest, and most general; and I even think that it would be better to have none at all than to have them in such numbers as we have.”", "url": ""}, {"topic": "laws", "text": "In California’s public schools, there are six million students, 300,000 teachers—all subject to tens of thousands of laws and regulations.", "url": ""}, {"topic": "laws", "text": "Then we have the State Superintendent and the State Board of Education, which makes rules and approves endless waivers—often of laws which you just passed.", "url": ""}, {"topic": "laws", "text": "Then there is the Congress which passes laws like “No Child Left Behind,” and finally the Federal Department of Education, whose rules, audits and fines reach into every classroom in America, where sixty million children study, not six million.", "url": ""}, {"topic": "laws", "text": "The laws that are in fashion demand tightly constrained curricula and reams of accountability data.", "url": ""}, {"topic": "laws", "text": "This year, as you consider new education laws, I ask you to consider the principle of Subsidiarity.", "url": ""}, {"topic": "laws", "text": "California was the first in the nation to pass laws to implement President Obama’s historic Affordable Care Act.", "url": ""}, {"topic": "level", "text": "Distant authorities crack the whip, demanding quantitative measures and a stark, single number to encapsulate the precise achievement level of every child.", "url": ""}, {"topic": "level", "text": "Subsidiarity is the idea that a central authority should only perform those tasks which cannot be performed at a more immediate or local level.", "url": ""}, {"topic": "level", "text": "In other words, higher or more remote levels of government, like the state, should render assistance to local school districts, but always respect their primary jurisdiction and the dignity and freedom of teachers and students.", "url": ""}, {"topic": "level", "text": "My 2013 Budget Summary lays out the case for cutting categorical programs and putting maximum authority and discretion back at the local level—with school boards.", "url": "http://www.ebudget.ca.gov/BudgetSummary/BSS/BSS.html"}, {"topic": "level", "text": "We also leveled the field on internet sales taxes, paving the way for over 1,000 new jobs at new Amazon distribution centers in Patterson and San Bernardino and now Tracy.", "url": "http://www.scpr.org/news/2012/10/18/34670/amazon-open-business-san-bernardino/"}, {"topic": "level", "text": "We are reducing emissions as required by AB 32 and we will meet our goal of getting carbon emissions to 1990 levels by 2020.", "url": "http://www.arb.ca.gov/cc/ab32/ab32.htm"}, {"topic": "level", "text": "If because of an earthquake, a hundred year storm or sea level rise, the Delta fails, the disaster would be comparable to Hurricane Katrina or Superstorm Sandy: losses of at least $100 billion and 40,000 jobs.", "url": "http://www.scpr.org/programs/airtalk/2013/01/24/30222/water-tunnels-for-california/"}, {"topic": "miles", "text": "Electrified trains are part of the future. China already has 5000 miles of high speed rail and intends to double that. Spain has 1600 miles and is building more.", "url": ""}, {"topic": "miles", "text": "Then we will take it through the Tehachapi Mountains to Palmdale, constructing 30 miles of tunnels and bridges. The first rail line through those mountains was built in 1874 and its top speed over the crest is still 24 miles an hour. Then we will build another 33 miles of tunnels and bridges before we get the train to its destination at Union Station in the heart of Los Angeles.", "url": ""}, {"topic": "miles", "text": "My proposed plan is two tunnels 30 miles long and 40 feet wide, designed to improve the ecology of the Delta, with almost 100 square miles of habitat restoration. Yes, that is big but so is the problem.", "url": "http://www.scpr.org/programs/airtalk/2013/01/24/30222/water-tunnels-for-california/"}, {"topic": "million", "text": "Add to this the fact that three million California school age children speak a language at home other than English and more than two million children live in poverty.", "url": "https://projects.scpr.org/bilinguallearning/"}, {"topic": "million", "text": "In California’s public schools, there are six million students, 300,000 teachers—all subject to tens of thousands of laws and regulations.", "url": ""}, {"topic": "million", "text": "Then there is the Congress which passes laws like “No Child Left Behind,” and finally the Federal Department of Education, whose rules, audits and fines reach into every classroom in America, where sixty million children study, not six million.", "url": ""}, {"topic": "million", "text": "California lost 1.3 million jobs in the great Recession but we are coming back at a faster pace than the national average.", "url": ""}, {"topic": "million", "text": "According to the latest report from the World Bank, carbon dioxide emissions are the highest in 15 million years.", "url": ""}, {"topic": "million", "text": "A half million fewer students this year enrolled in the community colleges than in 2008.", "url": "http://www.scpr.org/blogs/education/2012/09/11/9919/community-college-board-prioritizes-registering-ne/"}, {"topic": "million", "text": "Our health benefit exchange, called Covered California, will begin next year providing insurance to nearly one million Californians.", "url": "http://www.scpr.org/programs/take-two/2013/01/10/30030/how-will-the-ca-health-insurance-exchange-work/"}, {"topic": "nation", "text": "Today, California’s highways are asked to accommodate more vehicle traffic than any other state in the nation.", "url": ""}, {"topic": "nation", "text": "You did great things: Your 1/3 renewable energy mandate; the reform of workers compensation; the reorganization of state government; protecting our forests and strengthening our timber industry; reforming our welfare system; and launching the nation’s first high speed rail system.", "url": ""}, {"topic": "nation", "text": "California was the first in the nation to pass laws to implement President Obama’s historic Affordable Care Act.", "url": "http://www.scpr.org/news/2012/06/28/32918/californias-jump-healthcare-reform-means-what/"}, {"topic": "program", "text": "My 2013 Budget Summary lays out the case for cutting categorical programs and putting maximum authority and discretion back at the local level—with school boards.", "url": ""}, {"topic": "program", "text": "This year, we should change both the Enterprise Zone Program and the Jobs Hiring Credit.", "url": "http://caez.org/"}, {"topic": "program", "text": "In the years following World War II, California embarked on a vast program to build highway, bridges and roads.", "url": ""}, {"topic": "program", "text": "It is cruel to lead people on by expanding good programs, only to cut them back when the funding disappears.", "url": ""}, {"topic": "rail", "text": "You did great things: Your 1/3 renewable energy mandate; the reform of workers compensation; the reorganization of state government; protecting our forests and strengthening our timber industry; reforming our welfare system; and launching the nation’s first high speed rail system.", "url": ""}, {"topic": "rail", "text": "Last year, you authorized another big project: High Speed Rail.", "url": ""}, {"topic": "rail", "text": "China already has 5000 miles of high speed rail and intends to double that.", "url": ""}, {"topic": "rail", "text": "More than a dozen other countries have their own successful high speed rail systems.", "url": ""}, {"topic": "rail", "text": "The first rail line through those mountains was built in 1874 and its top speed over the crest is still 24 miles an hour.", "url": ""}, {"topic": "rail", "text": "I signed the original high speed rail Authority in 1982—over 30 years ago. In 2013, we will finally break ground and start construction.", "url": "http://www.cahighspeedrail.ca.gov/"}, {"topic": "renewable", "text": "You did great things: Your 1/3 renewable energy mandate; the reform of workers compensation; the reorganization of state government; protecting our forests and strengthening our timber industry; reforming our welfare system; and launching the nation’s first high speed rail system.", "url": ""}, {"topic": "renewable", "text": "We are also meeting our renewable energy goals: more than 20% renewable energy this year. By 2020, we will get at least a third of our electricity from the sun and the wind and other renewable sources—and probably more.", "url": "http://www.scpr.org/programs/airtalk/2012/12/05/29546/are-californias-alternative-energy-programs-headed/"}, {"topic": "school", "text": "I salute the teachers and the students, the parents and the college presidents, the whole school community.", "url": ""}, {"topic": "school", "text": "In California’s public schools, there are six million students, 300,000 teachers—all subject to tens of thousands of laws and regulations.", "url": ""}, {"topic": "school", "text": "In addition to the teacher in the classroom, we have a principal in every school, a superintendent and governing board for each school district.", "url": ""}, {"topic": "school", "text": "In other words, higher or more remote levels of government, like the state, should render assistance to local school districts, but always respect their primary jurisdiction and the dignity and freedom of teachers and students.", "url": ""}, {"topic": "school", "text": "I am asking you to approve a brand new Local Control Funding Formula which would distribute supplemental funds — over an extended period of time — to school districts based on the real world problems they face.", "url": "http://www.scpr.org/blogs/education/2013/01/02/11805/california-governor-propose-higher-funding-schools/"}, {"topic": "school", "text": "Add to this the fact that three million California school age children speak a language at home other than English and more than two million children live in poverty.", "url": "http://www.scpr.org/blogs/multiamerican/2012/03/19/7925/this-is-your-brain-on-a-second-language-bilinguali/"}, {"topic": "school", "text": "My 2013 Budget Summary lays out the case for cutting categorical programs and putting maximum authority and discretion back at the local level—with school boards.", "url": "http://www.scpr.org/programs/airtalk/2013/01/10/30037/governor-brown-releases-the-state-budget/"}, {"topic": "seven", "text": "Recall the story of Genesis and Pharaoh’s dream of seven cows, fatfleshed and well favored, which came out of the river, followed by seven other cows leanfleshed and ill favored. Then the lean cows ate up the fat cows. The Pharaoh could not interpret his dream until Joseph explained to him that the seven fat cows were seven years of great plenty and the seven lean cows were seven years of famine that would immediately follow. The Pharaoh took the advice of Joseph and stored up great quantities of grain during the years of plenty. When famine came, Egypt was ready. The people have given us seven years of extra taxes. Let us follow the wisdom of Joseph, pay down our debts and store up reserves against the leaner times that will surely come.", "url": ""}, {"topic": "speed", "text": "You did great things: Your 1/3 renewable energy mandate; the reform of workers compensation; the reorganization of state government; protecting our forests and strengthening our timber industry; reforming our welfare system; and launching the nation’s first high speed rail system.", "url": ""}, {"topic": "speed", "text": "Electrified trains are part of the future. China already has 5000 miles of high speed rail and intends to double that. Spain has 1600 miles and is building more. More than a dozen other countries have their own successful high speed rail systems. Even Morocco is building one.", "url": ""}, {"topic": "speed", "text": " The first rail line through those mountains was built in 1874 and its top speed over the crest is still 24 miles an hour.", "url": ""}, {"topic": "speed", "text": "It has taken great perseverance to get us this far. I signed the original high speed rail Authority in 1982—over 30 years ago. In 2013, we will finally break ground and start construction.", "url": "http://www.scpr.org/news/2012/01/24/30920/governor-hopes-convince-lawmakers-fund-high-speed-/"}, {"topic": "speed", "text": "Last year, you authorized another big project: High Speed Rail. Yes, it is bold but so is everything else about California.", "url": "http://www.scpr.org/news/2012/07/05/33117/high-speed-rail-bond-vote-nears-sacramento-democra/"}, {"topic": "students", "text": "I salute the teachers and the students, the parents and the college presidents, the whole school community.", "url": ""}, {"topic": "students", "text": "In California’s public schools, there are six million students, 300,000 teachers—all subject to tens of thousands of laws and regulations.", "url": ""}, {"topic": "students", "text": "In other words, higher or more remote levels of government, like the state, should render assistance to local school districts, but always respect their primary jurisdiction and the dignity and freedom of teachers and students.", "url": ""}, {"topic": "students", "text": "With respect to higher education, cost pressures are relentless and many students cannot get the classes they need.", "url": ""}, {"topic": "students", "text": "I will not let the students become the default financiers of our colleges and universities.", "url": ""}, {"topic": "students", "text": "A half million fewer students this year enrolled in the community colleges than in 2008.", "url": "http://www.scpr.org/blogs/education/2012/09/11/9919/community-college-board-prioritizes-registering-ne/"}, {"topic": "system", "text": "You did great things: Your 1/3 renewable energy mandate; the reform of workers compensation; the reorganization of state government; protecting our forests and strengthening our timber industry; reforming our welfare system; and launching the nation’s first high speed rail system.", "url": ""}, {"topic": "system", "text": "Constantly expanding the coercive power of government by adding each year so many minute prescriptions to our already detailed and turgid legal system overshadows other aspects of public service.", "url": ""}, {"topic": "system", "text": "Lay the Ten Commandments next to the California Education code and you will see how far we have diverged in approach and in content from that which forms the basis of our legal system.", "url": ""}, {"topic": "system", "text": "And we have a funding system that is overly complex, bureaucratically driven and deeply inequitable.", "url": ""}, {"topic": "system", "text": "Graduation in four years is the exception and transition from one segment to the other is difficult. The University of California, the Cal State system and the community colleges are all working on this.", "url": ""}, {"topic": "system", "text": "The ultimate costs of expanding our health care system under the Affordable Care Act are unknown.", "url": "http://www.scpr.org/news/2012/06/28/33018/live-q-what-do-you-want-to-know-affordable-care-ac/"}, {"topic": "taxes", "text": "The people have given us seven years of extra taxes. Let us follow the wisdom of Joseph, pay down our debts and store up reserves against the leaner times that will surely come.", "url": ""}, {"topic": "taxes", "text": "We also leveled the field on internet sales taxes, paving the way for over 1,000 new jobs at new Amazon distribution centers in Patterson and San Bernardino and now Tracy.", "url": "http://www.scpr.org/news/2012/10/18/34670/amazon-open-business-san-bernardino/"}, {"topic": "taxes", "text": "Then, the citizens of California, using their inherent political power under the Constitution, finished the task. They embraced the new taxes of Proposition 30 by a healthy margin of 55% to 44%.", "url": "http://www.scpr.org/news/2012/11/07/34851/update-prop-30/"}, {"topic": "teachers", "text": "I salute the teachers and the students, the parents and the college presidents, the whole school community. As the great jurist, Oliver Wendell Holmes, once said when describing what stirs people to action: “Feeling begets feeling and great feeling begets great feeling.” You were alarmed, you stirred yourselves to action and victory was the outcome.", "url": ""}, {"topic": "teachers", "text": "In California’s public schools, there are six million students, 300,000 teachers—all subject to tens of thousands of laws and regulations.", "url": ""}, {"topic": "teachers", "text": "In addition to the teacher in the classroom, we have a principal in every school, a superintendent and governing board for each school district.", "url": ""}, {"topic": "teachers", "text": "In other words, higher or more remote levels of government, like the state, should render assistance to local school districts, but always respect their primary jurisdiction and the dignity and freedom of teachers and students.", "url": ""}, {"topic": "teachers", "text": "I would prefer to trust our teachers who are in the classroom each day, doing the real work – lighting fires in young minds.", "url": ""}, {"topic": "tunnels", "text": "Then we will take it through the Tehachapi Mountains to Palmdale, constructing 30 miles of tunnels and bridges.", "url": "http://www.scpr.org/news/2012/07/18/33342/calif-bullet-train-faces-funding-legal-challenges/"}, {"topic": "tunnels", "text": "Then we will build another 33 miles of tunnels and bridges before we get the train to its destination at Union Station in the heart of Los Angeles.", "url": "http://www.scpr.org/news/2012/07/18/33342/calif-bullet-train-faces-funding-legal-challenges/"}, {"topic": "tunnels", "text": "My proposed plan is two tunnels 30 miles long and 40 feet wide, designed to improve the ecology of the Delta, with almost 100 square miles of habitat restoration. Yes, that is big but so is the problem.", "url": "http://www.scpr.org/programs/airtalk/2013/01/24/30222/water-tunnels-for-california/"}, {"topic": "water", "text": "And oil production, movies, an aircraft industry, the longest suspension bridge in the world, aerospace, the first freeways, grand water projects, Jet Propulsion Laboratory, Venture Capital, Silicon Valley, Hewlett Packard, Apple, Qualcomm, Google and countless others, existing and still just imagined.", "url": ""}, {"topic": "water", "text": "California is extremely vulnerable because of our Mediterranean climate, long coastline and reliance on snowpack for so much of our water supply.", "url": ""}, {"topic": "water", "text": "Central to the life of our state is water and one sixth of that water flows through the San Joaquin Delta.", "url": "http://www.scpr.org/programs/airtalk/2013/01/24/30222/water-tunnels-for-california/"}, {"topic": "water", "text": "Silicon Valley, the Livermore Valley, farmers on the East side of the San Joaquin Valley between Fresno and Kern County and farmers on the West side between Tracy and Los Banos, urban Southern California and Northern Contra Costa, all are critically dependent on the Delta for Water.", "url": "http://www.scpr.org/programs/airtalk/2013/01/24/30222/water-tunnels-for-california/"}]}
