[{"body": "California voters approve Proposition 22, defining marriage as between a man and woman only. ", "mediaurl": " /legacy/assethost/i/c6279d66601f61f740b05bd3793b5c1a/51739-wide.jpg", "readmoreurl": "http://www.latimes.com/news/local/la-me-timelinegaymarriage-2000mar8,0,5146555.story", "title": "California Proposition 22 passes by wide margin", "mediatype": "image", "caption": "Vote No on 22' signs lie scattered around The Gay and Lesbian Center in West Hollywood, Ca., March 7, 2000. ", "displaydate": "March 8", "date": "March 8, 2000", "readmoresource": ""}, {"body": "San Francisco Mayor Gavin Newsom asks the county clerk to begin issuing marriage licenses to same-sex couples who apply.", "mediaurl": "/legacy/assethost/i/fec9605fe55fc309f2431bb1bc9759e0/51569-wide.jpg", "readmoreurl": "http://www.sfgate.com/news/article/Same-sex-weddings-start-with-union-of-elderly-San-3208657.php", "title": "San Francisco Mayor OKs same sex marriage", "mediatype": "image", "caption": "Hyde Revilla (right) and her partner Dawn Revilla (second from right) standing together after applying for their marriage license at the City Hall clerk's office in San Francisco on February 17, 2004. ", "displaydate": "Feb 12", "date": "February 12, 2004", "readmoresource": ""}, {"body": "Campaign for California Families and the Proposition 22 Legal Defense Fund immediately file suit to prevent same-sex weddings in the state, and seek a restraining order to prevent the city from issuing licenses to same-sex couples. \"The unfortunate fact is that these people who think they are married may find out Tuesday they are not,\" Richard Ackerman, an attorney for Campaign for California Families, told Newsmax.", "mediaurl": "/legacy/assethost/i/279ab35fd22e580cb9b9e100f77bd7cb/51570-wide.jpg", "readmoreurl": "http://archive.newsmax.com/archives/articles/2004/2/13/141342.shtml", "title": "Conservative groups immediately sue to halt weddings", "mediatype": "image", "caption": "Robert Tyler (right) and Benjamin Bull, the attorneys representing conservative group Campaign for California Families, talk with reporters at the San Francisco Courthouse, 17 February 2004.", "displaydate": "Feb 13", "date": "February 13, 2004", "readmoresource": ""}, {"body": "Taking on Proposition 22, the city sues California, as well as conservative groups that had previously brought a suit against the city for performing same-sex marriages, for discriminating against gays and lesbians in defining marriage as between a man and woman. ", "mediaurl": "http://ww2.hdnux.com/photos/10/32/53/2206429/7/628x471.jpg", "readmoreurl": "http://www.sfgate.com/news/article/S-F-sues-over-legality-of-same-sex-marriages-2793743.php", "title": "San Francisco sues state for discrimination", "mediatype": "image", "caption": "San Francisco City Attorney Dennis Hererra (left) and Sf Chief deputy Attorney Therese Stewart answer questions for the media after they have filed a lawsuit against the State of California regarding same-sex marriages on Feb. 19 2004 in San Francisco.", "displaydate": "Feb 19", "date": "February 19, 2004", "readmoresource": ""}, {"body": "California Supreme Court orders San Francisco to stop issuing marriage licenses to same-sex couples. Nearly 4,000 weddings took place in the city while the marriages could be performed.", "mediaurl": "/legacy/assethost/i/08e955eaccd2d362e930f246943a0ff5/51740-wide.jpg", "readmoreurl": "http://www.sfgate.com/news/article/Court-halts-gay-vows-SURPRISE-RULING-Newsom-2810241.php", "title": "State supreme court stops same-sex weddings in SF", "mediatype": "image", "caption": "Tony Mason (left) and Asa Cairns take part in a march to San Francisco's City Hall to support same-sex marriage March 11, 2004 in San Francisco, California. ", "displaydate": "March 11", "date": "March 11, 2004", "readmoresource": ""}, {"body": "The California Supreme Court rules San Francisco Mayor Gavin Newsom overstepped his authority in granting marriage licenses to same sex couples in the city and declares the licenses issued by the city void.", "mediaurl": "/legacy/assethost/i/915895d9cb18d0859c3e1d89e71d476a/51741-wide.jpg", "readmoreurl": "http://www.sfgate.com/politics/article/Newsom-unbowed-by-decision-says-he-is-more-2702196.php", "title": "San Francisco marriages voided by state supreme court", "mediatype": "image", "caption": "Reaction to the ruling by the California Supreme Court on the validity of same sex marriage in San Francisco on August 12, 2004.", "displaydate": "Aug. 12", "date": "August 12, 2004", "readmoresource": ""}, {"body": "Assembly Bill 849, the first of its kind in the nation to clear a state's legislative body, grants gays and lesbians the right to marry. The bill goes to Governor Schwarzenegger for his signature. ", "mediaurl": "/legacy/assethost/i/f8b90bfc0b5f16f1cbe4c6177a841723/51742-wide.jpg", "readmoreurl": "http://www.sfgate.com/news/article/Gay-marriage-up-to-governor-now-Landmark-2610923.php", "title": "California Senate passes bill recognizing gay marriage", "mediatype": "image", "caption": "California Assemblyman Mark Leno (D-San Francisco) speaks during a marriage equality rally on Capitol Hill October 11, 2004 in Washington, DC. ", "displaydate": "Sept. 7", "date": "September 7, 2005", "readmoresource": ""}, {"body": "Governor Schwarzenegger vetoes AB 849, saying that legislators should await the state Supreme Court decision on Proposition 22, the voter-backed initiative defining marriage as between opposite sex couples only.", "mediaurl": "/legacy/assethost/i/8cce595611c503078b3c9a0c9a7ac6b7/17919-wide.jpg", "readmoreurl": "http://www.latimes.com/news/local/la-me-timelinegaymarriage-2005sep30,0,5154578.story", "title": "Schwarzenegger vetoes gay marriage bill ", "mediatype": "image", "caption": "", "displaydate": "Sept. 30", "date": "September 30, 2005", "readmoresource": ""}, {"body": "In a 4-3 ruling, the California Supreme Court strikes down state Proposition 22, which had defined marriage as between a man and woman only. The court said the gay marriage ban violated the state's constitution and \"the right of an individual to establish a legally recognized family with the person of one's choice.\" Same-sex marriages are legally performed throughout the state.", "mediaurl": "/legacy/assethost/i/075ebeccf395f8b8c4237a9b1a8f0818/38476-wide.jpg", "readmoreurl": "http://www.sfgate.com/bayarea/article/State-s-top-court-strikes-down-marriage-ban-3213394.php", "title": "California Supreme Court strikes gay marriage ban", "mediatype": "image", "caption": "The seal on the California Supreme Court building.", "displaydate": "May 15", "date": "May 15, 2008", "readmoresource": ""}, {"body": "California Supreme Court justices uphold the legality of voter-backed Proposition 8, but also uphold the legality of the nearly 4,000 weddings performed in San Francisco while the city was issuing licenses.", "mediaurl": "", "readmoreurl": "http://www.latimes.com/news/local/prop-8/la-me-timelinegaymarriage-2008nov20,0,5248887.story", "title": "State supreme court upholds Prop 8, and same-sex marriages performed while legal", "mediatype": "", "caption": "", "displaydate": "May 26", "date": "May 26, 2009", "readmoresource": ""}, {"body": "Opening up a new front, two lawyers file a challenge to Proposition 8 in federal court. Lawyers had declined to bring the case to federal court in the past because of concerns that federal judges would be likely to be more conservative. ", "mediaurl": "", "readmoreurl": "http://latimesblogs.latimes.com/lanow/2009/05/new-front-in-prop-8-battle-launched-today-with-federal-suit.html", "title": "Gay marriage advocates challenge Prop 8 in federal court", "mediatype": "", "caption": "", "displaydate": "May 27", "date": "May 27, 2009", "readmoresource": ""}, {"body": "Prop 8, which amends the state constitution to state that \"only marriage between a man and a woman is valid or recognized in California,\" passes by a narrow margin.", "mediaurl": "/legacy/assethost/i/5626239e0bbf2c703131ce0550a567a8/51623-wide.jpg", "readmoreurl": "http://www.mercurynews.com/ci_10901475", "title": "California Proposition 8 passes, defining marriage between a man and woman", "mediatype": "image", "caption": "San Diego Mayor Jerry Sanders speaks to members of the gay and lesbian community during a Proposition 8 opposition rally at the San Diego Lesbian Gay Bisexual Transgender Community Center November 5, 2008 in San Diego, California.  ", "displaydate": "Nov. 5", "date": "November 5, 2008", "readmoresource": ""}, {"body": "The California Supreme Court agrees to review legal challenges to the newly-passed voter initiative to prevent same-sex marriages in California.", "mediaurl": "", "readmoreurl": "http://www.latimes.com/news/local/prop-8/la-me-timelinegaymarriage-2008nov20,0,5248887.story", "title": "California Supreme Court to look at challenges to Prop 8", "mediatype": "", "caption": "", "displaydate": "Nov. 19", "date": "November 19, 2008", "readmoresource": ""}, {"body": "Governor Schwarzenegger's filing: “In a constitutional democracy, it is the role of the courts to determine and resolve such questions. … The Administration encourages the Court to resolve the merits of this action expeditiously.” Attorney General Jerry Brown’s filing: “Taking from same-sex couples the right to civil marriage that they had previously possessed under California’s Constitution cannot be squared with guarantees of the Fourteenth Amendment.”", "mediaurl": "/legacy/assethost/i/c634f731597a3297aba1cb877b61e8ec/51738-wide.jpg", "readmoreurl": "http://articles.latimes.com/2009/jun/18/local/me-gay-marriage18", "title": "Governor Schwarzenegger, Attorney General Brown refuse to defend Prop 8 ", "mediatype": "image", "caption": "Cameras follow actor Arnold Schwarzenegger as he enters the Los Angeles Unified School District board meeting October 8, 2002 in Los Angeles, California. ", "displaydate": "June 12", "date": "June 12, 2009", "readmoresource": ""}, {"body": "Chief U.S. District Judge Judge Vaughn Walker rules Proposition 8 is unconstitutional under both the due-process and equal-protection\" clauses. ", "mediaurl": "/legacy/assethost/i/a89ee9ee7c507ed32922df860a17d65d/5172-four.jpg", "readmoreurl": "http://www.scpr.org/news/2010/08/04/18015/judge-rules-prop-8-unconstitutional/", "title": "Federal judge rules Proposition 8 unconstitutional", "mediatype": "image", "caption": "Mark Hiebert holds his 4-year-old son, Logan, while his 6-year-old daughter Amira waves a rainbow flag at West Hollywood Park.", "displaydate": "Aug. 4", "date": "August 4, 2010", "readmoresource": ""}, {"body": "Sponsors of California's same-sex marriage ban file motion arguing that federal judge Vaughn Walker, who struck down Proposition 8, should have recused himself as someone who was in a long-term relationship with another man. They call on a federal judge to vacate Walker's ruling.", "mediaurl": "/legacy/assethost/i/29717d1e72d8e3b63d6003ecdbe5e460/9050-four.jpg", "readmoreurl": "http://www.scpr.org/news/2011/04/25/26142/judges-partner-cited-prop-8-case/", "title": "Prop 8 backers file motion to overturn ruling based on judge's admission he is gay", "mediatype": "image", "caption": "Chief District Judge Vaughn R. Walker of the Northern District of California, speaks at a legal conference in Seattle on Friday Nov. 19, 2010.", "displaydate": "April 25", "date": "April 25, 2011", "readmoresource": ""}, {"body": "Federal judge James Ware concludes Walker had no obligation to reveal his relationship or recuse himself from the case challenging Prop 8’s constitutionality. Ware compared forcing a gay judge off a case about same-sex marriage to forcing minority judges off “most if not all” civil rights cases. ", "mediaurl": "/legacy/assethost/i/53f5d61bf989f073d3dd6b242880b580/51745-wide.jpg", "readmoreurl": "", "title": "Federal judge upholds Walker's ruling striking down Prop 8", "mediatype": "image", "caption": "", "displaydate": "June 14", "date": "June 14, 2011", "readmoresource": ""}, {"body": "The U.S. Ninth Circuit Court of Appeals declares California's voter-approved ban on same-sex marriage unconstitutional in a 2-1 decision. A stay on same-sex marriages in the state remains in place.", "mediaurl": "/legacy/assethost/i/9a3fe4c299c7e09bd7c0521661d29f1f/33489-wide.jpg", "readmoreurl": "http://www.scpr.org/news/2012/02/07/31158/prop-8-ruling-unconstitutional/", "title": "Federal Appeals Court upholds ruling against Prop 8 ", "mediatype": "image", "caption": "Frank Capley-Alfano (left) and Joe Capley-Alfano kiss as they celebrate outside of San Francisco City Hall on February 7, 2012 in San Francisco, California. ", "displaydate": "Feb 7", "date": "February 7, 2012", "readmoresource": ""}, {"body": "The U.S. Supreme Court is asked to weigh in on the Prop 8 decision. ", "mediaurl": "/legacy/assethost/i/d6266de1e885804456427f28e34e0765/51744-wide.jpg", "readmoreurl": "http://www.scpr.org/news/2012/07/31/33554/prop-8-backers-call-supreme-court-rule-gay-marriag/", "title": "Prop 8 backers call on Supreme Court to rule on gay marriage", "mediatype": "image", "caption": "Same-sex marriage proponent Kat McGuckin of Oaklyn, New Jersey, holds a gay marriage pride flag while standing in front of the Supreme Court November 30, 2012 in Washington, DC.", "displaydate": "July 31", "date": "July 31, 2012", "readmoresource": ""}, {"body": "The U.S. Supreme Court decides to take up Proposition 8, California's voter-approved ban against same-sex marriage and announce they will also consider whether Prop 8 backers have legal standing to bring the case.", "mediaurl": "/legacy/assethost/i/9cd2f3a417d790e7832f26f49529bf6d/51818-lead.jpg", "readmoreurl": "http://www.scpr.org/news/2012/12/07/35165/us-supreme-court-prop-8-same-sex-marriage/", "title": "US Supreme Court takes up Prop 8 ", "mediatype": "image", "caption": "The U.S. Supreme Court building is draped in a photo-realistic sheet during a repair and preservation project December 7, 2012, 2012 in Washington, DC. ", "displaydate": "Dec. 7", "date": "December 7, 2012", "readmoresource": ""}, {"body": "The Obama administration urges the Supreme Court to strike down California's voter-approved ban on gay marriage, Proposition 8.", "mediaurl": "/legacy/assethost/i/9f4024e95c1518f4a3ed70275bf1173e/43873-lead.jpg", "readmoreurl": "http://www.scpr.org/news/2013/02/28/36172/obama-administration-to-urge-supreme-court-to-over/", "title": "Obama administration files amicus brief urging Supreme Court to reject Prop 8", "mediatype": "image", "caption": "The U.S. Supreme Court building as seen from the U.S. Captiol June 27, 2012 in Washington, DC.", "displaydate": "Feb. 8", "date": "February 8, 2013", "readmoresource": ""}, {"body": "The U.S. Supreme Court strikes down the Defense of Marriage Act and ruled that the appellants in California's Proposition 8 did not have standing to bring the case. Governor Jerry Brown and Attorney General Kamala Harris ask that the stay on gay marriage be lifted as soon as possible.", "mediaurl": "/legacy/assethost/i/d33ab4e31aee2a2f7b3c8c901ab40440/63600-lead.jpg", "readmoreurl": "http://www.scpr.org/news/2013/06/26/37933/live-blog-supreme-court-to-rule-on-prop-8-doma/", "title": "Supreme Court strikes down DOMA; Dismisses Prop 8", "mediatype": "image", "caption": "Patrons at the West Hollywood gay bar The Abbey embrace as news breaks that the Defense of Marriage Act has been struck down.", "displaydate": "June 26", "date": "June 26, 2013", "readmoresource": ""}, {"body": "The Ninth Circuit Court of Appeals lifts its stay on gay marriages. Governor Jerry Brown directs counties to begin issuing marriage licenses to same-sex couples immediately. Weddings are held at Los Angeles and San Francsico city halls. ", "mediaurl": "/legacy/assethost/i/f27053eb4fbfc90de144b61a6590d702/63835-eight.jpg", "readmoreurl": "http://www.scpr.org/news/2013/06/28/37970/appeals-court-lifts-stay-on-gay-marriages-in-calif/", "title": "9th Circuit lifts its stay on gay marriage; LA and San Francisco immediately resume weddings", "mediatype": "image", "caption": "Paul Katami and Jeff Zarrillo, plaintiffs in the Supreme Court case that overturned California's same-sex marriage ban, became the first gay couple to wed in Los Angeles since 2008 on Friday at City Hall. Outgoing Mayor Antonio Villaraigosa officiated the ceremony.", "displaydate": "June 28", "date": "June 28, 2013", "readmoresource": ""}, {"body": "As City Hall continues same-sex weddings over the weekend in San Francisco, the backers of back Proposition 8 ask the Supreme Court to reinstate the stay as they prepare to ask the court to reconsider its decision. ", "mediaurl": "/legacy/assethost/i/5b2ff01fcbf2766be69ac42bc4e94acf/63849-eight.jpg", "readmoreurl": "", "title": "Prop 8 backers file emergency motion to halt weddings", "mediatype": "image", "caption": "Supporters of Proposition 8 demonstrate in front of the U.S. Supreme Court on March 26, 2013 in Washington, DC. ", "displaydate": "June 29", "date": "June 29, 2013", "readmoresource": ""}, {"body": "Justice Kennedy rejects emergency motion to halt gay weddings in California without comment.", "mediaurl": "/legacy/assethost/i/2cd28b31831e1b76c8a18b91b25f5623/63678-eight.jpg", "readmoreurl": "http://www.scpr.org/news/2013/06/30/37982/supreme-court-rejects-call-to-halt-gay-marriages-i/", "title": "Justice Kennedy rejects call to halt weddings", "mediatype": "image", "caption": "Rainbow flags line the courtyard at San Francisco's City Hall building on June 26, 2012. ", "displaydate": "June 30", "date": "June 30, 2013", "readmoresource": ""}, {"body": "The group that sponsored the 2008 ballot measure banning gay marriage in the state files a petition asking the California Supreme Court to order clerks throughout California to stop issuing marriage licenses to same-sex couples.", "mediaurl": "/legacy/assethost/i/27b2da494053b419658ede1ee364e5b7/5140-eight.jpg", "readmoreurl": "http://www.scpr.org/news/2013/07/12/38155/gay-marriage-opponents-ask-california-supreme-cour/", "title": "Gay marriage opponents ask California Supreme Court to deny licenses", "mediatype": "image", "caption": "Prop 8 supporters Nadia Chayka (L) and her fiance Luke Otterstad (C) stand next to Prop 8 opponent Billy Radford as they stand outside of the Philip Burton Federal building August 4, 2010 in San Francisco, California.", "displaydate": "July 12", "date": "July 12,2013", "readmoresource": ""}, {"body": "The California Supreme Court issues an order denying the request by backers of the state's same-sex marriage ban for an emergency order that would have required the state to keep enforcing a voter-approved ban on same-sex marriages.", "mediaurl": "/legacy/assethost/i/46ee7f2d12ac69192c3100f80386dd6a/63936-eight.jpg", "readmoreurl": "http://www.scpr.org/news/2013/07/12/38155/gay-marriage-opponents-ask-california-supreme-cour/", "title": "California Supreme Court declines to stop gay marriages", "mediatype": "image", "caption": "A couple gets married in West Hollywood, Calif. on July 1st, 2013\n", "displaydate": "Jul 15", "date": "July 15, 2013", "readmoresource": ""}]
