{"objects": [{"viewonsyria": "\"As the author of the Syria Accountability Act, which raised deep concerns about Syria's chemical weapons program, I believe those who used these horrific weapons to cause so much human suffering must be held accountable.\"", "firstname": "Barbara", "district": "California", "source": "", "lastname": "Boxer", "imageurl": "http://a.scpr.org/i/7fa2ec4d317dc35efad1109dcf87bd5f/54550-wide.jpg", "caption": "U.S. Senator Barbara Boxer - (D-California)", "sourceurl": "", "party": "D", "position": "Sen.", "fullname": "Barbara Boxer"}, {"viewonsyria": "\"I listened carefully to what Secretary Kerry had to say and believe his remarks should stir the conscience of the world. He pointed out the high confidence our government has that this was a chemical weapons attack, that it was directed by the Assad regime and that it killed 1,429 people, including at least 426 children.\n\n\"The unclassified intelligence assessment released today tracks closely with briefings I have received over the past week. I agree with Secretary Kerry that the world cannot let such a heinous attack pass without a meaningful response, and I hope the international community will take appropriate action.\"", "firstname": "Dianne", "district": "Sen", "source": "Press Release", "lastname": "Feinstein", "imageurl": "http://a.scpr.org/i/09c690ebd714f0ea64794e7e60903a01/54558-wide.jpg", "caption": "U.S. Senator Dianne Feinstein - (D-California)", "sourceurl": "http://www.feinstein.senate.gov/public/index.cfm/press-releases?ID=2edba615-6490-4f82-a43c-642a81a0364f", "party": "D", "position": "Sen.", "fullname": "Dianne Feinstein"}, {"viewonsyria": "", "firstname": "Karen", "district": "Los Angeles", "source": "", "lastname": "Bass", "imageurl": "http://a.scpr.org/i/3ee347387ef2978f9365d85bc1d86d1e/54579-wide.jpg", "caption": "Congresswoman Karen Bass - (D-LA)", "sourceurl": "", "party": "D", "position": "Rep.", "fullname": "Karen Bass"}, {"viewonsyria": "UPDATED STATEMENT: “In announcing today that he would seek Congressional approval for a targeted, strategic military strike on the Syrian government, President Obama is doing what's right for America and for the people who believe in what our nation stands for.  Americans deserve and expect open and transparent governance, particularly when decisions of life and death are at stake.  Congress will now have a chance to debate the President's call to action, and the evidence and rationale behind it.  Let us now be up to the task as we prepare for that vote.”\n\nORIGINAL STATEMENT: “The use of chemical weapons is immoral and an unmistakably heinous crime under international law.  \nA perpetrator of such a barbarous act must be held accountable, otherwise the civilized world gives license to such crimes against humanity.  \n \nWhat America does in response to the mass killings in Syria depends, for me, on the answer to two questions:\n \nFirst, do we have compelling, uncontroverted evidence that chemical weapons were used and who was responsible?\n \nSecond, absent formal Congressional approval or United Nations authorization, is the proposed response targeted and strategic, aimed at deterring future outlaw behavior?\n \nIf the answer is yes to both questions, then I believe the President, after meaningful consultation with Congress, may act in defense of humanity and civilized nations.  Inaction in the face of strong evidence of mass killings from the unconscionable use of chemical weapons would be morally irresponsible.  But, what would be as wrong and indefensible as inaction would be a response, under these circumstances, that goes beyond legitimately seeking to deter the criminal behavior.  \n \nLike all Americans, I am looking for answers, and in particular, for answers to the two crucial questions that I believe determine what America can and should do.  President Obama has a tough job and some tough decisions ahead of him. I believe the President, working with our nation's leaders and best advisers, will do what's right for America and for the people who believe in what America stands for.”", "firstname": "Xavier", "district": "Los Angeles", "source": "Press releases", "lastname": "Becerra", "imageurl": "http://a.scpr.org/i/79c79633804a925228f00fd1aa7136e2/54596-wide.jpg", "caption": "Congressman Xavier Becerra - (D-LA)", "sourceurl": "", "party": "D", "position": "Rep.", "fullname": "Xavier Becerra"}, {"viewonsyria": "\"Has been briefed; no statement at this time.\" - spokesperson from Ami Bera's office. ", "firstname": "Ami", "district": "Sacramento", "source": "", "lastname": "Bera", "imageurl": "http://a.scpr.org/i/f036f51e514ea2d99bdad1e58e09eb27/54548-wide.jpg", "caption": "Congressman Ami Bera - (D-Sacramento)", "sourceurl": "", "party": "D", "position": "Rep.", "fullname": "Ami Bera"}, {"viewonsyria": "", "firstname": "Julia", "district": "Ventura", "source": "", "lastname": "Brownley", "imageurl": "http://a.scpr.org/i/3f38355a9c7dcee8ff2ba837190fe908/54578-wide.jpg", "caption": "Congresswoman Julia Brownley - (D-Ventura)", "sourceurl": "", "party": "D", "position": "Rep.", "fullname": "Julia Brownley"}, {"viewonsyria": "", "firstname": "Ken", "district": "Riverside", "source": "", "lastname": "Calvert", "imageurl": "http://a.scpr.org/i/5c00f39554b87f7bd39f3cdf187fbc97/54581-wide.jpg", "caption": "Congressman Ken Calvert - (R-Riverside)", "sourceurl": "", "party": "R", "position": "Rep.", "fullname": "Ken Calvert"}, {"viewonsyria": "\"Any potential military action could have the consequence of expanding into a much wider conflict and is not warranted by U.S. foreign policy interests. We should stay out of it.\"", "firstname": "John", "district": "Irvine", "source": "", "lastname": "Campbell", "imageurl": "http://a.scpr.org/i/80b1d143c32e43513fd0e0a28738be04/54577-wide.jpg", "caption": "Congressman John Campbell - (R-Irvine)", "sourceurl": "", "party": "R", "position": "Rep.", "fullname": "John Campbell"}, {"viewonsyria": "", "firstname": "Lois", "district": "Santa Barbara", "source": "", "lastname": "Capps", "imageurl": "http://a.scpr.org/i/a92aee5fd6f204ce2cbd8869b3df5a54/54583-wide.jpg", "caption": "Congresswoman Lois Capps - (D-Santa Barbara)", "sourceurl": "", "party": "D", "position": "Rep.", "fullname": "Lois Capps"}, {"viewonsyria": "I stand ready to return to Washington immediately, should President Obama call for us to come back into session. I look forward to hearing and analyzing all the intelligence and evidence, having a robust debate, and coming to a conclusion on the issue.", "firstname": "Tony", "district": "North Hollywood, Sun Valley", "source": "", "lastname": "Cardenas", "imageurl": "http://a.scpr.org/i/ad4fc5e07d392a3ed73d09a18c30d383/54600-wide.jpg", "caption": "Congressman Tony Cardenas - (D-North Hollywood, Sun Valley)", "sourceurl": "", "party": "D", "position": "Rep.", "fullname": "Tony Cardenas"}, {"viewonsyria": "I am outraged by the actions the Syrian government took in killing 1,429 people in the chemical weapons attack, including at least 426 children, and my thoughts are with the families of those victims. At the same time, I believe that Congress should be consulted before any action takes place. In fact, before weighing the use of military force, Congress must fully debate and consider the facts and every alternative - as well as determine how best to end the violence and protect civilians.", "firstname": "Judy", "district": "El Monte", "source": "Interview with KPCC", "lastname": "Chu", "imageurl": "http://a.scpr.org/i/fd1c480643e245f27da27f42b394eb1e/54576-wide.jpg", "caption": "Congresswoman Judy Chu - (D-El Monte)", "sourceurl": "", "party": "D", "position": "Rep.", "fullname": "Judy Chu"}, {"viewonsyria": "", "firstname": "Paul", "district": "Barstow", "source": "", "lastname": "Cook", "imageurl": "http://a.scpr.org/i/c8728234b0f74399f7d839223a7db51c/54590-wide.jpg", "caption": "Congressman Paul Cook - (R-Barstow)", "sourceurl": "", "party": "R", "position": "Rep.", "fullname": "Paul Cook"}, {"viewonsyria": "\"Evidence is mounting that the Syrian government has committed a heinous \nact against innocent men, women, and children. As the investigation \ncontinues to unfold, I am following this situation closely and hope \nthat Congress will be consulted before any action is taken. If a \nmilitary response is necessary, it must be a limited, coordinated \nresponse from an international coalition. The ultimate resolution to \nthis is and must be a political solution, not a military one.\"\n\n", "firstname": "Jim", "district": "Fresno", "source": "", "lastname": "Costa", "imageurl": "http://a.scpr.org/i/51022a0fbd89bb9fa725993d01646f6d/54573-wide.jpg", "caption": "Congressman Jim Costa  - (D-Fresno)", "sourceurl": "", "party": "D", "position": "Rep.", "fullname": "Jim Costa "}, {"viewonsyria": "Susan Davis, who was not available for comment, told KPBS: \"We do know that we have UN inspectors on the ground,\" she said. \"That is important and yet we are still kind of waiting for some of those assessments. Certainly the president is working with the international community.\"\n\nDavis said the issue was not something U.S. should take on alone.\n\n\"That is not where we want to be. At the same time, it's not clear what happens down the line,\" she said. \"I just think it is very hard for it to be a limited strike.\"", "firstname": "Susan", "district": "San Diego", "source": "KPBS", "lastname": "Davis", "imageurl": "http://a.scpr.org/i/1dbdab2378e28ab9926d1f8f32b64206/54594-wide.jpg", "caption": "Congresswoman Susan Davis - (D-San Diego)", "sourceurl": "http://www.kpbs.org/news/2013/aug/27/rep-susan-davis-discusses-syria-sequestration-immi/", "party": "D", "position": "Rep", "fullname": "Susan Davis"}, {"viewonsyria": "", "firstname": "Jeff", "district": "Fresno", "source": "", "lastname": "Denham", "imageurl": "http://a.scpr.org/i/51bf14333cc5d689a95fc348c1aa29f0/54571-wide.jpg", "caption": "Congressman Jeff Denham - (R-Fresno)", "sourceurl": "", "party": "R", "position": "Rep.", "fullname": "Jeff Denham"}, {"viewonsyria": "Made in conjunction with Rep. Lofgren: \"We welcome the opportunity to listen to the facts of this matter in the most public forum. While a review of the evidence, both classified and unclassified, as to the use of chemical is important, we are already inclined to believe that these horrific weapons were used based on public and social media accounts. We believe that the question before the U.S. Congress is not “can the Obama Administration prove that the Syrian government used chemical weapons?” Rather, the paramount question is, if that is true, “what is the best course for the United States to take, and why?”", "firstname": "Anna", "district": "Palo Alto", "source": "Press Release", "lastname": "Eshoo", "imageurl": "http://a.scpr.org/i/705804ea1579455f3a999ddac15874cd/54549-wide.jpg", "caption": "Congresswoman Anna Eshoo - (D-Palo Alto)", "sourceurl": "", "party": "D", "position": "Rep.", "fullname": "Anna Eshoo"}, {"viewonsyria": "From KSBW: Congressman Sam Farr thinks that the US should not go to war again in the Middle East, but also says from a humanitarian standpoint that we should not sit idle as atrocities continue in the ongoing civil war in Syria.\n\n\"I think syria is a huge dilemna for the US congress, and for people of this country, because we don't to go to war again, we've done that in the middle east,\" Farr said. \n\nFarr, who was in Salinas Tuesday, told KSBW that he's not ready to send US troops to Syria.", "firstname": "Sam", "district": "Santa Cruz", "source": "KSBW", "lastname": "Farr", "imageurl": "http://a.scpr.org/i/9ffdfd15b288cf4ce76a9ab266ae6683/54592-wide.jpg", "caption": "Congressman Sam Farr - (D-Santa Cruz)", "sourceurl": "http://www.ksbw.com/news/central-california/Rep-Sam-Farr-US-should-not-go-to-war-in-Syria/-/5737870/21676136/-/y7xe67/-/index.html", "party": "D", "position": "Rep.", "fullname": "Sam Farr"}, {"viewonsyria": "“There is no greater decision for a country to make than the decision to go to war. For that reason, the President has the responsibility to seek authorization from our nation’s elected leaders before initiating military action. Our leaders in Congress have a similar responsibility to the American people to demand this constitutionally-required authority and to evaluate any potential U.S. military intervention abroad. The past decade has amply demonstrated the folly of military commitments poorly conceived. Our brave men and women in uniform deserve better. The American people deserve a full explanation of the situation, the pending action, the strategic goal, and the potential outcomes.\"\n", "firstname": "John", "district": "Walnut Creek", "source": "Press Release", "lastname": "Garamendi", "imageurl": "http://a.scpr.org/i/83d2b8caefccf37645d342eb924074a8/54574-wide.jpg", "caption": "Congressman John Garamendi - (D-Walnut Creek)", "sourceurl": "http://garamendi.house.gov/press-release/administration-considers-attack-syria-congressmen-garamendi-jones-send-bipartisan", "party": "D", "position": "Rep.", "fullname": "John Garamendi"}, {"viewonsyria": "", "firstname": "Janice", "district": "San Pedro", "source": "", "lastname": "Hahn", "imageurl": "http://a.scpr.org/i/63daecf2103870bb4a3b65ab9c00d4e7/54601-lead.jpg", "caption": "Congressman Janice Hahn - (D-San Pedro)", "sourceurl": "", "party": "D", "position": "Rep.", "fullname": "Janice Hahn"}, {"viewonsyria": "", "firstname": "Mike", "district": "San Jose", "source": "", "lastname": "Honda", "imageurl": "http://a.scpr.org/i/a0c48f716f843ebe6aecf5f34f0aa327/54587-wide.jpg", "caption": "Congressman Mike Honda - (D-San Jose)", "sourceurl": "", "party": "D", "position": "Rep.", "fullname": "Mike Honda"}, {"viewonsyria": "I am disgusted and outraged by the use of chemical weapons in Syria, apparently at the hands of the Assad regime. President Assad must be held accountable for any use of chemical weapons, but the United States must not repeat past mistakes by launching a military ‘response’ to something that has yet to be verified. President Obama should consult with, and seek approval from Congress before using American military force, and ensure that any action by the United States is appropriate, legitimate, and carefully limited to prevent our country from becoming militarily entangled in this complex sectarian conflict.", "firstname": "Jared", "district": "San Rafael", "source": "Press Release", "lastname": "Huffman", "imageurl": "http://a.scpr.org/i/cdd375f352c67bfb6c75c2574c577588/54569-wide.jpg", "caption": "Congressman Jared Huffman - (D-San Rafael)", "sourceurl": "http://huffman.house.gov/media-center/press-releases/huffman-to-white-house-consult-congress-before-any-military-engagement", "party": "D", "position": "Rep.", "fullname": "Jared Huffman"}, {"viewonsyria": "Via a spokesman: \"There's a difference between sustained operations requiring debate and approval, and authority granted to the commander-in-chief by law that ensures the element of surprise and strategic value.\"", "firstname": "Duncan", "district": "El Cajon", "source": "Spokesman", "lastname": "Hunter", "imageurl": "http://a.scpr.org/i/4f84a47b400c3cb0751132557b3d0a9c/54560-wide.jpg", "caption": "Congressman Duncan Hunter - (R-El Cajon)", "sourceurl": "", "party": "R", "position": "Rep.", "fullname": "Duncan Hunter"}, {"viewonsyria": "", "firstname": "Darrell", "district": "Vista", "source": "", "lastname": "Issa", "imageurl": "http://a.scpr.org/i/6b3c6712bbbb095febdf8c2daa21a3d9/54557-wide.jpg", "caption": "Congressman Darrell Issa - (R-Vista)", "sourceurl": "", "party": "R", "position": "Rep.", "fullname": "Darrell Issa"}, {"viewonsyria": "\"The crisis in Syria does not directly threaten our nation and should receive careful consideration by Congress prior to any military involvement.\"", "firstname": "Doug", "district": "Redding", "source": "", "lastname": "LaMalfa", "imageurl": "http://a.scpr.org/i/3f97d3eb5edda9855920f9d41910fb28/54561-wide.jpg", "caption": "Congressman Doug LaMalfa - (R-Redding)", "sourceurl": "", "party": "R", "position": "Rep.", "fullname": "Doug LaMalfa"}, {"viewonsyria": "From Politico: \"Rep. Barbara Lee (D-Calif.) on Wednesday circulated a letter among liberal Democrats - 12 have signed on so far - that asked Obama to “seek an affirmative decision of Congress prior to committing any U.S. military engagement to this complex crisis.\"Let’s be clear that the letter is calling for a specific action: debate,” said Lee, a former co-chairwoman of the Congressional Progressive Caucus. “Congress must assert our authority on this issue; that’s a bipartisan cause.", "firstname": "Barbara", "district": "Oakland", "source": "Politico", "lastname": "Lee", "imageurl": "http://a.scpr.org/i/6ec1cc8b4e6bcbca5b4d075b595d1d3d/54551-wide.jpg", "caption": "Congreswoman Barbara Lee - (D-Oakland)", "sourceurl": "http://www.politico.com/story/2013/08/syria-anti-war-democrats-96008.html", "party": "D", "position": "Rep.", "fullname": "Barbara Lee"}, {"viewonsyria": "\"When President Obama tells us that he has not yet made a \"decision\" on whether the U.S. military will commence hostilities with Syria, he has misunderstood his authority. As Constitutional scholars have said, including Mr. Obama himself when he was running for his office, the President should understand that it is not his decision alone to make. He is required to obtain the consent of the U.S. Congress before he engages in hostilities with Syria. To commence hostilities without statutory authorization from Congress violates the War Powers Resolution of 1973 and the United States Constitution. To argue that dropping bombs on another country for a short period of time is not an act of war is foolishness.\n\nInternationally his footing is equally perilous. Without a resolution from the UN Security Council, and in the face of a request from the UN that no action commence until a full report from UN inspectors is received, America cannot commence hostilities with Syria while remaining within the bounds of international law.\n\nThe Obama administration says we must act to defend \"international norms.\" But how can we defend international norms by breaking international law?\n\nFor the President to act without Congressional authorization, without UN approval, without the support of the Arab League, and without our closest ally Great Britain, would be a serious error. The debate on the wisdom of military action, and what form it might take should we choose that option, remains to be had in the Congress of the United States, and in the context of the wishes of the American people. President Obama must not rush to action without allowing our American democracy and Constitutional system to function.\n\nLike many Members of Congress, I doubt the wisdom of initiating further hostilities in the Middle East. However, like all Members, I will approach that debate with an open mind, listen to the President, and then join with my colleagues in exercising our Constitutional and statutory authority over matters of war and peace. Only after such a debate, and only with the approval of both houses of Congress, could the President legitimately proceed.\"", "firstname": "Zoe", "district": "San Jose", "source": "", "lastname": "Lofgren", "imageurl": "http://a.scpr.org/i/7f5dc9362f2f29325ce012439d36fef8/54597-wide.jpg", "caption": "Congresswoman Zoe Lofgren - (D-San Jose)", "sourceurl": "http://lofgren.house.gov/index.php?option=com_content&view=article&id=827&Itemid=130", "party": "D", "position": "Rep.", "fullname": "Zoe Lofgren"}, {"viewonsyria": "", "firstname": "Alan", "district": "Long Beach", "source": "", "lastname": "Lowenthal", "imageurl": "http://a.scpr.org/i/7acbfa2dd4d5410522d0aecfaef99f74/54547-wide.jpg", "caption": "Congressman Alan Lowenthal - (D-Long Beach)", "sourceurl": "", "party": "D", "position": "Rep", "fullname": "Alan Lowenthal"}, {"viewonsyria": "“The evidence is apparent: the Syrian government has used chemical weapons against its own people in blatant and horrific violation of international law, human rights, and moral decency.  I join my colleagues, the international community and the American people in strongly condemning the horrific acts the Assad regime propagated against its own people. \n“The decision to take military action can never be taken lightly.  It is imperative that the Administration presents a strong, clear case to the American public, and provides specifics to Congress before any action is taken.  I was pleased that Secretary Kerry addressed the public today and that the Administration released unclassified intelligence it has gathered about the Assad regime’s actions.  We must not repeat the mistakes of the past by failing to fully consider and understand the costs, risks, and geopolitical implications of such actions.  Any American military intervention against the Syrian government must have clear objectives and a clear timeline, and this information must be relayed to Congress and the American people.”", "firstname": "Doris", "district": "Sacramento", "source": "", "lastname": "Matsui", "imageurl": "http://a.scpr.org/i/433d358ae89143098335236a5d51c989/54559-wide.jpg", "caption": "Congresswoman Doris Matsui - (D-Sacramento)", "sourceurl": "", "party": "D", "position": "Rep.", "fullname": "Doris Matsui"}, {"viewonsyria": "", "firstname": "Kevin", "district": "Bakersfield", "source": "", "lastname": "McCarthy", "imageurl": "http://a.scpr.org/i/20e1ab60def160170f33b9de69deacc4/54580-wide.jpg", "caption": "Congressman Kevin McCarthy - (R-Bakersfield)", "sourceurl": "", "party": "R", "position": "Rep.", "fullname": "Kevin McCarthy"}, {"viewonsyria": "\"The Constitution clearly and unmistakably vests Congress with the sole prerogative to declare war.\n\n\"War is not a one-sided act that can be turned on and off with Congressional funding.  Once any nation commits an act of war against another, from that moment it is at war -- inextricably embroiled and entangled with an aggrieved and belligerent government and its allies that have casus belli to prosecute hostilities regardless of what Congress then decides.\n \n\"If there are facts that compel us to take such a course, let those facts be laid before Congress and let Congress fulfill its rightful constitutional role on the most momentous decision any government can make. \n \n\"I believe that absent an attack or imminent threat to the United States or a specific authorization by Congress, the order of a military attack on the government of Syria would be illegal and unconstitutional.\"", "firstname": "Tom", "district": "Granite Bay", "source": "", "lastname": "McClintock", "imageurl": "http://a.scpr.org/i/ad4fc5e07d392a3ed73d09a18c30d383/54595-wide.jpg", "caption": "Congressman Tom McClintock - (R-Granite Bay)", "sourceurl": "", "party": "R", "position": "Rep.", "fullname": "Tom McClintock"}, {"viewonsyria": "\"One thing that bothers me is the president drawing a red line without knowing in his mind what he would do if they crossed the red line.\"", "firstname": "Buck", "district": "Santa Clarita", "source": "", "lastname": "McKeon", "imageurl": "http://a.scpr.org/i/1b969c4595e7d92bc17d2917f5da5002/54553-wide.jpg", "caption": "Congressman Buck McKeon - (R-Santa Clarita)", "sourceurl": "", "party": "R", "position": "Rep.", "fullname": "Buck McKeon"}, {"viewonsyria": "From Fox40: Democratic Congressman Jerry McNerney of Stockton believes that it's OK (the President hasn't made a decision regarding Syria)– for now.\n\n“I’m not sure that that’s constitutionally forbidden, but he will definitely need to get Congressional consultation,” said McNerney about the president’s plans.\n\nWhile McNerney has a different view of the requirements facing the president, he doesn’t agree with any solo US action.\n\n“The urge to do symbolic bombings or action like that is counter-productive,” he said.", "firstname": "Jerry", "district": "Pleasanton", "source": "Fox40", "lastname": "McNerney", "imageurl": "http://a.scpr.org/i/37c1571ef63af4f07e46f428183e793a/54572-wide.jpg", "caption": "Congressman Jerry McNerney - (D-Pleasanton)", "sourceurl": "http://fox40.com/2013/08/29/syria-showdown-local-leaders-following-situation-closely/", "party": "D", "position": "Rep.", "fullname": "Jerry McNerney"}, {"viewonsyria": "", "firstname": "Gary", "district": "San Bernardino", "source": "", "lastname": "Miller", "imageurl": "http://a.scpr.org/i/92c89ba851c76470e5b17a5ede957707/54565-wide.jpg", "caption": "Congressman Gary Miller - (R-San Bernardino)", "sourceurl": "", "party": "R", "position": "Rep.", "fullname": "Gary Miller"}, {"viewonsyria": "", "firstname": "George", "district": "Martinez", "source": "", "lastname": "Miller", "imageurl": "http://a.scpr.org/i/48a9fa3715783119eb0093ea3d01005f/54564-wide.jpg", "caption": "Congressman George Miller - (D-Martinez)", "sourceurl": "", "party": "D", "position": "Rep.", "fullname": "George Miller"}, {"viewonsyria": "", "firstname": "Grace", "district": "Santa Fe Springs", "source": "", "lastname": "Napolitano", "imageurl": "http://a.scpr.org/i/e6bbc603a2be2d1222733a737c881cd1/54566-wide.jpg", "caption": "Congresswoman Grace Napolitano - (D-Santa Fe Springs)", "sourceurl": "", "party": "D", "position": "Rep.", "fullname": "Grace Napolitano"}, {"viewonsyria": "\"The recent escalation of atrocities inflicted by the Syrian government on its own citizens leaves little doubt that it has no intention of abiding by any standard of moral decency that is recognized by the international community. Americans are outraged by President Assad's willful disregard for human rights through the use of chemical weapons. This action no longer justifies a strictly \"hands off\" diplomacy to what Americans once perceived as a regional conflict. Today I join my fellow lawmakers in condemning the Assad regime. I stand with them, prepared to consult with President Obama on setting forth a course of action that affirms our nation's commitment to human rights.\"", "firstname": "Gloria", "district": "Ontario", "source": "", "lastname": "Negrete McLeod", "imageurl": "http://a.scpr.org/i/f13f8929d3dc0d3748a10e7bd10f51f8/54570-wide.jpg", "caption": "Congresswoman Gloria Negrete McLeod - (D-Ontario)", "sourceurl": "", "party": "D", "position": "Rep.", "fullname": "Gloria Negrete McLeod"}, {"viewonsyria": "", "firstname": "Devin", "district": "Tulare", "source": "", "lastname": "Nunes", "imageurl": "http://a.scpr.org/i/dd82511197830db3a2fc3b2a1f3f163d/54556-wide.jpg", "caption": "Congressman Devin Nunes - (R-Tulare)", "sourceurl": "", "party": "R", "position": "Rep.", "fullname": "Devin Nunes"}, {"viewonsyria": "UPDATED STATEMENT: \"President Obama is right that the debate and authorization by Congress for action will make our country and the response in Syria stronger.\n\n\"President Assad was wrong to gas the Syrian people killing more than 1,400 people, including 400 children.\n\n\"It is a pillar of America's security that we must stop the use and proliferation of chemical, biological and nuclear weapons.\n\n\"As the President stated today, military action in response to Assad's reckless use of deadly gas that is limited in scope and duration, without boots on the ground, is in our national security interest and in furtherance of regional stability and global security.\n\n\"I look forward to the debate.\"\n\nORIGINAL STATEMENT: \"It is clear that the American people are weary of war.  However, Assad gassing his own people is an issue of our national security, regional stability and global security.  We must be clear that the United States rejects the use of chemical weapons by Assad or any other regime. What Assad has done is outside the realm of basic human rights.\" ", "firstname": "Nancy", "district": "San Francisco", "source": "Updated: Press release", "lastname": "Pelosi", "imageurl": "http://a.scpr.org/i/09eab22bfc443734cea048d31e320534/54589-wide.jpg", "caption": "Congresswoman Nancy Pelosi - (D-San Francisco)", "sourceurl": "", "party": "D", "position": "Rep.", "fullname": "Nancy Pelosi"}, {"viewonsyria": "“Reports that the Assad regime has used chemical weapons against its own people, including children, are shocking.  Acts like these are unconscionable and reprehensible.  I understand President Obama’s concern that these atrocities not be ignored.\n\n“As I consider the President’s request for support, I will need to determine our intended objective, the specific actions to be taken, the expected response, our exit strategy, and how these efforts will protect American interests both in the region and here at home.  San Diegans have paid a particularly heavy price for our engagement in Iraq and Afghanistan in the past decade.  That's why I welcome the President's call for Congressional input on this very serious matter. This debate will allow Congress and the American people to have more clarity on the facts that have been gathered and on what our commitments will be moving forward.  I personally look forward to a fully informed discussion in the coming weeks.”", "firstname": "Scott", "district": "San Diego", "source": "Press release", "lastname": "Peters", "imageurl": "http://a.scpr.org/i/cc3e7912c8001697f14fe2971bb33d33/54593-wide.jpg", "caption": "Congressman Scott Peters - (D-San Diego)", "sourceurl": "", "party": "D", "position": "Rep.", "fullname": "Scott Peters"}, {"viewonsyria": "\"When our national security is at stake, we are willing to battle any foe. But we shouldn’t be looking for trouble and barging into somebody else’s fight.  If we get sucked into the Syrian conflict there will be a heavy price to pay in both treasure and blood and the American people have shed too much blood in that region already.\"", "firstname": "Dana", "district": "Huntington Beach", "source": "", "lastname": "Rohrabacher", "imageurl": "http://a.scpr.org/i/eeadd3e3c3820e30e91e3d1e1aac5721/54555-wide.jpg", "caption": "Congressman Dana Rohrabacher - (R-Huntington Beach)", "sourceurl": "", "party": "R", "position": "Rep.", "fullname": "Dana Rohrabacher"}, {"viewonsyria": "", "firstname": "Lucille", "district": "Commerce", "source": "", "lastname": "Roybal-Allard", "imageurl": "http://a.scpr.org/i/969609eead9f023e847cd75e1a2323b1/54584-wide.jpg", "caption": "Congresswoman Lucille Roybal-Allard - (D-Commerce)", "sourceurl": "", "party": "D", "position": "Rep.", "fullname": "Lucille Roybal-Allard"}, {"viewonsyria": "UPDATED STATEMENT: “The Administration’s Syria policy has been incoherent, and there are many unanswered questions, so I welcome the President’s decision to seek congressional authorization for any use of military force and look forward to a vigorous debate on this critical issue.  Any proposed U.S. military response to the Syrian regime’s use of chemical weapons demands thorough and deliberate consideration. \n \n“The President will need to make his case to the American public and Congress.”\n\nORIGINAL STATEMENT: The Syrian regime’s use of chemical weapons is beyond the pale.  The United States has deep national security interests in Syria and the region.  The President has said this is a ‘redline.’ He is now proposing to put action behind his words.\n\nAny U.S. military action could bring serious consequences or further escalation.  The President should be making the case to the American public, and his Administration should come to Congress to explain their plans.  The consequences are too great for Congress to be brushed aside.", "firstname": "Ed", "district": "Fullerton", "source": "Press Releases", "lastname": "Royce", "imageurl": "http://a.scpr.org/i/2f7299ab8d67e37805f0f0c498bf2a2b/54562-wide.jpg", "caption": "Congressman Ed Royce - (R-Fullerton)", "sourceurl": "http://foreignaffairs.house.gov/press-release/chairman-royce-statement-syria", "party": "R", "position": "Rep.", "fullname": "Ed Royce"}, {"viewonsyria": "The use of chemical weapons by the Syrian government is illegal, immoral, and inexcusable. The U.S. needs to determine what response best serves our own national interest and the cause of human rights. We must act thoughtfully and strategically.", "firstname": "Raul", "district": "Palm Springs", "source": "Desert Sun", "lastname": "Ruiz", "imageurl": "http://a.scpr.org/i/8d5a715e2ed4307717ef65e1aad82681/54591-wide.jpg", "caption": "Congressman member Raul Ruiz - (D-Palm Springs)", "sourceurl": "http://www.mydesert.com/article/20130828/NEWS03/308280004/Syria-Ruiz-position-unclear-Congress-role", "party": "D", "position": "Rep.", "fullname": "Raul Ruiz"}, {"viewonsyria": "“It is unacceptable for any government to attack, injure, and kill its own people. With that said, I strongly urge President Obama to seek Congressional approval before authorizing any U.S. military intervention in Syria.\"", "firstname": "Linda", "district": "Lakewood", "source": "", "lastname": "Sanchez", "imageurl": "http://a.scpr.org/i/324788c23fc4158a6d2b31b3ffc7a2c0/57741-wide.jpg", "caption": "Congresswoman Linda Sanchez - (D-Lakewood)", "sourceurl": "", "party": "D", "position": "Rep.", "fullname": "Linda Sanchez"}, {"viewonsyria": "UPDATED STATEMENT: \n\"I am deeply concerned about the risk of not responding to this violation of international norms, especially in light of North Korea¹s and Iran¹s access to the same type of weapons.  However, the course of action we take must be in the best interest of the United States and we simply cannot entangle ourselves in Syria¹s civil war. Any action going forward must be based upon constant communication and meaningful consultation between the White House, Congress and most \nimportantly, the American people.\"\nORIGINAL STATEMENT: \"The situation in Syria is about as complicated as it could be. A military action by the United States could have unintended consequences that could, in fact, make the situation worse. We should take all necessary steps to support the United Nations inspection efforts and keep a close watch on who has access and who could have access to chemical weapons. We need to make sure an attack of this nature cannot happen again. Going forward, Congress should be involved in any course of action that the Obama Administration takes.\"", "firstname": "Loretta", "district": "Anaheim", "source": "", "lastname": "Sanchez", "imageurl": "http://a.scpr.org/i/8d703128994c52a11c6dfbedd84e8896/54582-wide.jpg", "caption": "Congresswoman Loretta Sanchez - (D-Anaheim)", "sourceurl": "", "party": "D", "position": "Rep.", "fullname": "Loretta Sanchez"}, {"viewonsyria": "UPDATED STATEMENT: \"For more than a week I have been urging the Speaker to reconvene the House given the gravity of the situation in Syria. Now that the President has called for a vote on a new authorization to use force, it is all the more essential that we be called back into session immediately.\n\n\"This is not a judgment to be made by the Congress in haste, and consultation with the Administration needs to intensify now. I was briefed by the intelligence community again yesterday, and look forward to tomorrow's hearing and to discussing this issue with my colleagues.\"\n\nORIGINAL STATEMENT: \"If we don't act on this red line now I think we'll be sending a message not only to the Assad regime that they can continue the use of chemical weapons, but to others around the world who may contemplate this.\"", "firstname": "Adam", "district": "Glendale", "source": "Updated: Press release; Original: CNN\n", "lastname": "Schiff", "imageurl": "http://a.scpr.org/i/5fe587ea8a39086d95d134d5425a1aa4/54546-wide.jpg", "caption": "Congressman Adam Schiff - (D-Glendale)", "sourceurl": "", "party": "D", "position": "Rep.", "fullname": "Adam Schiff"}, {"viewonsyria": "\"Under the War Powers Act the President may not put American forces into hostilities for more than 60 days without Congressional approval.\n\n\"The Syrian opposition includes al-Qaeda affiliated elements. However the Assad regime poses a greater threat to U.S. national security interests as is illustrated by Assad's alliance with Iran and Hezbollah. We should demonstrate to Assad, and dictators who come after him, that they will pay a significant military price if they use chemical weapons — particularly if they use chemical weapons on a large scale against civilians.\"", "firstname": "Brad", "district": "Sherman Oaks", "source": "", "lastname": "Sherman", "imageurl": "http://a.scpr.org/i/d7eef28b6b29158970229989cc158bb7/54552-wide.jpg", "caption": "Congressman Brad Sherman - (D-Sherman Oaks)", "sourceurl": "", "party": "D", "position": "Rep.", "fullname": "Brad Sherman"}, {"viewonsyria": "", "firstname": "Jackie", "district": "San Mateo", "source": "", "lastname": "Speier", "imageurl": "http://a.scpr.org/i/bc6447ff81435b8fc1244047823f3e1c/54568-wide.jpg", "caption": "Congressman Jackie Speier - (D-San Mateo)", "sourceurl": "", "party": "D", "position": "Rep.", "fullname": "Jackie Speier"}, {"viewonsyria": "Via a spokesman: \"Congressman Swalwell has been briefed by U.S. military generals and intelligence officials on the developing situation in Syria. He strongly condemns Syria's use of chemical weapons but believes we must proceed with extreme caution and learn as much as possible about the deeply divided groups in the country before becoming actively involved in the conflict.\"", "firstname": "Eric", "district": "Livermore", "source": "Spokesman", "lastname": "Swalwell", "imageurl": "http://a.scpr.org/i/eca5205ab6efd8e7d1a475e7e33d8171/54563-wide.jpg", "caption": "Congressman Eric Swalwell - (D-Livermore)", "sourceurl": "", "party": "D", "position": "Rep.", "fullname": "Eric Swalwell"}, {"viewonsyria": "", "firstname": "Mark", "district": "Riverside", "source": "", "lastname": "Takano", "imageurl": "http://a.scpr.org/i/95af298588d8607ab47e8fc7a9448cae/54585-wide.jpg", "caption": "Congressman member Mark Takano - (D-Riverside)", "sourceurl": "", "party": "D", "position": "Rep.", "fullname": "Mark Takano"}, {"viewonsyria": "", "firstname": "Mike", "district": "St. Helena", "source": "", "lastname": "Thompson", "imageurl": "http://a.scpr.org/i/cea28e53ea47e0f3c38708462660e7a8/54588-wide.jpg", "caption": "Congressman Mike Thompson - (D-St. Helena)", "sourceurl": "", "party": "D", "position": "Rep.", "fullname": "Mike Thompson"}, {"viewonsyria": "", "firstname": "David", "district": "Hanford", "source": "", "lastname": "Valadao", "imageurl": "http://a.scpr.org/i/e50dc3fe30296d026916dd9819e00756/54554-wide.jpg", "caption": "Congressman David Valadao - (R-Hanford)", "sourceurl": "", "party": "R", "position": "Rep.", "fullname": "David Valadao"}, {"viewonsyria": "", "firstname": "Juan", "district": "Chula Vista", "source": "", "lastname": "Vargas", "imageurl": "http://a.scpr.org/i/b7c0bfe3b30f5c3899d6f4cdce932514/54575-wide.jpg", "caption": "Congressman Juan Vargas - (D-Chula Vista)", "sourceurl": "", "party": "D", "position": "Rep.", "fullname": "Juan Vargas"}, {"viewonsyria": "", "firstname": "Maxine", "district": "Los Angeles", "source": "", "lastname": "Waters", "imageurl": "http://a.scpr.org/i/c52c55a13b0fcd918d440f64b75235b4/54586-wide.jpg", "caption": "Congresswoman Maxine Waters - (D-Los Angeles)", "sourceurl": "", "party": "D", "position": "Rep.", "fullname": "Maxine Waters"}, {"viewonsyria": "I don't see the purpose of a strike against Syria for using chemical weapons. It would only show our unhappiness for their use of chemical weapons on their own people. I think not much can be accomplished by such a strike. I do think the President should ask congress for approval for any action on Syria of a military nature. I don't see what can be accomplished. I think we ought to ask what happens next after we attack Syria. If they use chemical weapons again, do we attack them again? Why are we doing this on our own and not with the rest of the international community?", "firstname": "Henry", "district": "Los Angeles", "source": "Interview with KPCC", "lastname": "Waxman", "imageurl": "http://a.scpr.org/i/1600cfbf17bf5e3f0566dffbadffdb89/54567-wide.jpg", "caption": "Congressman Henry Waxman - (D-Los Angeles)", "sourceurl": "", "party": "D", "position": "Rep.", "fullname": "Henry Waxman"}]}