[{"body": "About 9:20 a.m., a suspect pulls an assault rifle from bag and begins to shoot in Terminal 3 at LAX, according to details from LA Mayor Eric Garcetti and LAX police officials at a Friday news conference. LA Airport Police responded and tracked the suspect through the aiport, later starting a shootout.", "mediaurl": "", "readmoreurl": "", "title": "Suspect begins shooting in LAX Terminal 3", "mediatype": "", "caption": "", "displaydate": "9:20 a.m.", "date": "Nov 1, 2013", "readmoresource": ""}, {"body": "CBS Los Angeles and other media outlets begin reporting that an incident at LAX has prompted the evacuation of Terminal 3. Airport officials confirmed to KPCC that a police incident began about 9:30 a.m. at Terminal 3 at LAX. Terminal 3 is home to the following airlines, according to the LAX website: Allegiant Air, Frontier, JetBlue, Spirit, Virgin America, departures for Virgin Australia.", "mediaurl": "/legacy/assethost/i/e4f408524e6cd59bb9eed621c6f14247/71241-full.jpg", "readmoreurl": "", "title": "Incident' prompts evacuation at LAX terminal", "mediatype": "image", "caption": "Passengers wait at Terminal 1 after reports of a shooting in Terminal 3 at LAX on Nov 1. - Mae Ryan/KPCC", "displaydate": "9:30 a.m.", "date": "Nov 1, 2013", "readmoresource": ""}, {"body": "LA Police Deparment states Century Boulevard \"prior to\" entrance to LAX is closed per the LAPD Communications Twitter account. Metro spokesman Marc Littman tells KPCC that Century Boulevard is closed from Sepulveda Boulevard to Aviation Drive.", "mediaurl": "/legacy/assethost/i/768ed2d445ccd0f51313ff14be44aae5/71239-full.jpg", "readmoreurl": "https://twitter.com/911LAPD/status/396318656402960384", "title": "LAPD: Century Boulevard leading to LAX closed", "mediatype": "image", "caption": "Raymond Young was supposed to leave for Shanghai today, but now he is looking for a way out of LAX after the shooting. - Mae Ryan/KPCC", "displaydate": "9:51 a.m.", "date": "Nov 1, 2013", "readmoresource": ""}, {"body": "A Transportation Safety Administration spokesman confirms to KPCC's Lauren Osen that shots were fired at a LAX checkpoint Friday morning. The spokesman was unable to confirm which terminal.", "mediaurl": "http://maps.googleapis.com/maps/api/staticmap?center=33.945087,-118.407181&zoom=14&size=300x300&maptype=roadmap&markers=color:blue%7C33.945087,-118.407181&sensor=false", "readmoreurl": "http://www.scpr.org/news/2013/11/01/40151/incident-prompts-evacuation-at-lax-terminal/", "title": "TSA spokesman confirms \"shots fired\"", "mediatype": "image", "caption": "", "displaydate": "9:56 a.m.", "date": "Nov 1, 2013", "readmoresource": ""}, {"body": "FAA issues a ground stop for LAX to all Western air traffic control facilities as far east as Albuquerque and Denver, per Flight Aware;s Mark Duell, the vice president of operations. The ground stop instructs these air traffic control facilities to halt all departures destined for LAX until 11:30 a.m. Pacific. Flights already in the air are being allowed to continue. In addition, at the request of the airlines, all American Airlines and Southwest Airlines departures nationwide destined for LAX have been halted until 11:30 a.m. Pacific and noon Pacific, respectively.", "mediaurl": "/legacy/assethost/i/04da071a12850d4abc7f8fe76fbe0545/71238-full.jpg", "readmoreurl": "", "title": "FAA issues a ground stop", "mediatype": "image", "caption": "Bags for arriving passengers wait at a LAX baggage claim on Nov 1. - Mae Ryan/KPCC", "displaydate": "9:51 a.m.", "date": "Nov 1, 2013", "readmoresource": ""}, {"body": "The Los Angeles Fire Department is assisting law enforcement at multi-patient incident at LAX, per its official Twitter account. Los Angeles Fire Department spokesman Brian Humphrey called the shooting a multi-patient incident.", "mediaurl": "", "readmoreurl": "https://twitter.com/LAFD/status/396319267060060160", "title": "LA Fire Deparment assisting law enforcement at multi-patient incident at LAX", "mediatype": "", "caption": "", "displaydate": "9:54 a.m.", "date": "Nov 1, 2013", "readmoresource": ""}, {"body": "One witness described hearing eight to 10 shots fired in two bursts. Nick Pugh tells KPCC he had just been dropped off at the main entrance and was up on the upper mezzanine when he heard the shots from just below near the security checkpoint. \"It sounded just like a gun and I basically — everybody dropped to the floor and started crawling on the ground, but there was no way to go. Luckily I was by an emergency exit,\" he said. Pugh said he ran across the tarmac, when a line of police stopped him as a possible suspect. He was released after about 10 minutes.", "mediaurl": "", "readmoreurl": "", "title": "Witness reports 8 to 10 shots fired", "mediatype": "", "caption": "", "displaydate": "10:00 a.m.", "date": "Nov 1, 2013", "readmoresource": ""}, {"body": "", "mediaurl": "", "readmoreurl": "https://twitter.com/911LAPD/status/396321867033608193", "title": "LAPD requests motorists avoid LAX", "mediatype": "", "caption": "", "displaydate": "10:04 a.m.", "date": "Nov 1, 2013", "readmoresource": ""}, {"body": "Per the FAA alert: \"Due to OTHER/SECURITY, there is a Traffic Management Program in effect for traffic arriving Los Angeles International Airport, Los Angeles, CA (LAX). To see if you may be affected, select your departure airport and check 'Delays by Destination'.\"", "mediaurl": "", "readmoreurl": "http://www.fly.faa.gov/flyfaa/flyfaaindex.jsp?ARPT=LAX&p=0", "title": "FAA institutes Traffic Management Program at LAX", "mediatype": "", "caption": "", "displaydate": "10:12 a.m.", "date": "Nov 1, 2013", "readmoresource": ""}, {"body": "LA Police Deparment places West, South and Central bureaus on tactical alert, per the LAPD Communications Twitter account.", "mediaurl": "", "readmoreurl": "https://twitter.com/911LAPD/status/396325496767512576", "title": "LAPD places three bureaus on tactical alert", "mediatype": "", "caption": "", "displaydate": "10:18 a.m.", "date": "Nov 1, 2013", "readmoresource": ""}, {"body": "LAPD Police Chief Charlie Beck and LA Mayor Eric Garcetti head to LAX, per the mayor's spokeswoman", "mediaurl": "", "readmoreurl": "", "title": "City officials enroute to LAX", "mediatype": "", "caption": "", "displaydate": "10:20 a.m.", "date": "Nov 1, 2013", "readmoresource": ""}, {"body": "All flight operations, with the exception of arriving flights, are temporarily on hold, LAX officials say. Upper and departures Level roadways are temporarily blocked by law enforcement. The public is being held back, per Katherine Alvarado with LAX Public Relations.", "mediaurl": "/legacy/assethost/i/e8550dd95d03885bc10dd9550b53da24/71225-full.jpg", "readmoreurl": "", "title": "LAX flights on hold; upper & departures level roadways temporarily blocked", "mediatype": "image", "caption": "", "displaydate": "10:26 a.m.", "date": "Nov 1, 2013", "readmoresource": ""}, {"body": "President Barack Obama has been briefed on the reported shooting at Los Angeles International Airport. The White House says the Los Angeles Police Department is leading the response and investigation into the shooting, and administration officials are in touch with federal and local partners.", "mediaurl": "", "readmoreurl": "", "title": "President briefed on situation", "mediatype": "", "caption": "", "displaydate": "10:40 a.m.", "date": "Nov 1, 2013", "readmoresource": ""}, {"body": "LAPD officials plan a 11:30 a.m. news conference to discuss the shooting incident at LAX on Friday morning.", "mediaurl": "", "readmoreurl": "", "title": "LAPD plans 11:30 a.m. news conference", "mediatype": "", "caption": "", "displaydate": "10:50 a.m.", "date": "Nov 1, 2013", "readmoresource": ""}, {"body": "FAA Air traffic controller Don Lewis tells KPCC a ground stop means no planes from any other airport can land at LAX. FAA Traffic Management will decide when/where flights can be redirected to other area airlines.", "mediaurl": "", "readmoreurl": "", "title": "FAA Air traffic controller defines \"ground stop\"", "mediatype": "", "caption": "", "displaydate": "10:51 a.m.", "date": "Nov 1, 2013", "readmoresource": ""}, {"body": "TSA spokesman Nico Melendez tells the LA Times that one TSA officer was wounded in the shooting at LAX.", "mediaurl": "", "readmoreurl": "http://www.latimes.com/local/lanow/la-me-ln-live-lax-shooting-tsa-agent-alleged-gunman-shot-20131101,0,3517669.story#axzz2jPo86I14", "title": "LA Times reports one TSA officer wounded in shooting", "mediatype": "", "caption": "", "displaydate": "10:24 a.m.", "date": "Nov 1, 2013", "readmoresource": ""}, {"body": "Detective Gus Villanueva of the Los Angeles Police Department told NBC4 that police believe they have a suspect in custody after a gunman opened fire in Terminal 3 of L.A. International Airport. Villanueva said officers are sweeping through the terminal to make sure there are no other gunmen.", "mediaurl": "", "readmoreurl": "", "title": "LAPD Detective: Suspect in custody", "mediatype": "", "caption": "", "displaydate": "11:02 a.m.", "date": "Nov 1, 2013", "readmoresource": ""}, {"body": "Metro spokesman Marc Litman says FlyAway buses, Metro Green Line \"G\" shuttle buses from Aviation/LAX Station and other airport connections are not  being allowed into the LAX terminal area because of the shooting situation. Metro Green Line service is not affected, but riders should expect delays on all Metro buses that travel in the LAX area as streets are extremely backed up.", "mediaurl": "", "readmoreurl": "", "title": "Impacts to Metro services ", "mediatype": "", "caption": "", "displaydate": "11:03 a.m.", "date": "Nov 1, 2013", "readmoresource": ""}, {"body": "KPCC reports Burbank and Long Beach airports remain open but under heightened security.", "mediaurl": "", "readmoreurl": "https://twitter.com/LASchoolPolice/status/396335210884648960", "title": "Burbank, Long Beach airports add heightened security", "mediatype": "", "caption": "", "displaydate": "11:03 a.m.", "date": "Nov 1, 2013", "readmoresource": ""}, {"body": "Flights arriving for Southwest Airlines, US Airways, Hawaiian Airlines, JetBlue, Spirit Airlines and Virgin America are being parked at a remote terminal to allow for unloading of passengers, although passengers are not being allowed to leave the airport due to road closures, per FlightAware's Mark Duell. ", "mediaurl": "/legacy/assethost/i/dac208fae81642a09122a692274e0c66/71249-full.jpg", "readmoreurl": "", "title": "LAX Terminals 1, 2, and 3 remain closed", "mediatype": "image", "caption": "Luigie Padron (left) waits with her husband Joey Padron, her two daughters Jayelle and Leslie and friend Cathy Villa Flores at Terminal 1 after the shooting at LAX on Nov. 1. - Mae Ryan/KPCC", "displaydate": "11:12 a.m.", "date": "Nov 1, 2013", "readmoresource": ""}, {"body": "The California Highway Patrol tweeted from their official account, \"UPDATE: all exits to @LAX_Official from the 105 and 405 freeways are now closed or in the process of closing. Avoid area.\"", "mediaurl": "", "readmoreurl": "https://twitter.com/CHPsouthern/status/396334762312626176", "title": "CHP: All exits to LAX from 405, 105 freeways closed or in process of closing", "mediatype": "", "caption": "", "displaydate": "10:55 a.m.", "date": "Nov 1, 2013", "readmoresource": ""}, {"body": "LAX tweeted from their official account, \"Suspect is now in custody. Multiple victims. Press conference at 11:30 am at Sepulveda Blvd/Century Blvd w/ Airport Police & LAPD Chiefs\"", "mediaurl": "", "readmoreurl": "", "title": "Suspect in custody, according to LAX", "mediatype": "", "caption": "", "displaydate": "10:51 a.m.", "date": "Nov 1, 2013", "readmoresource": ""}, {"body": "L.A. Mayor Eric Garcetti tweeted, \"At LAX in scene w/ Chiefs Gannon, Beck, & Featherstone. Please do not come to airport if you have flight for time being. More info at 11:30.\"", "mediaurl": "", "readmoreurl": "https://twitter.com/ericgarcetti/status/396339878117396481", "title": "Mayor Garcetti tweets, asking those with flights not to come to LAX", "mediatype": "", "caption": "", "displaydate": "11:16 a.m.", "date": "Nov 1, 2013", "readmoresource": ""}, {"body": "Ronald Reagan UCLA Medical Center official Mark Wheeler tells KPCC's Lauren Osen that three male victims from the shooting at LAX were taken to the hospital, a level 1 trauma center.", "mediaurl": "", "readmoreurl": "", "title": "Three male victims taken to Ronald Reagan Medical hospital", "mediatype": "", "caption": "", "displaydate": "11:46 a.m.", "date": "Nov 1, 2013", "readmoresource": ""}, {"body": "A press conference with Mayor Garcetti and LAX officials was held outside LAX.", "mediaurl": "", "readmoreurl": "", "title": "Press conference begins at LAX", "mediatype": "", "caption": "", "displaydate": "11:52 a.m.", "date": "Nov 1, 2013", "readmoresource": ""}, {"body": "Acting LAFD Chief James Featherstone said there were seven victims of the LAX shooting incident. Six were transported to hospitals during a news conference Friday.", "mediaurl": "", "readmoreurl": "", "title": "LAFD Chief: 7 injuries reported, 6 of those transported", "mediatype": "", "caption": "", "displaydate": "11:58 a.m.", "date": "Nov 1, 2013", "readmoresource": ""}, {"body": "During Friday's news conference LAX Police Chief Patrick Gannon said that it appeared the gunman was acting alone and indicated that victims had been transported to local hospitals. He said the suspected shooter came into Terminal 3, pulled an assault rifle out of a bag and began to open fire in the terminal. The suspect then proceeded up into the TSA screening area and continued shooting before moving past the checkpoint and heading into the airport. LAX officers responded, tracked the suspect and engaged in gunfire in Terminal 3. Gannon said there was an officer involved shooting.", "mediaurl": "/legacy/assethost/i/0eab0bd088a1da73c3e5b7e3ee22d0e5/71237-full.jpg", "readmoreurl": "", "title": "LAX Police Chief: \"Suspect pulled an assault rifle out of a bag and began to open fire in the terminal\"", "mediatype": "image", "caption": "Police officers gather evidence outside Terminal 2 at LAX on Nov. 1. - Mae Ryan/KPCC", "displaydate": "12:04 p.m.", "date": "Nov 1, 2013", "readmoresource": ""}, {"body": "LAX continues to accept incoming flights -- at less than half of normal arrival rate -- on its south airfield according to Gina Marie Lindsey, the executive director of LA World Airports. Passengers who were ready to leave at the time of the shooting happened have either left on their aircraft or are holding in their terminals.", "mediaurl": "", "readmoreurl": "", "title": "LAX accepting incoming flights at less than half of normal arrival rate", "mediatype": "", "caption": "", "displaydate": "12:10 p.m.", "date": "Nov 1, 2013", "readmoresource": ""}, {"body": "Ronald Reagan UCLA Medical Center official Mark Wheeler tells KPCC's Lauren Osen that a news conference at the hospital is scheduled for 12:30 a.m.", "mediaurl": "", "readmoreurl": "", "title": "News conference scheduled at Ronald Reagan UCLA Medical Center", "mediatype": "", "caption": "", "displaydate": "12:30 p.m.", "date": "Nov 1, 2013", "readmoresource": ""}, {"body": "One victim is in critical condition after suffering a gunshot wound during the incident at LAX, and two others are in fair condition, according to a Ronald Reagan UCLA Medical Center's Dr. Lynne McCullough, who spoke during a news conference Friday afternoon. Of the three victims, two had suffered gunshot wounds, McCullough said.", "mediaurl": "", "readmoreurl": "", "title": "One victim in critical condition at Ronald Reagan UCLA Medical Center, two in fair condition", "mediatype": "", "caption": "", "displaydate": "12:47 p.m.", "date": "Nov 1, 2013", "readmoresource": ""}, {"body": "LA County Coroner spokesman Craig Harvey confirms to KPCC's Lauren Osen that a 41-year-old shooting victim died from his inuries at about 11 a.m.", "mediaurl": "", "readmoreurl": "", "title": "LA County Coroner confirms one dead", "mediatype": "", "caption": "", "displaydate": "12:52 p.m.", "date": "Nov 1, 2013", "readmoresource": ""}, {"body": "Per a TSA statement released Friday afternoon: “Earlier this morning, a shooting occurred at Terminal 3 at Los Angeles International Airport. Multiple Transportation Security Officers (TSOs) were shot, one fatally. Additional details will be addressed by the FBI and local law enforcement who are investigating the shooting.”", "mediaurl": "", "readmoreurl": "", "title": "TSA: agent shot and killed was a behaviorial detection officer", "mediatype": "", "caption": "", "displaydate": "12:54 p.m.", "date": "Nov 1, 2013", "readmoresource": ""}, {"body": "Reports of the shooting suspect's identity begin to be reported by media outlets.", "mediaurl": "", "readmoreurl": "", "title": "Reports of shooting suspect's identity emerge", "mediatype": "", "caption": "", "displaydate": "1:14 p.m.", "date": "Nov 1, 2013", "readmoresource": ""}, {"body": "The Red Cross and other support services have been deployed to LAX, reports Mayor Eric Garcetti via Twitter. Water is being distributed to everyone outside and passengers inside have access to food and beverages.", "mediaurl": "", "readmoreurl": "", "title": "Red Cross, other services at LAX", "mediatype": "", "caption": "", "displaydate": "1:23 p.m.", "date": "Nov 1, 2013", "readmoresource": ""}, {"body": "During an afternoon news conference, J. David Cox Sr., president of the American Federation of Government Employees, the union that represents TSA workers, said the suspected shooter at LAX Friday morning was not a TSA employee. Cox said the officer who was killed was a behavioral detection officer at LAX. He said those are TSA officers that stand around and observe, as well as making conversations with passengers to make sure there's nothing suspicious. The TSA officer who was killed is the first TSA officer to be killed in the line of duty, Cox said. According to Cox, 2,157 TSA employees work at LAX.", "mediaurl": "", "readmoreurl": "", "title": "Deceased TSA agent had been transferred from Montana", "mediatype": "", "caption": "", "displaydate": "2:30 p.m.", "date": "Nov 1, 2013", "readmoresource": ""}, {"body": "Marshall McClain, president of the Los Angeles Airport Peace Officers Association, said there are more than 1,100 law enforcement and civilian personnel in the airport police force. In addition to LAX, their jurisdiction includes Van Nuys and Ontario airports.", "mediaurl": "", "readmoreurl": "", "title": "LAX police jurisdiction includes Van Nuys and Ontario airports", "mediatype": "", "caption": "", "displaydate": "2:31 p.m.", "date": "Nov 1, 2013", "readmoresource": ""}, {"body": "One victim that had been fair condition has been released from Ronald Reagan UCLA Medical Center, KPCC's Hayley Fox reports.", "mediaurl": "", "readmoreurl": "https://twitter.com/EPfox/status/396405208051245056", "title": "Victim at Ronald Reagan UCLA Medical Center released", "mediatype": "", "caption": "", "displaydate": "3:10 p.m.", "date": "Nov 1, 2013", "readmoresource": ""}, {"body": "The Los Angeles FBI Twitter account tweets the following: \"The suspect in today’s LAX shooting has been identified as Paul Anthony Ciancia, 23, a resident of Los Angeles.\"", "mediaurl": "", "readmoreurl": "https://twitter.com/FBILosAngeles/status/396399216375107584", "title": "FBI tweets suspect's indentity", "mediatype": "", "caption": "", "displaydate": "3:11 p.m.", "date": "Nov 1, 2013", "readmoresource": ""}, {"body": "Paul Ciancia's father called Pennsville Police Chief Allen Cummings early Friday afternoon saying another of his children had received a text message from the 23-year-old \"in reference to him taking his own life,\" the chief told The Associated Press. The Pennsville police department has had no dealings with the younger Ciancia, Cummings said.", "mediaurl": "", "readmoreurl": "http://hosted.ap.org/dynamic/stories/U/US_LAX_SHOOTING_SUSPECT?SITE=AP&SECTION=HOME&TEMPLATE=DEFAULT", "title": "AP: Suspect's father sought help from authorities' in finding him", "mediatype": "", "caption": "", "displaydate": "3:12 p.m.", "date": "Nov 1, 2013", "readmoresource": ""}, {"body": "LAX ground stop for departing flights will stay in effect until about 4 p.m. Terminal 3 remains closed. Termina 1 and Terminal 2 are preparing to re-open", "mediaurl": "", "readmoreurl": "", "title": "Ground stop for departing flights still in effect", "mediatype": "", "caption": "", "displaydate": "3:12 p.m.", "date": "Nov 1, 2013", "readmoresource": ""}, {"body": "FBI spokeswoman Lourdes Arocho confirms to KPCC's Erika Aguilar that the suspect in the LAX shooting is 23-year-old Paul Anthony Ciancia.", "mediaurl": "", "readmoreurl": "https://twitter.com/FBILosAngeles/status/396399216375107584", "title": "Suspect confirmed as 23-year-old Paul Anthony Ciancia", "mediatype": "", "caption": "", "displaydate": "3:17 p.m.", "date": "Nov 1, 2013", "readmoresource": ""}, {"body": "LAX official Twitter account tweets \"Until Terminal 3 is re-opened, operations of the airlines in that terminal will be relocated to another terminal.\"", "mediaurl": "", "readmoreurl": "https://twitter.com/LAX_Official/status/396405126791172096", "title": "Terminal 3 operations moved to other terminal", "mediatype": "", "caption": "", "displaydate": "3:37 p.m.", "date": "Nov 1, 2013", "readmoresource": ""}, {"body": "The American Red Cross has opened a shelter to assist passengers left stranded by today's shooting at LAX. The center is located at the Westchester Recreation Center at 7000 W. Manchester Ave. in Los Angeles. Airport officials say anyone trying to pick up passengers at LAX should go to Economy Lot C. Passengers will be taken to the lot by bus within two hours. Stranded passengers in need of accommodations can call the L.A. Tourism and Convention Board hotline at (888) 831-7176.", "mediaurl": "http://maps.googleapis.com/maps/api/staticmap?center=33.958205,-118.416592&zoom=13&size=300x300&maptype=roadmap&markers=color:blue%7C33.958205,-118.416592&sensor=false", "readmoreurl": "", "title": "Red Cross opens shelter for those affected by LAX shooting", "mediatype": "", "caption": "", "displaydate": "3:55 p.m.", "date": "Nov 1, 2013", "readmoresource": ""}, {"body": "Marshall McClain, president of the Los Angeles Airport Peace Officers Association, tells KPCC’s Rina Palta that earlier this year, there was a policy change and \"officers were no longer stationed at podiums\" at LAX. The podiums are where TSA agents check your ID and boarding pass, and pass you on to the X-ray screening machines. After the 9/11 terrorist attacks, armed officers were stationed at podiums. McClain says that was the norm until earlier this year. He said the general trend nationwide has been to pull armed officers from the podiums, and that LAX had been one of the few remaining airports to have them. McClain also said that while there are no armed officers stationed at the screening areas, they pass by them as part of their regular patrol routes, and there must be officers within five minutes of any spot in the airport at any given time.", "mediaurl": "", "readmoreurl": "", "title": "Armed officers had been removed from TSA checkpoints", "mediatype": "", "caption": "", "displaydate": "4:06 p.m.", "date": "Nov 1, 2013", "readmoresource": ""}, {"body": "Through a statement, the TSA confirms the identity of the Transportation Security Officer killed Friday at Los Angeles International Airport as 39-year-old Gerardo I. Hernandez.", "mediaurl": "", "readmoreurl": "", "title": "TSA IDs officer killed", "mediatype": "", "caption": "", "displaydate": "9:01 p.m.", "date": "Nov 1, 2013", "readmoresource": ""}, {"body": "Through the aiport's Twitter account, ticket counters in Terminal 3 are open, though the rest of the terminal is closed for FBI investigation.", "mediaurl": "", "readmoreurl": "https://twitter.com/LAX_Official/status/396657964628856832", "title": "Terminal 3 ticket counters open", "mediatype": "", "caption": "", "displaydate": "8:20 a.m.", "date": "Nov 2, 2013", "readmoresource": ""}, {"body": "Ronald Reagan UCLA Medical Center official Mark Wheeler said one patient remains in critical condition and one patient remains in fair condition. Phil Rocha, spokesman for Harbor-UCLA, said one patient is listed in good condition.", "mediaurl": "", "readmoreurl": "", "title": "Updates on those hospitalized from shooting ", "mediatype": "", "caption": "", "displaydate": "9:46 a.m.", "date": "Nov 2, 2013", "readmoresource": ""}, {"body": "Nancy Castles, a spokeswoman for Los Angeles International Airport, told the AP that more than 1,500 flights were affected by the shooting at the airport. More than 167,000 passengers were impacted. Of the affected flights, 724 were scheduled arrivals with an estimated 67,850 passengers and 826 were departures with an estimated 99,200 passengers on board.", "mediaurl": "", "readmoreurl": "", "title": "More than 1,500 flights affected by shooting", "mediatype": "", "caption": "", "displaydate": "11:49 a.m.", "date": "Nov 2, 2013", "readmoresource": ""}, {"body": "L.A. airport spokeswoman Gina Marie Lindsey said at a news conference that Terminal 3 \"is now fully open and operational.\" Passengers should continue to check information from their airliner. Jet Blue flights are expected to continue operating out of Long Beach Airport until later this evening, Lindsey said.", "mediaurl": "", "readmoreurl": "", "title": "Terminal 3 fully opened", "mediatype": "", "caption": "", "displaydate": "1:15 p.m.", "date": "Nov 2, 2013", "readmoresource": ""}, {"body": "The Associated Press reports that the Transportation Security Administration will review its policy on officer safety in the wake of the deadly shooting at Los Angeles International Airport.", "mediaurl": "", "readmoreurl": "http://www.scpr.org/news/2013/11/02/40156/lax-shooting-chaos-fear-as-gunman-stalked-terminal/#1513", "title": "TSA to review security after shooting", "mediatype": "", "caption": "", "displaydate": "Nov. 2", "date": "Nov 2, 2013", "readmoresource": ""}, {"body": "The official complaint by the federal government against suspected LAX shooter Paul Anthony Ciancia was filed Saturday in U.S. District Court in California. Ciancia faces two potential maximum sentences: the death penalty or life without the possibility of parole, officials said at a Saturday press conference, depending on what the attorney general decides. Speaking at the Federal Building in Westwood, U.S. Attorney Andre Birotte Jr. said the murder charge applied to the death of TSA officer Gerardo Hernandez, who died in Friday's shooting at LAX's Terminal 3.", "mediaurl": "", "readmoreurl": "http://www.scpr.org/news/2013/11/02/40156/lax-shooting-chaos-fear-as-gunman-stalked-terminal/#1634", "title": "Complaint filed against accused shooter Paul Anthony Ciancia", "mediatype": "", "caption": "", "displaydate": "Nov. 2", "date": "Nov 2, 2013", "readmoresource": ""}]
