[{"body": "Huell Howser dies, apparently of natural causes, at his desert home. He was 67 years old.\n\nIn response, the management of noncommercial station KCET issued a statement that read in part:\n\n“Huell elevated the simple joys and undiscovered nuggets of living in our great state.  He made the magnificence and power of nature seem accessible by bringing it into our living rooms.  Most importantly, he reminded us to find the magic and wonderment in our lives every day.”\n\n", "mediaurl": "http://a.scpr.org/i/5fb23968221641578269468149022115/53138-six.jpg", "readmoreurl": "http://www.scpr.org/blogs/news/2013/01/07/11878/california-television-legend-huell-howser-has-died/", "title": "Huell Howser dies", "mediatype": "image", "caption": "Huell Howser amidst the poppies, California's Gold.", "displaydate": "Jan. 6, 2013", "date": "January 6, 2013", "readmoresource": ""}, {"body": "Howser announces his retirement from his long-running TV programs. At the time, “California’s Gold” had been in production for 19 years. He donates his television archive and one of his homes to Chapman University in Orange County.", "mediaurl": "http://a.scpr.org/i/f89aa8ae1baaa6f50e219ab1a9e16f5c/24036-four.jpg", "readmoreurl": "http://www.scpr.org/news/2012/11/28/35043/huell-howser-retiring-ramp-remembrance/", "title": "Huell retires", "mediatype": "image", "caption": "Huell Howser (with donut) and KPCC's John Rabe.", "displaydate": "Nov. 26, 2012", "date": "November 26, 2012", "readmoresource": ""}, {"body": "A Los Angeles Magazine profile estimates that a million people watch his programs every week on California's 13 public radio stations.", "mediaurl": "http://a.scpr.org/i/1dd2f479ec0510250e3e54399b5d9ddc/51762-six.jpg", "readmoreurl": "http://www.lamag.com/features/2003/11/01/this-is-amazing", "title": "Huell at the height of his popularity", "mediatype": "image", "caption": "Howell Huser — an on-screen parody of Huell Howser — made his first appearance on the Simpsons in 2005. In 2009, the real life TV host appeared on the show, this time as himself.", "displaydate": "November 2003", "date": "November 2, 2003", "readmoresource": ""}, {"body": "Late 1990s – 2012 – Howser spins off several series for public broadcasting: “Visiting with Huell Howser,” “Road Trip with Huell Howser,” “California’s Golden Parks,” “California’s Green,” “California’s Water” and, most recently, “Downtown.” All the programs share the same one-camera production and simple approach that he described on his website: \"We operate on the premise that TV isn’t brain surgery. People’s stories are what it’s all about. If you have a good story, it doesn’t have to be overproduced. I want our stories to reveal the wonders of the human spirit and the richness of life in California, including its history, people, culture and natural wonders.\"", "mediaurl": "", "readmoreurl": "", "title": "Huell on public broadcasting", "mediatype": "", "caption": "", "displaydate": "Late 1990s ", "date": "January 1, 2000", "readmoresource": ""}, {"body": "Huell Howser Productions launches “California’s Gold,” in which the host visits all kinds of places off the state’s beaten paths – and quite a few in plain sight – and describes them in awed detail with help from the keepers and inhabitants of those places. His exclamation “That’s amazing!” becomes an aural signature of his storytelling style", "mediaurl": "http://a.scpr.org/i/1a6d3402fbaf579dc2a29cb6d8b7376f/51261-wide.jpg", "readmoreurl": "", "title": "Huell Howser Productions launches “California’s Gold\"", "mediatype": "image", "caption": "Vahan, Ara, and Khechig Manoogian with Huell Howser, c. 1990.", "displaydate": "1991", "date": "January 1, 1990", "readmoresource": ""}, {"body": "Howser switches stations to KCET-TV – at that time the leading Public Broadcasting System affiliate in greater Los Angeles. His early work for that station included “Videolog,” short profiles that prefigured the style he developed in multiple series about California.", "mediaurl": "", "readmoreurl": "", "title": "Huell on KCET", "mediatype": "", "caption": "", "displaydate": "1987", "date": "January 1, 1987", "readmoresource": ""}, {"body": "Howser moves to California from his native Tennessee - first to host a talk show at CNN. He later reported human interest stories for L.A.'s KCBS-TV.\n\n", "mediaurl": "", "readmoreurl": "http://www.lamag.com/features/2003/11/01/this-is-amazing", "title": "Huell moves to California and KCBS", "mediatype": "", "caption": "", "displaydate": "1981", "date": "January 1, 1980", "readmoresource": ""}, {"body": "He joins the staff of WSM-TV, an NBC affiliate in Nashville, where his features about regular people generate attention - and a suspension when a station manager considered them too political.", "mediaurl": "", "readmoreurl": "http://www.lamag.com/features/2003/11/01/this-is-amazing", "title": "Huell gains a following in Nashville", "mediatype": "", "caption": "", "displaydate": "1970", "date": "January 1, 1970", "readmoresource": ""}, {"body": "In 1979 Huell moves to New York City where he reports on a magazine show for WCBS-TV. While in New York he briefly hosts an early reality TV show called \"Wedding Day.\"\n\n", "mediaurl": "", "readmoreurl": "", "title": " Huell moves to WCBS in New York", "mediatype": "", "caption": "", "displaydate": "1979", "date": "January 1, 1979", "readmoresource": ""}, {"body": "Howser earns a B.A. in history from the University of Tennessee, Knoxville, where he becomes student body president. \n", "mediaurl": "", "readmoreurl": "http://www.laobserved.com/archive/2010/04/can_you_spot_huell_howser.php", "title": "Howser graduates UT", "mediatype": "", "caption": "", "displaydate": "1960s", "date": "January 1, 1960", "readmoresource": ""}, {"body": "Huell Howser – named for his parents Harold and Jewell – is born in Gallatin, Tennessee.\n\n", "mediaurl": "", "readmoreurl": "", "title": "Huell born in Tennessee", "mediatype": "", "caption": "", "displaydate": "Oct. 18, 1945", "date": "October 18, 1945", "readmoresource": ""}]