[{"body": "The LA Unified school board approved spending $22 million ($13 million in new funds) to buy more iPads and Google Chromebooks so students can take new digital state tests in the spring. The purchase brings the number of district tablets and laptops to 120,000 – a figure that does not include equipment in computer labs, which are are not tracked in district's central inventory.  Both funding measures passed unanimously without discussion by board members, even though just a week ago the FBI seized boxes of district documents in criminal probe of the district's iPad program. The newest iPads will be purchased under a different agreement than the Apple and Pearson software contract under investigation.", "mediaurl": "", "readmoreurl": "", "title": "School board approves spending $13 million in new funds money for more iPads, Chromebooks", "mediatype": "", "caption": "", "displaydate": "Dec. 9, 2014", "date": "12/9/2014", "readmoresource": ""}, {"body": "", "mediaurl": "http://a.scpr.org/i/ae49f84f34634ff107c1777ecb7976dd/96526-full.jpg", "readmoreurl": "http://www.scpr.org/blogs/education/2014/12/04/17638/lausd-students-hope-for-ipads-prepare-for-disappoi/", "title": "LAUSD students hope for iPads, prepare for disappointment", "mediatype": "image", "caption": "King Drew Magnet High School 11th-graders Maria Delgado and Christian Acuna said they're disappointed the school district canceled iPad orders for their campus and 26 others.", "displaydate": "Dec. 4, 2014", "date": "12/4/2014", "readmoresource": "KPCC"}, {"body": "A federal grand jury will meet Friday to review evidence regarding the Los Angeles Unified School District's handling of its $1.3 billion iPad program, documents show. In a sweeping subpoena issued Nov. 21, the U.S. Attorney's public corruption office sought dozens of records from the school district, naming documents specifically tied to computer giant Apple and Pearson, the publisher of the software loaded onto each device. The investigation came as a surprise to district officials and will delay the rollout of iPads to more students in the district.\n", "mediaurl": "", "readmoreurl": "http://www.scpr.org/blogs/education/2014/12/03/17631/lausd-ipad-purchases-subject-of-federal-criminal-p/", "title": "LAUSD iPad purchases subject of federal criminal probe", "mediatype": "", "caption": "", "displaydate": "Dec. 3, 2014", "date": "12/3/2014", "readmoresource": "KPCC"}, {"body": "Los Angeles Unified School District will cancel a contract with Apple to provide iPads for students and strike a new agreement with the company in the wake of an FBI seizure of district documents related to the tablet program. Superintendent Ramon Cortines said Tuesday that the current Apple contract is flawed and he will restart the procurement process for 27 more schools that are scheduled to receive the devices. Meanwhile, federal prosecutors subpoenaed dozens of records and documents relating to the Los Angeles Unified School District’s iPad program, including emails, proposals and score sheets dealing with the bids that led to a multi-million Apple contract with the district. The prosecutors specifically seek records about the tablet program, known as the Common Core Technology Project, including documents relating to Apple and the Pearson software company. The subpoena also calls for records from the district’s inspector general, who had investigated the iPad purchase.", "mediaurl": "http://a.scpr.org/i/5d3b1ef04a99a5314dd0482f9f80086a/75658-full.jpg", "readmoreurl": "http://www.scpr.org/news/2014/12/02/48409/lausd-ipads-federal-agents-confiscate-documents-re/", "title": "Cortines said he's canceling latest iPad contract; district ordered to produce records", "mediatype": "image", "caption": "File photo shows a new Apple iPad being held by a guest at an Apple Special Event at the Yerba Buena Center for the Arts on Jan. 27, 2010, in San Francisco. On Monday, Dec. 2, 2014, FBI agents reportedly hauled away 20 boxes of documents related to LAUSD's iPad program.", "displaydate": "Dec. 2, 2014", "date": "12/2/2014", "readmoresource": "KPCC"}, {"body": "FBI agents paid a surprise visit to the Los Angeles Unified School District on Monday, hauling away boxes of documents related to the school district's troubled iPad program, the Los Angeles Times reports. Superintendent Ramon C. Cortines told the Times agents stopped by late Monday afternoon and he alerted the district's general counsel to notify the board of education. Two sources who spoke with KPCC on condition of anonymity confirmed that agents arrived at the district Monday and took away the documents. One of the sources also confirmed Cortines’ statement to the Times that the agents took 20 boxes of documents related to the iPad purchases as part of the district’s one-to-one technology project.", "mediaurl": "", "readmoreurl": "http://www.scpr.org/news/2014/12/02/48409/lausd-ipads-federal-agents-confiscate-documents-re/#1058", "title": "Federal agents confiscate documents related to district's troubled iPad program", "mediatype": "", "caption": "", "displaydate": "Dec. 1, 2014", "date": "12/1/2014", "readmoresource": "KPCC"}, {"body": "Under new leadership, the LA Unified School District moves full steam ahead with its iPad program, expanding it to 27 schools.", "mediaurl": "http://a.scpr.org/i/a631d10af8777cbc2ec4e7e27d685473/69379-full.jpg", "readmoreurl": "http://www.scpr.org/blogs/education/2014/11/21/17600/lausd-sending-ipads-laptops-to-27-more-schools/", "title": "LAUSD sending iPads, laptops to 27 more schools", "mediatype": "image", "caption": "The Los Angeles school district is expanding its iPad program, adding 27 schools to those outfitted with tablets or laptops.", "displaydate": "Nov. 21, 2014", "date": "11/21/2014", "readmoresource": "KPCC"}, {"body": "Former Supt. John Deasy canceled the iPad contract after KPCC reported he met with vendors before bids. Ramon Cortines wants to use it buy more devices.", "mediaurl": "http://a.scpr.org/i/4da6c0035abb2d32927ad9a008b9be0b/94164-full.jpg", "readmoreurl": "http://www.scpr.org/blogs/education/2014/11/19/17583/ipad-contract-resurected-lausd-to-spend-22-million/", "title": "iPad contract resurrected: LAUSD to spend $22 million on tech", "mediatype": "image", "caption": "Brayan Aguilar, 17, and Yadira Aragon, 16, use iPads to read electronic books in a literacy class at Diego Rivera Learning Complex.", "displaydate": "Nov. 19, 2014", "date": "11/19/2014", "readmoresource": "KPCC"}, {"body": "The campaign for more funds – expected within the next decade – may face opposition from voters feeling burned by controversial and over-budget projects, such as the district's iPad program.", "mediaurl": "http://a.scpr.org/i/2895ab721f8a364ef8c1c9e65e5ceb1a/92022-full.jpg", "readmoreurl": "http://www.scpr.org/blogs/education/2014/11/17/17561/lausd-eyeing-more-bonds-as-funds-for-school-repair/", "title": "LAUSD eyeing more bonds as funds for school repairs dwindle", "mediatype": "image", "caption": "File: Christopher Cadena climbs in a 5-foot-deep hole, unearthing a leaking water main that feeds the fire sprinkler system at Hoover Street Elementary School. A backlog of repair requests includes plumbing problems that plague many campuses. ", "displaydate": "Nov. 17, 2014", "date": "11/17/2014", "readmoresource": "KPCC"}, {"body": "Los Angeles Unified school police say 80 new officers are needed to provide \"safe passage\" for students walking home from school with $500 iPads. Safety concerns thwarted plans for students to take home tablets when 47 schools piloted the program last fall, but school officials say they have addressed the issues and plan to send students home with their iPads from select campuses in the next couple of weeks.", "mediaurl": "http://a.scpr.org/i/39b36b9262722f0f16920ea8060c8e51/87522-full.jpg", "readmoreurl": "http://www.scpr.org/blogs/education/2014/10/31/17495/la-unified-police-say-8-million-needed-to-keep-ipa/", "title": "LA Unified police say $8 million needed to keep iPad-toting students safe", "mediatype": "image", "caption": "", "displaydate": "Oct. 31, 2014", "date": "10/31/2014", "readmoresource": "KPCC"}, {"body": "LAUSD Supt. John Deasy is stepping down, the district confirmed Thursday, adding that he will remain on special assignment through Dec. 31.", "mediaurl": "http://a.scpr.org/i/0ce7c619ed38f339fe6e353b3372e463/44753-full.jpg", "readmoreurl": "http://www.scpr.org/blogs/education/2014/10/16/17429/la-unified-s-superintendent-poised-to-resign/", "title": "LAUSD Supt. John Deasy resigns; Cortines named interim replacement", "mediatype": "image", "caption": "File: Los Angeles Unified Superintendent John Deasy speaks during a press conference at South Region High School #2 in Los Angeles on Feb. 6, 2012. ", "displaydate": "Oct. 16, 2014", "date": "10/16/2014", "readmoresource": "KPCC"}, {"body": "The superintendent responds to concerns about fairness in the bidding process, more than a week after KPCC published emails showing detailed talks between executives and district staff ahead of the bid for tablets. ", "mediaurl": "http://a.scpr.org/i/6679161766bc539aa1a618556bb0c43f/70934-full.jpg", "readmoreurl": "http://www.scpr.org/blogs/education/2014/09/03/17241/la-schools-ipads-superintendent-deasy-explains-pea/", "title": "LAUSD Supt. John Deasy explains Pearson, Apple meetings", "mediatype": "image", "caption": "LAUSD Supt. John Deasy speaks during a press conference at South Region High School No. 2 in Los Angeles on Feb. 6, 2012.", "displaydate": "Sept. 3, 2014", "date": "9/3/2014", "readmoresource": "KPCC"}, {"body": "LA Unified officials evaluating bids for a massive technology project received iPads and attended a weekend sales pitch in Palm Springs.", "mediaurl": "http://a.scpr.org/i/a952a1845208c2f6431030da129dd6ad/72283-full.jpg", "readmoreurl": "http://www.scpr.org/blogs/education/2014/08/29/17214/la-schools-ipads-officials-on-bid-committee-got-fr/", "title": "Officials on iPad bid committee got free tablets, resort trips", "mediatype": "image", "caption": "LAUSD has already purchased 75,000 iPads, half with Pearson software. Here, second graders at Baldwin Hills Elementary swipe through their iPads for the first time and call out the apps they see. ", "displaydate": "Aug. 29, 2014", "date": "8/29/2014", "readmoresource": "KPCC"}, {"body": "In light of troubling emails revealed by KPCC, the inspector general is investigating communication between software executives and LAUSD staff.", "mediaurl": "http://a.scpr.org/i/5d3b1ef04a99a5314dd0482f9f80086a/75658-full.jpg", "readmoreurl": "http://www.scpr.org/blogs/education/2014/08/27/17212/emails-prompt-la-schools-inspector-general-to-reop/", "title": "Emails prompt LA schools' inspector general to reopen iPad probe", "mediatype": "image", "caption": "SAN FRANCISCO - JANUARY 27:  An event guest plays with the new Apple iPad during an Apple Special Event at Yerba Buena Center for the Arts January 27, 2010 in San Francisco, California. CEO Steve Jobs and Apple Inc. introduced its latest creation, the iPad, a mobile tablet browsing device that is a cross between the iPhone and a MacBook laptop.  (Photo by Justin Sullivan/Getty Images)", "displaydate": "Aug. 27, 2014", "date": "8/27/2014", "readmoresource": "KPCC"}, {"body": "An audit of the Los Angeles Unified School District's computer inventory reveals 230 devices worth nearly $200,000 have been stolen or are missing - and school officials can't account for another 3,105 laptops, desktops and iPads. \"The district did not have a complete, adequate and centralized inventory record of all of its computers,\" reads the July 29, 2014 report by the school district's Inspector General, Ken Bramlett. The report comes just as controversy surrounding the district's one-to-one technology program reaches new heights over questions about the fairness of the bidding process.", "mediaurl": "http://a.scpr.org/i/7905ad141b89082c4d9fe957dc1bbaed/75184-full.jpg", "readmoreurl": "http://www.scpr.org/blogs/education/2014/08/27/17215/la-schools-audit-finds-hundreds-of-computers-stole/", "title": "LA schools' audit finds hundreds of computers stolen, missing; thousands unaccounted for", "mediatype": "image", "caption": "", "displaydate": "Aug. 27, 2014", "date": "8/27/2014", "readmoresource": "KPCC"}, {"body": "LAUSD said Monday it'll cancel a contract with Pearson and Apple, after KPCC published emails showing executives met with school officials prior to bidding. ", "mediaurl": "http://a.scpr.org/i/fa264d803444729c1fc7c938717d9735/70742-full.jpg", "readmoreurl": "http://www.scpr.org/blogs/education/2014/08/25/17202/la-schools-cancel-ipad-contracts-after-kpcc-publis/", "title": "Updated: LA schools cancel iPad contracts after KPCC publishes internal emails", "mediatype": "image", "caption": "LAUSD Supt. John Deasy speaks during a press conference at South Region High School No. 2 in  2012. ", "displaydate": "Aug. 25, 2014", "date": "8/25/2014", "readmoresource": "KPCC"}, {"body": "After an investigation by KPCC uncovered planning by LAUSD and publishing giant Pearson ahead of contract, Pearson claims it was discussing a \"pilot\". ", "mediaurl": "http://a.scpr.org/i/efa15d58a80a8ad50614bea1a72a4d61/84921-full.jpg", "readmoreurl": "http://www.scpr.org/blogs/education/2014/08/25/17201/publishing-giant-pearson-says-la-school-officials/", "title": "Publishing giant Pearson says LA school officials emails part of pilot project", "mediatype": "image", "caption": "", "displaydate": "Aug. 25, 2014", "date": "8/25/2014", "readmoresource": "KPCC"}, {"body": "Emails obtained by KPCC show Los Angeles Unified School District Superintendent John Deasy personally began meeting with Pearson and Apple to discuss the eventual purchase of their products starting nearly a year before the contract went out to public bid.", "mediaurl": "http://a.scpr.org/i/6679161766bc539aa1a618556bb0c43f/70934-full.jpg", "readmoreurl": "http://www.scpr.org/blogs/education/2014/08/22/17193/internal-emails-show-la-school-officials-started-i/", "title": "Internal emails show LA school officials started iPad talks with software supplier a year before bids", "mediatype": "image", "caption": "", "displaydate": "Aug. 22, 2014", "date": "8/22/2014", "readmoresource": "KPCC"}, {"body": "The LA Unified School District says it will allow some high schools to provide laptops instead of the Apple tablets.", "mediaurl": "http://a.scpr.org/i/8bf9bd3f623ff42c9151feb9a1fb1a85/70605-full.jpg", "readmoreurl": "http://www.scpr.org/news/2014/06/30/45064/some-schools-will-get-laptops-instead-of-ipads-say/", "title": "Some schools will get laptops instead of iPads, says LAUSD", "mediatype": "image", "caption": "The Los Angeles Unified School District says it will allow some high schools to provide laptops instead of the Apple tablets. (Photo by Justin Sullivan/Getty Images)", "displaydate": "June 30, 2014", "date": "6/30/2014", "readmoresource": "KPCC"}, {"body": "Architect Stuart Magruder was removed from a committee overseeing bond funds. He has repeatedly questioned their use to buy iPads.", "mediaurl": "http://a.scpr.org/i/efa15d58a80a8ad50614bea1a72a4d61/84921-full.jpg", "readmoreurl": "http://www.scpr.org/blogs/education/2014/05/21/16680/ousted-opponent-of-la-schools-ipad-fights-to-regai/", "title": "Ousted opponent of LA schools iPad fights to regain seat on oversight committee", "mediatype": "image", "caption": "", "displaydate": "May 21, 2014", "date": "5/21/2014", "readmoresource": "KPCC"}, {"body": "LAUSD spent more than $20 million on the iPads for new digital tests. Recent district data shows some haven't been up to the task.", "mediaurl": "http://a.scpr.org/i/9bfb0cd8856ed4555ed30b7964786b68/72336-full.jpg", "readmoreurl": "http://www.scpr.org/blogs/education/2014/04/30/16498/ipad-wifi-issues-interrupt-la-schools-testing/", "title": "iPad, Wi-Fi issues interrupt LA schools testing", "mediatype": "image", "caption": "Second graders at Baldwin Hills Elementary students get their iPads for the first time on Nov. 15, 2014. Baldwin Hills is the final school to receive iPads as part of LAUSD's pilot program.", "displaydate": "April 30, 2014", "date": "4/30/2014", "readmoresource": "KPCC"}, {"body": "When the Los Angeles Unified School District set out last year to buy tablets for every teacher and student, officials drew up a scoring system to rate 19 hardware and software options. The scores meant a lot: the contract will ultimately be worth about $500 million and marks the largest school technology expansion in the country. The winners were Apple and global education publisher Pearson PLC, which received nearly twice as many points as the next highest software bidder. But there was a hitch: Pearson’s software wasn’t ready – and it still isn't.", "mediaurl": "http://a.scpr.org/i/025472df8501624bce06769e42324906/69755-full.jpg", "readmoreurl": "http://www.scpr.org/blogs/education/2014/03/10/16000/la-schools-ipads-officials-chose-incomplete-softwa/", "title": "LA Schools iPads: Officials chose incomplete software over competitors", "mediatype": "image", "caption": "", "displaydate": "March 10, 2014", "date": "3/10/2014", "readmoresource": "KPCC"}, {"body": "William Johnston, who was superintendent of the Los Angeles Unified School District during the 1970s, is urging officials to stop using bond funds to buy iPads - leading an oversight committee to take up the issue Thursday. The committee has sided with the current administration, recommending the school board use school construction bonds to expand the iPad program. Once fully implemented, it's expected to cost $1.3 billion, most of which will be spent on upgrading wifi at schools. \"I believe the current purchase of iPads with school bonds is illegal,\" Johnston said in a letter addressed to the chairman of the district's bond oversight committee, Steve English. \"New developments and technology will make them obsolete, requiring replacement. School bonds are designed to buy property, build schools, equip schools with lasting equipment.\"", "mediaurl": "http://a.scpr.org/i/98cf48636db20b4fe13218d91d5e6eb2/75659-full.jpg", "readmoreurl": "http://www.scpr.org/blogs/education/2014/02/27/15944/former-l-a-schools-superintendent-bonds-weren-t-me/", "title": "Former L.A. schools superintendent: bonds weren't meant for iPads", "mediatype": "image", "caption": "", "displaydate": "Feb. 27, 2014", "date": "2/27/2014", "readmoresource": "KPCC"}, {"body": "Officials with the Los Angeles Unified School district acknowledged at a public meeting Thursday afternoon that they did not consider existing computer inventories when buying the latest round of iPads for schools. KPCC had reported that many schools were scheduled to receive the new tablets to take digital state tests  - even if they already had fleets of laptops, iPads or other devices.", "mediaurl": "http://a.scpr.org/i/9dc145ddd43c6c66d36bf286bba7c822/72335-full.jpg", "readmoreurl": "http://www.scpr.org/blogs/education/2014/02/06/15790/la-school-officials-acknowlege-they-ignored-comput/", "title": "LA school officials acknowlege they ignored computer inventories in latest iPad purchase", "mediatype": "image", "caption": "", "displaydate": "Feb. 6, 2014", "date": "2/6/2014", "readmoresource": "KPCC"}, {"body": "A committee questioned Tuesday whether competitors were given a fair shot at the $30 million contract given to Apple and education curriculum developer Pearson.", "mediaurl": "http://a.scpr.org/i/a952a1845208c2f6431030da129dd6ad/72283-full.jpg", "readmoreurl": "http://www.scpr.org/blogs/education/2014/01/07/15551/la-unified-staff-received-free-ipad-before-contrac/", "title": "LA Unified staff received free iPad before contract", "mediatype": "image", "caption": "Second graders at Baldwin Hills Elementary swipe through their iPads for the first time and call out the apps they see. Baldwin Hills is the final school to receive iPads as part of LAUSD's pilot program.", "displaydate": "Jan. 7, 2014", "date": "1/7/2014", "readmoresource": "KPCC"}, {"body": "Getting iPads in the hands of every student and teacher comes with huge networks costs. Connecting all those tablets to the Internet will cost hundreds of millions.", "mediaurl": "http://a.scpr.org/i/3cae397f6e42f2a4e5ec7640af14d45a/74275-full.jpg", "readmoreurl": "http://www.scpr.org/blogs/education/2013/12/19/15437/network-upgrades-to-push-up-cost-of-la-schools-mas/", "title": "Network upgrades to push up cost of LA schools' massive iPad project", "mediatype": "image", "caption": "An average of $750,000 per school is budgeted for Wi-Fi upgrades necessary for every student to have an iPad.", "displaydate": "Dec. 19, 2013", "date": "12/19/2013", "readmoresource": "KPCC"}, {"body": "The Los Angeles Unified School District's bond oversight committee is scheduled to vote Wednesday on whether the school system should expand its iPad program by another $135 million — much of which will come from bond funds. The committee's recommendations will go the school board — which has the ultimate power to decide how to spend the money. Phase one of the program was wrought with complications and came in millions of dollars over budget. But none of that mattered to a class of second graders at Baldwin Hills Elementary School, the last to receive iPads as part of the pilot program.\n\n", "mediaurl": "http://a.scpr.org/i/868582d28c95793600659124d0cc5e26/72292-full.jpg", "readmoreurl": "http://www.scpr.org/blogs/education/2013/11/20/15228/badlwin-hills-students-squeal-with-delight-over/", "title": "Baldwin Hills students squeal with delight over iPads as LA schools committee considers expansion", "mediatype": "image", "caption": "", "displaydate": "Nov. 20, 2013", "date": "11/20/2013", "readmoresource": "KPCC"}, {"body": "LAUSD has tapped promotional filmmaker Art Simon to make a documentary-style video about the iPad project – the district's initiative to give every student a tablet computer.", "mediaurl": "http://a.scpr.org/i/6616a50d7cb0704f1527ec78ea32b0a0/69747-full.jpg", "readmoreurl": "http://www.scpr.org/blogs/education/2013/11/14/15191/l-a-unified-ipads-the-movie/", "title": "LA Unified sponsors promotional video for iPad program", "mediatype": "image", "caption": "Kids at KIPP Comienza Community Prep elementary school in Huntington Park are glued to their iPads.", "displaydate": "Nov. 14, 2013", "date": "11/14/2013", "readmoresource": "KPCC"}, {"body": "In a late-night deal striking a middle ground between opposing motions, the L.A. Unified school board on Tuesday approved the purchase of 70,000 more iPads and to equip seven high schools with laptops. Under the plan, the district will both move forward with expanding the program and study the effectiveness of both devices before deciding how to equip the remaining students.", "mediaurl": "http://a.scpr.org/i/ceabedef2cdb2f314c80b2300d940f14/69754-full.jpg", "readmoreurl": "http://www.scpr.org/blogs/education/2013/11/13/15163/la-unified-board-to-vote-on-future-of-ipad-program/", "title": "LA Unified board approved more iPads and new laptops", "mediatype": "image", "caption": "", "displaydate": "Nov. 13, 2013", "date": "11/13/2013", "readmoresource": "KPCC"}, {"body": "All pilot schools were slated to receive their iPads by the end of the month, but deployment has hit several snags. Some have backed out, others say Wi-Fi is glitchy.", "mediaurl": "http://a.scpr.org/i/025472df8501624bce06769e42324906/69755-full.jpg", "readmoreurl": "http://www.scpr.org/blogs/education/2013/10/11/14956/la-unified-s-ipads-pilot-phase-continues-on-bumpy/", "title": "LA Unifieds iPads pilot phase continues on bumpy road: Schools back out, suffer technical glitches", "mediatype": "image", "caption": "A student uses an iPad during class in Huntington Park.", "displaydate": "Oct. 11, 2013", "date": "10/11/2013", "readmoresource": "KPCC"}, {"body": "Los Angeles Unified School District Superintendent John Deasy has trumpeted his $1 billion iPad project as transformational. As with many reformers, Deasy sees data as a pillar of his administration. But when asked for evidence that points toward a transformation, Deasy said in an interview that it's all too new. Instead, he listed imperatives. “If it's good enough for the wealthiest kids, it’s good enough for every kid,” said Deasy, who often compares the project to a “civil rights” issue. “They deserve exactly the same. I’m sick and tired of us being concerned that because of the zip code you live in you could possibly have something less.”", "mediaurl": "", "readmoreurl": "http://www.scpr.org/blogs/education/2013/10/09/14928/big-promises-with-ipads-but-the-data-doesn-t-deliv/", "title": "LA schools and iPads: Big promises but where's the research?", "mediatype": "", "caption": "", "displaydate": "Oct. 9, 2013", "date": "10/9/2013", "readmoresource": "KPCC"}, {"body": "Since it began the first phase of its roll out, the LAUSDs $1 billion iPad program has been plagued with issues. First, some 300 students figured out how to unlock the security feature on the devices so they could use them to surf prohibited websites, which led the district to ban kids from taking their iPads home. A couple days later, school district officials said that about 70 iPads out of about 14,000 issued so far had gone missing.", "mediaurl": "http://a.scpr.org/i/f4e3624e1256bfe606c2a911f84848b3/69124-full.jpg", "readmoreurl": "http://www.scpr.org/programs/airtalk/2013/09/30/33969/lausd-superintendent-john-deasy-on-the-ipad-progra/", "title": "LAUSD Supt. John Deasy appears on AirTalk to talk about the iPad program", "mediatype": "image", "caption": "", "displaydate": "Sept. 30, 2013", "date": "9/30/2013", "readmoresource": "KPCC"}, {"body": "Deputy Superintendent of Instruction Jaime Aquino has notified the LA Unified School District that he plans to resign from his post at the end of the year, a district spokesman said.", "mediaurl": "", "readmoreurl": "http://www.scpr.org/blogs/education/2013/09/13/14741/top-la-school-district-official-resigns/", "title": "Top school official resigns amid turn to new teaching standard", "mediatype": "", "caption": "", "displaydate": "Sept. 13, 2013", "date": "9/13/2013", "readmoresource": "KPCC"}, {"body": "The district said it would supply tablets to all students and teachers at 47 schools by August, records show. But on the first day of school Tuesday, seven schools that spoke to KPCC said they didn’t have the tablets for their students yet – and wouldn’t until as late as October in some cases.", "mediaurl": "http://a.scpr.org/i/c107ecce995941a2dc74bc78544ea5fc/65783-full.jpg", "readmoreurl": "http://www.scpr.org/blogs/education/2013/08/14/14511/no-ipads-on-first-day-of-classes-for-students-in-l/", "title": "No iPads on first day of classes for students in LA Unified", "mediatype": "image", "caption": "", "displaydate": "Aug. 14, 2013", "date": "8/14/2013", "readmoresource": "KPCC"}, {"body": "", "mediaurl": "http://a.scpr.org/i/3cb65ae100fc93ec024d08bd5c5c3360/60174-full.jpg", "readmoreurl": "", "title": "LAUSD awards Apple $30 million contract to supply iPads in classrooms", "mediatype": "image", "caption": "", "displaydate": "June 19, 2013", "date": "6/19/2013", "readmoresource": ""}, {"body": "The Board of Education approves Deasy's proposal to spend millions to supply every student and teacher with a tablet computer by 2014. Reports at the time said Deasy's plan to supply all 650,000 students in the district with a tablet computer by 2014 will ultimately cost $500 million. The tablets are supposed to support the transition to Common Core Standards. They are being paid for by revenues raised for school construction bonds R, Y, and Q, which voters approved to address \"unmet facilities needs.\" Board member Bennett Kayser abstained from the vote, saying in a statement after the meeting that the process should be slowed down and studied further. No one voted against the measure.", "mediaurl": "http://a.scpr.org/i/d14cd6e591e54b1747b2c51c37fb72ef/32595-full.jpg", "readmoreurl": "http://www.scpr.org/blogs/education/2013/02/12/12532/lausd-backtracks-school-board-votes-down-proposed-/", "title": "LAUSD board votes down proposed staff layoffs; approves iPads", "mediatype": "image", "caption": "", "displaydate": "Feb. 12, 2013", "date": "2/12/2013", "readmoresource": "KPCC"}]