[{"body": "Pasadena Police shoot and kill unarmed 19-year old Kendrec McDade in Pasadena after a 911 caller reported being robbed by two men who had a gun near Orange Grove Boulevard and Raymond Avenue. Police say McDade reached for his waistband and officers fired.", "mediaurl": "https://a.scpr.org/i/1b3b883adb8457c28a7e07ea3bdc107b/36054-full.jpg", "readmoreurl": "http://www.pasadenastarnews.com/general-news/20120326/pasadena-community-leaders-seek-answers-following-death-of-teen-at-hands-of-police", "title": "Nineteen-year-old Kendrec McDade shot and killed by Pasadena Police", "mediatype": "image", "caption": "In this undated family photo Kendrec McDade, then a high school student, is seen wearing his Aztecs Football team uniform. McDade was shot by police after being chased and making a move, reaching into his waistband, according to police.", "displaydate": "March 24", "date": "3/24/2012", "readmoresource": "Pasadena Star-News"}, {"body": "Authorities arrest Oscar Carrillo and charge him with involuntary manslaughter in connection with the shooting death of McDade. Carrillo had told a 911 operator that two men pointed a gun at him and stole his laptop computer, but police officials say that the man lied about the gun and that neither McDade nor the other person were armed. After investigators interviewed Carrillo and listened to the 911 call, they realized his report had many inconsistencies, according to Police Chief Phillip Sanchez.", "mediaurl": "", "readmoreurl": "http://www.scpr.org/blogs/news/2012/03/28/5292/police-arrest-911-caller-who-reported-robbery-led-/", "title": "911 caller who reported robbery arrested", "mediatype": "", "caption": "", "displaydate": "March 28", "date": "3/28/2012", "readmoresource": "KPCC"}, {"body": "A lawsuit against Pasadena and its police department alleges civil rights violations and wrongful death.", "mediaurl": "https://a.scpr.org/i/d57d8f61108dde81e0d47de89cd69677/36493-full.jpg", "readmoreurl": "http://www.scpr.org/news/2012/04/03/31894/family-slain-teen-kendrec-mcdade-files-suit-agains/", "title": "McDade's family files suit against Pasadena PD", "mediatype": "image", "caption": "Flowers and votive candles left by family and friends on the Pasadena corner where Kendrec McDade was killed on March 24, 2012.", "displaydate": "April 3", "date": "4/3/2012", "readmoresource": "KPCC"}, {"body": "Los Angeles County's Office of Independent Review begins to examine the McDade shooting and will focus on the emergency phone call, the officer-involved shooting and the police response — including that of the officer who shot McDade from inside his patrol car. ", "mediaurl": "https://a.scpr.org/i/0592c14b3efa3d6919282fce738efbb7/36239-full.jpg", "readmoreurl": "http://www.scpr.org/news/2012/04/05/31922/office-independent-review-begins-investigation-pas/", "title": "Office of Independent Review to investigate McDade shooting", "mediatype": "image", "caption": "Investigators from the L.A.  Office of Independent Review Rob Miller and Michael Gennaco, April 5, 2012. They spoke to media outside of Pasadena Police headquarters after meeting with the police chief and city manager about the investigation into the police-involved shooting of unarmed teen Kendrec McDade.", "displaydate": "April 5", "date": "4/5/2012", "readmoresource": "KPCC"}, {"body": "FBI investigators join two other agencies investigating the circumstances around the shooting death of Kendrec McDade by Pasadena Police. The Los Angeles County district attorney and the county's Office of Independent Review are each conducting their own probes.", "mediaurl": "", "readmoreurl": "http://www.scpr.org/news/2012/04/06/31934/fbi-will-investigate-officer-involved-shooting-lef/", "title": "FBI investigators join the investigation into McDade shooting", "mediatype": "", "caption": "", "displaydate": "April 6", "date": "4/6/2012", "readmoresource": "KPCC"}, {"body": "A 17-year-old boy admits to his involvement in a burglary and theft that led to the fatal police shooting of Kendrec McDade.", "mediaurl": "", "readmoreurl": "http://www.scpr.org/blogs/news/2012/05/01/5889/teen-admits-involvement-kendrec-mcdade-shooting/", "title": "Teen admits involvement in burglary prior to shooting of Kendrec McDade", "mediatype": "", "caption": "", "displaydate": "May 1", "date": "5/1/2012", "readmoresource": "KPCC"}, {"body": "McDade was shot at point-blank range by one Pasadena police officer, struck by a total of seven bullets, then handcuffed, according to an autopsy report released by the L.A. County Coroner's Office. The sequence of events seemed to start when the officer behind the wheel of a cruiser fired four times at McDade through an open window. His partner, who was on foot, fired another four rounds, believing there was a gunfight in progress. McDade was then handcuffed on the ground. Paramedics were called to the scene immediately following the March 24 shooting, the report shows. McDade was described as alert and \"combative\" before arriving at Huntington Memorial Hospital. He died approximately 90 minutes later. The autopsy report says three of the seven wounds, two to McDade's abdomen and one to his right arm, were fatal.", "mediaurl": "", "readmoreurl": "http://www.scpr.org/blogs/news/2012/05/11/6085/kendrec-mcdade-shot-point-blank-struck-7-bullets/", "title": "McDade autopsy shows teen struck by seven bullets", "mediatype": "", "caption": "", "displaydate": "May 11", "date": "5/11/2012", "readmoresource": "KPCC"}, {"body": "The attorney representing Kendrec McDade's family says the autopsy report released Friday raises questions about whether police shot the unarmed black teen as he was down. Attorney Caree Harper says the report is inconsistent with statements made by the Pasadena Police Department.", "mediaurl": "https://a.scpr.org/i/b4ca17a1f784838f87d3eb83b5ca49ba/38297-full.jpg", "readmoreurl": "http://www.scpr.org/news/2012/05/12/32402/family-kendrec-mcdade-raises-questions-about-autop/", "title": "McDade family raises questions about autopsy", "mediatype": "image", "caption": "Attorney Caree Harper points to diagrams in the autopsy report of Kendrec McDade, 19, who was shot and killed by Pasadena police. His parents sit to the left and right of Harper. ", "displaydate": "May 12", "date": "5/12/2012", "readmoresource": "KPCC"}, {"body": "Pasadena's police chief said he's investigating two officers on accusations that they intimidated suspects and witnesses. One of those officers is a detective investigating the officer-involved shooting of Kendrec McDade.", "mediaurl": "https://a.scpr.org/i/aa809533873ff726d61d5481b32effce/36313-full.jpg", "readmoreurl": "http://www.scpr.org/news/2012/05/18/32486/two-pasadena-police-officers-are-under-internal-in/", "title": "Two Pasadena officers under internal investigation for allegedly intimidating suspects, witnesses", "mediatype": "image", "caption": "Pasadena Police Chief Phillip Sanchez says he's investigating two officers on accusations that they intimidated suspects and witnesses.", "displaydate": "May 18", "date": "5/18/2012", "readmoresource": "KPCC"}, {"body": "Oscar Carrillo's 911 call led police to shoot 19-year-old Kendrec McDade. Carrillo, 27, reported to Pasadena police on March 24 that two men had pointed guns at him and stolen his backpack. When police responded, they encountered McDade on a street near the alleged robbery. Police say McDade reached for his waistband so they opened fire, wounding him seven times. Carrillo later admitted he lied about the two men having guns.", "mediaurl": "https://a.scpr.org/i/78d40ab7571c98eec69e1a7ad5dd525a/36461-full.jpg", "readmoreurl": "http://www.scpr.org/blogs/news/2012/10/23/10668/l-distict-attorney-declines-file-charges-against-9/", "title": "Los Angeles County DA declines to file involuntary manslaughter charges against 911 caller", "mediatype": "image", "caption": "McDade family attorney Caree Harper, center (flanked by the victim's parents), has said she believes Oscar Carrillo committed a felony when he lied to police about his assailants being armed.", "displaydate": "Oct. 23", "date": "10/23/2012", "readmoresource": "KPCC"}, {"body": "The DA's office has concluded that Pasadena police officers responding to a robbery report acted lawfully when they shot to death a suspect who turned out to be unarmed.", "mediaurl": "", "readmoreurl": "http://www.scpr.org/blogs/news/2012/12/17/11586/la-county-da-pasadena-police-shooting-19-year-old-/", "title": "Los Angeles County DA: McDade shooting lawful", "mediatype": "", "caption": "", "displaydate": "Dec. 17", "date": "12/17/2012", "readmoresource": "KPCC"}, {"body": "An internal review by the Pasadena Police Department into the fatal officer-involved shooting of 19-year-old Kendrec McDade found that the officers acted \"within policy.\"", "mediaurl": "https://a.scpr.org/i/527dd1b526004ea8fb6942acc268346e/43358-full.jpg", "readmoreurl": "http://www.scpr.org/blogs/news/2013/03/21/13008/pasadena-pd-officers-who-shot-kendrec-mcdade-acted/", "title": "Pasadena PD: Officers acted \"within departmental policy\" ", "mediatype": "image", "caption": "Pasadena Police Chief Phillip Sanchez addresses the March 2012 police shooting of Kendrec McDade, 19, at a news conference. ", "displaydate": "March 21", "date": "3/21/2013", "readmoresource": "KPCC"}, {"body": "The man who made a false emergency call to Pasadena police, that later contributed to the fatal shooting of an unarmed man, gets three months in jail and community service.", "mediaurl": "", "readmoreurl": "http://www.scpr.org/blogs/news/2013/06/17/14017/caller-who-lied-to-pasadena-police-about-gun-in-mc/", "title": "911 caller sentenced to 3 months in jail", "mediatype": "", "caption": "", "displaydate": "June 17", "date": "6/17/2013", "readmoresource": "KPCC"}, {"body": "The city of Pasadena pays $1 million to the parents of unarmed Kendrec McDade.", "mediaurl": "", "readmoreurl": "http://www.scpr.org/news/2014/06/16/44754/pasadena-pays-1-million-to-parents-of-kendrec-mcda/", "title": "Pasadena pays $1 million to McDade's parents to settle lawsuits", "mediatype": "", "caption": "", "displaydate": "June 16", "date": "6/16/2014", "readmoresource": "KPCC"}, {"body": "An independent report looks into the shooting death of the unarmed college student by Pasadena police officers, but the city wants to withhold portions of it from the public.", "mediaurl": "", "readmoreurl": "http://www.scpr.org/blogs/politics/2014/08/12/17136/pasadena-to-withhold-portions-of-report-on-2012-sh/", "title": "Pasadena withholds portion of report on police McDade shooting", "mediatype": "", "caption": "", "displaydate": "Aug. 12", "date": "8/12/2014", "readmoresource": "KPCC"}, {"body": "A judge orders the city of Pasadena to keep an independent review of the 2012 police shooting of Kendrec McDade concealed until another hearing can be held. ", "mediaurl": "", "readmoreurl": "http://www.scpr.org/news/2014/09/03/46468/kendrec-mcdade-judge-orders-report-on-police-shoot/", "title": "Judge orders report on police shooting of Kendrec McDade sealed", "mediatype": "", "caption": "", "displaydate": "Sept. 3", "date": "9/3/2014", "readmoresource": "KPCC"}, {"body": "A judge lifts a seal and ordered the city of Pasadena to decide whether it will release a report on the 2012 police shooting of Kendrec McDade. ", "mediaurl": "https://a.scpr.org/i/6822c42740ea122f6fa0300a8ab88a47/35734-full.jpg", "readmoreurl": "http://www.scpr.org/news/2014/09/10/46623/kendrec-mcdade-shooting-report-pasadena-has-10-day/", "title": "Pasadena given 10 days to decide on release of Kendrec McDade shooting report ", "mediatype": "image", "caption": "Kendrec McDade", "displaydate": "Sept. 10", "date": "9/10/2014", "readmoresource": "KPCC"}, {"body": "A judge ruled that Pasadena can release a redacted version of an independent report on the police shooting of Kendrec McDade. But further delays were expected.", "mediaurl": "", "readmoreurl": "http://www.scpr.org/news/2014/10/17/47454/kendrec-mcdade-judge-approves-eventual-release-of/", "title": "Judge approves eventual release of report but redaction details up in the air", "mediatype": "", "caption": "", "displaydate": "Oct. 17", "date": "10/17/2014", "readmoresource": "KPCC"}, {"body": "The Pasadena police union asks the California Court of Appeal to block the release of a redacted report on McDade's death. Earlier in November, Los Angeles Superior Court Judge Charles Chalfant ruled that the report from the Office of Independent Review was public - but he gave the Pasadena Police Officers' Association 20 days to appeal the decision. The union filed the petition a week before the deadline.", "mediaurl": "", "readmoreurl": "http://www.scpr.org/news/2014/11/26/48320/kendrec-mcdade-pasadena-police-union-files-petitio/", "title": "Police union tries to prevent release of report on McDade's death", "mediatype": "", "caption": "", "displaydate": "Nov. 26", "date": "11/26/2014", "readmoresource": "KPCC"}, {"body": "According to the LA Times, during the public comment portion of Monday's Pasadena City Council meeting excerpts of the independent report on the police shooting of Kendrec McDade were read into the record, effectively making these portions public.", "mediaurl": "", "readmoreurl": "http://www.latimes.com/local/lanow/la-me-ln-pasadena-transparency-police-officer-shooting-report-20150402-story.html", "title": "Portions of report on fatal shooting read into the record during city council meeting", "mediatype": "", "caption": "", "displaydate": "March 30", "date": "3/30/2015", "readmoresource": "LA Times"}, {"body": "A state appeals court took a step closer to opening a sealed court filing, writing in a letter that it was \"considering vacating\" a previous order to seal a court document, quoting excerpts of an independent report evaluating a fatal police shooting three years ago.", "mediaurl": "", "readmoreurl": "http://www.scpr.org/news/2015/04/02/50741/kendrec-mcdade-report-appeals-court-considers-lift/", "title": "Appeals court considers lifting seal on court filing", "mediatype": "", "caption": "", "displaydate": "April 1", "date": "4/1/2015", "readmoresource": "KPCC"}]
